Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x1c58 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 37 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x9c216): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x8dccd): ../Core/Src/main.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0xabdd): C:/Users/rguilletlhomat/STM32CubeIDE/workspace_1.17.0/Remote_STM32F411CEU6/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_byte_size   : 1
    <2d>   DW_AT_type        : <0x1bf>
    <31>   DW_AT_decl_file   : 3
    <32>   DW_AT_decl_line   : 66
    <33>   DW_AT_decl_column : 1
    <34>   DW_AT_sibling     : <0x1bf>
 <2><38>: Abbrev Number: 9 (DW_TAG_enumerator)
    <39>   DW_AT_name        : (indirect string, offset: 0x8d4df): NonMaskableInt_IRQn
    <3d>   DW_AT_const_value : -14
 <2><3e>: Abbrev Number: 9 (DW_TAG_enumerator)

 <2><1ac>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1ad>   DW_AT_name        : (indirect string, offset: 0xc05e): FPU_IRQn
    <1b1>   DW_AT_const_value : 81
 <2><1b2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1b3>   DW_AT_name        : (indirect string, offset: 0x42f04): SPI4_IRQn
    <1b7>   DW_AT_const_value : 84
 <2><1b8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1b9>   DW_AT_name        : (indirect string, offset: 0x8ccbf): SPI5_IRQn
    <1bd>   DW_AT_const_value : 85
 <2><1be>: Abbrev Number: 0
 <1><1bf>: Abbrev Number: 13 (DW_TAG_base_type)
    <1c0>   DW_AT_byte_size   : 1
    <1c1>   DW_AT_encoding    : 6	(signed char)
    <1c2>   DW_AT_name        : (indirect string, offset: 0x4f0cd): signed char
 <1><1c6>: Abbrev Number: 4 (DW_TAG_typedef)
    <1c7>   DW_AT_name        : (indirect string, offset: 0x8aee4): IRQn_Type
    <1cb>   DW_AT_decl_file   : 3
    <1cc>   DW_AT_decl_line   : 134
    <1cd>   DW_AT_decl_column : 3
    <1ce>   DW_AT_type        : <0x2a>
 <1><1d2>: Abbrev Number: 4 (DW_TAG_typedef)
    <1d3>   DW_AT_name        : (indirect string, offset: 0x2d541): __uint8_t
    <1d7>   DW_AT_decl_file   : 4
    <1d8>   DW_AT_decl_line   : 43
    <1d9>   DW_AT_decl_column : 24
    <1da>   DW_AT_type        : <0x1de>
 <1><1de>: Abbrev Number: 13 (DW_TAG_base_type)
    <1df>   DW_AT_byte_size   : 1
    <1e0>   DW_AT_encoding    : 8	(unsigned char)
    <1e1>   DW_AT_name        : (indirect string, offset: 0x1fe9b): unsigned char
 <1><1e5>: Abbrev Number: 13 (DW_TAG_base_type)
    <1e6>   DW_AT_byte_size   : 2
    <1e7>   DW_AT_encoding    : 5	(signed)
    <1e8>   DW_AT_name        : (indirect string, offset: 0x764b1): short int
 <1><1ec>: Abbrev Number: 4 (DW_TAG_typedef)
    <1ed>   DW_AT_name        : (indirect string, offset: 0x81d5d): __uint16_t
    <1f1>   DW_AT_decl_file   : 4
    <1f2>   DW_AT_decl_line   : 57
    <1f3>   DW_AT_decl_column : 25
    <1f4>   DW_AT_type        : <0x1f8>
 <1><1f8>: Abbrev Number: 13 (DW_TAG_base_type)
    <1f9>   DW_AT_byte_size   : 2
    <1fa>   DW_AT_encoding    : 7	(unsigned)
    <1fb>   DW_AT_name        : (indirect string, offset: 0x97f9b): short unsigned int
 <1><1ff>: Abbrev Number: 13 (DW_TAG_base_type)
    <200>   DW_AT_byte_size   : 4
    <201>   DW_AT_encoding    : 5	(signed)
    <202>   DW_AT_name        : (indirect string, offset: 0xd22f): long int
 <1><206>: Abbrev Number: 4 (DW_TAG_typedef)
    <207>   DW_AT_name        : (indirect string, offset: 0x6479c): __uint32_t
    <20b>   DW_AT_decl_file   : 4
    <20c>   DW_AT_decl_line   : 79
    <20d>   DW_AT_decl_column : 25
    <20e>   DW_AT_type        : <0x212>
 <1><212>: Abbrev Number: 13 (DW_TAG_base_type)
    <213>   DW_AT_byte_size   : 4
    <214>   DW_AT_encoding    : 7	(unsigned)
    <215>   DW_AT_name        : (indirect string, offset: 0x30497): long unsigned int
 <1><219>: Abbrev Number: 13 (DW_TAG_base_type)
    <21a>   DW_AT_byte_size   : 8
    <21b>   DW_AT_encoding    : 5	(signed)
    <21c>   DW_AT_name        : (indirect string, offset: 0x476b6): long long int
 <1><220>: Abbrev Number: 13 (DW_TAG_base_type)
    <221>   DW_AT_byte_size   : 8
    <222>   DW_AT_encoding    : 7	(unsigned)
    <223>   DW_AT_name        : (indirect string, offset: 0x209a6): long long unsigned int
 <1><227>: Abbrev Number: 38 (DW_TAG_base_type)
    <228>   DW_AT_byte_size   : 4
    <229>   DW_AT_encoding    : 5	(signed)
    <22a>   DW_AT_name        : int
 <1><22e>: Abbrev Number: 13 (DW_TAG_base_type)
    <22f>   DW_AT_byte_size   : 4
    <230>   DW_AT_encoding    : 7	(unsigned)
    <231>   DW_AT_name        : (indirect string, offset: 0xcbec): unsigned int
 <1><235>: Abbrev Number: 4 (DW_TAG_typedef)
    <236>   DW_AT_name        : (indirect string, offset: 0x2d543): uint8_t
    <23a>   DW_AT_decl_file   : 5
    <23b>   DW_AT_decl_line   : 24
    <23c>   DW_AT_decl_column : 19
    <23d>   DW_AT_type        : <0x1d2>
 <1><241>: Abbrev Number: 21 (DW_TAG_const_type)
    <242>   DW_AT_type        : <0x235>
 <1><246>: Abbrev Number: 4 (DW_TAG_typedef)
    <247>   DW_AT_name        : (indirect string, offset: 0x73b52): uint16_t
    <24b>   DW_AT_decl_file   : 5
    <24c>   DW_AT_decl_line   : 36
    <24d>   DW_AT_decl_column : 20
    <24e>   DW_AT_type        : <0x1ec>
 <1><252>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <253>   DW_AT_type        : <0x246>
 <1><257>: Abbrev Number: 4 (DW_TAG_typedef)
    <258>   DW_AT_name        : (indirect string, offset: 0x7326d): uint32_t
    <25c>   DW_AT_decl_file   : 5
    <25d>   DW_AT_decl_line   : 48
    <25e>   DW_AT_decl_column : 20
    <25f>   DW_AT_type        : <0x206>
 <1><263>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <264>   DW_AT_type        : <0x257>
 <1><268>: Abbrev Number: 19 (DW_TAG_array_type)
    <269>   DW_AT_type        : <0x257>
    <26d>   DW_AT_sibling     : <0x278>
 <2><271>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <272>   DW_AT_type        : <0x22e>
    <276>   DW_AT_upper_bound : 0
 <2><277>: Abbrev Number: 0
 <1><278>: Abbrev Number: 19 (DW_TAG_array_type)
    <279>   DW_AT_type        : <0x257>
    <27d>   DW_AT_sibling     : <0x288>
 <2><281>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <282>   DW_AT_type        : <0x22e>
    <286>   DW_AT_upper_bound : 5
 <2><287>: Abbrev Number: 0
 <1><288>: Abbrev Number: 19 (DW_TAG_array_type)
    <289>   DW_AT_type        : <0x257>
    <28d>   DW_AT_sibling     : <0x298>
 <2><291>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <292>   DW_AT_type        : <0x22e>
    <296>   DW_AT_upper_bound : 1
 <2><297>: Abbrev Number: 0
 <1><298>: Abbrev Number: 10 (DW_TAG_structure_type)
    <299>   DW_AT_byte_size   : 80
    <29a>   DW_AT_decl_file   : 3
    <29b>   DW_AT_decl_line   : 152
    <29c>   DW_AT_decl_column : 9
    <29c>   DW_AT_sibling     : <0x3a3>
 <2><2a0>: Abbrev Number: 11 (DW_TAG_member)
    <2a1>   DW_AT_name        : SR
    <2a4>   DW_AT_decl_file   : 3
    <2a5>   DW_AT_decl_line   : 154
    <2a6>   DW_AT_decl_column : 17
    <2a7>   DW_AT_type        : <0x263>
    <2ab>   DW_AT_data_member_location: 0
 <2><2ac>: Abbrev Number: 11 (DW_TAG_member)
    <2ad>   DW_AT_name        : CR1
    <2b1>   DW_AT_decl_file   : 3
    <2b2>   DW_AT_decl_line   : 155
    <2b3>   DW_AT_decl_column : 17
    <2b4>   DW_AT_type        : <0x263>
    <2b8>   DW_AT_data_member_location: 4
 <2><2b9>: Abbrev Number: 11 (DW_TAG_member)
    <2ba>   DW_AT_name        : CR2
    <2be>   DW_AT_decl_file   : 3
    <2bf>   DW_AT_decl_line   : 156
    <2c0>   DW_AT_decl_column : 17
    <2c1>   DW_AT_type        : <0x263>
    <2c5>   DW_AT_data_member_location: 8
 <2><2c6>: Abbrev Number: 2 (DW_TAG_member)
    <2c7>   DW_AT_name        : (indirect string, offset: 0x8ec42): SMPR1
    <2cb>   DW_AT_decl_file   : 3
    <2cc>   DW_AT_decl_line   : 157
    <2cd>   DW_AT_decl_column : 17
    <2ce>   DW_AT_type        : <0x263>
    <2d2>   DW_AT_data_member_location: 12
 <2><2d3>: Abbrev Number: 2 (DW_TAG_member)
    <2d4>   DW_AT_name        : (indirect string, offset: 0x3803f): SMPR2
    <2d8>   DW_AT_decl_file   : 3
    <2d9>   DW_AT_decl_line   : 158
    <2da>   DW_AT_decl_column : 17
    <2db>   DW_AT_type        : <0x263>
    <2df>   DW_AT_data_member_location: 16
 <2><2e0>: Abbrev Number: 2 (DW_TAG_member)
    <2e1>   DW_AT_name        : (indirect string, offset: 0x36113): JOFR1
    <2e5>   DW_AT_decl_file   : 3
    <2e6>   DW_AT_decl_line   : 159
    <2e7>   DW_AT_decl_column : 17
    <2e8>   DW_AT_type        : <0x263>
    <2ec>   DW_AT_data_member_location: 20
 <2><2ed>: Abbrev Number: 2 (DW_TAG_member)
    <2ee>   DW_AT_name        : (indirect string, offset: 0x36119): JOFR2
    <2f2>   DW_AT_decl_file   : 3
    <2f3>   DW_AT_decl_line   : 160
    <2f4>   DW_AT_decl_column : 17
    <2f5>   DW_AT_type        : <0x263>
    <2f9>   DW_AT_data_member_location: 24
 <2><2fa>: Abbrev Number: 2 (DW_TAG_member)
    <2fb>   DW_AT_name        : (indirect string, offset: 0x3611f): JOFR3
    <2ff>   DW_AT_decl_file   : 3
    <300>   DW_AT_decl_line   : 161
    <301>   DW_AT_decl_column : 17
    <302>   DW_AT_type        : <0x263>
    <306>   DW_AT_data_member_location: 28
 <2><307>: Abbrev Number: 2 (DW_TAG_member)
    <308>   DW_AT_name        : (indirect string, offset: 0x36125): JOFR4
    <30c>   DW_AT_decl_file   : 3
    <30d>   DW_AT_decl_line   : 162
    <30e>   DW_AT_decl_column : 17
    <30f>   DW_AT_type        : <0x263>
    <313>   DW_AT_data_member_location: 32
 <2><314>: Abbrev Number: 11 (DW_TAG_member)
    <315>   DW_AT_name        : HTR
    <319>   DW_AT_decl_file   : 3
    <31a>   DW_AT_decl_line   : 163
    <31b>   DW_AT_decl_column : 17
    <31c>   DW_AT_type        : <0x263>
    <320>   DW_AT_data_member_location: 36
 <2><321>: Abbrev Number: 11 (DW_TAG_member)
    <322>   DW_AT_name        : LTR
    <326>   DW_AT_decl_file   : 3
    <327>   DW_AT_decl_line   : 164
    <328>   DW_AT_decl_column : 17
    <329>   DW_AT_type        : <0x263>
    <32d>   DW_AT_data_member_location: 40
 <2><32e>: Abbrev Number: 2 (DW_TAG_member)
    <32f>   DW_AT_name        : (indirect string, offset: 0xd2fa): SQR1
    <333>   DW_AT_decl_file   : 3
    <334>   DW_AT_decl_line   : 165
    <335>   DW_AT_decl_column : 17
    <336>   DW_AT_type        : <0x263>
    <33a>   DW_AT_data_member_location: 44
 <2><33b>: Abbrev Number: 2 (DW_TAG_member)
    <33c>   DW_AT_name        : (indirect string, offset: 0xbd4b): SQR2
    <340>   DW_AT_decl_file   : 3
    <341>   DW_AT_decl_line   : 166
    <342>   DW_AT_decl_column : 17
    <343>   DW_AT_type        : <0x263>
    <347>   DW_AT_data_member_location: 48
 <2><348>: Abbrev Number: 2 (DW_TAG_member)
    <349>   DW_AT_name        : (indirect string, offset: 0xbd50): SQR3
    <34d>   DW_AT_decl_file   : 3
    <34e>   DW_AT_decl_line   : 167
    <34f>   DW_AT_decl_column : 17
    <350>   DW_AT_type        : <0x263>
    <354>   DW_AT_data_member_location: 52
 <2><355>: Abbrev Number: 2 (DW_TAG_member)
    <356>   DW_AT_name        : (indirect string, offset: 0x79e38): JSQR
    <35a>   DW_AT_decl_file   : 3
    <35b>   DW_AT_decl_line   : 168
    <35c>   DW_AT_decl_column : 17
    <35d>   DW_AT_type        : <0x263>
    <361>   DW_AT_data_member_location: 56
 <2><362>: Abbrev Number: 2 (DW_TAG_member)
    <363>   DW_AT_name        : (indirect string, offset: 0x650bb): JDR1
    <367>   DW_AT_decl_file   : 3
    <368>   DW_AT_decl_line   : 169
    <369>   DW_AT_decl_column : 17
    <36a>   DW_AT_type        : <0x263>
    <36e>   DW_AT_data_member_location: 60
 <2><36f>: Abbrev Number: 2 (DW_TAG_member)
    <370>   DW_AT_name        : (indirect string, offset: 0x650c0): JDR2
    <374>   DW_AT_decl_file   : 3
    <375>   DW_AT_decl_line   : 170
    <376>   DW_AT_decl_column : 17
    <377>   DW_AT_type        : <0x263>
    <37b>   DW_AT_data_member_location: 64
 <2><37c>: Abbrev Number: 2 (DW_TAG_member)
    <37d>   DW_AT_name        : (indirect string, offset: 0x650c5): JDR3
    <381>   DW_AT_decl_file   : 3
    <382>   DW_AT_decl_line   : 171
    <383>   DW_AT_decl_column : 17
    <384>   DW_AT_type        : <0x263>
    <388>   DW_AT_data_member_location: 68
 <2><389>: Abbrev Number: 2 (DW_TAG_member)
    <38a>   DW_AT_name        : (indirect string, offset: 0x29954): JDR4
    <38e>   DW_AT_decl_file   : 3
    <38f>   DW_AT_decl_line   : 172
    <390>   DW_AT_decl_column : 17
    <391>   DW_AT_type        : <0x263>
    <395>   DW_AT_data_member_location: 72
 <2><396>: Abbrev Number: 11 (DW_TAG_member)
    <397>   DW_AT_name        : DR
    <39a>   DW_AT_decl_file   : 3
    <39b>   DW_AT_decl_line   : 173
    <39c>   DW_AT_decl_column : 17
    <39d>   DW_AT_type        : <0x263>
    <3a1>   DW_AT_data_member_location: 76
 <2><3a2>: Abbrev Number: 0
 <1><3a3>: Abbrev Number: 4 (DW_TAG_typedef)
    <3a4>   DW_AT_name        : (indirect string, offset: 0x79d1e): ADC_TypeDef
    <3a8>   DW_AT_decl_file   : 3
    <3a9>   DW_AT_decl_line   : 174
    <3aa>   DW_AT_decl_column : 3
    <3ab>   DW_AT_type        : <0x298>
 <1><3af>: Abbrev Number: 10 (DW_TAG_structure_type)
    <3b0>   DW_AT_byte_size   : 24
    <3b1>   DW_AT_decl_file   : 3
    <3b2>   DW_AT_decl_line   : 214
    <3b3>   DW_AT_decl_column : 9
    <3b3>   DW_AT_sibling     : <0x405>
 <2><3b7>: Abbrev Number: 11 (DW_TAG_member)
    <3b8>   DW_AT_name        : CR
    <3bb>   DW_AT_decl_file   : 3
    <3bc>   DW_AT_decl_line   : 216
    <3bd>   DW_AT_decl_column : 17
    <3be>   DW_AT_type        : <0x263>
    <3c2>   DW_AT_data_member_location: 0
 <2><3c3>: Abbrev Number: 2 (DW_TAG_member)
    <3c4>   DW_AT_name        : (indirect string, offset: 0x4d1de): NDTR
    <3c8>   DW_AT_decl_file   : 3
    <3c9>   DW_AT_decl_line   : 217
    <3ca>   DW_AT_decl_column : 17
    <3cb>   DW_AT_type        : <0x263>
    <3cf>   DW_AT_data_member_location: 4
 <2><3d0>: Abbrev Number: 11 (DW_TAG_member)
    <3d1>   DW_AT_name        : PAR
    <3d5>   DW_AT_decl_file   : 3
    <3d6>   DW_AT_decl_line   : 218
    <3d7>   DW_AT_decl_column : 17
    <3d8>   DW_AT_type        : <0x263>
    <3dc>   DW_AT_data_member_location: 8
 <2><3dd>: Abbrev Number: 2 (DW_TAG_member)
    <3de>   DW_AT_name        : (indirect string, offset: 0x410c5): M0AR
    <3e2>   DW_AT_decl_file   : 3
    <3e3>   DW_AT_decl_line   : 219
    <3e4>   DW_AT_decl_column : 17
    <3e5>   DW_AT_type        : <0x263>
    <3e9>   DW_AT_data_member_location: 12
 <2><3ea>: Abbrev Number: 2 (DW_TAG_member)
    <3eb>   DW_AT_name        : (indirect string, offset: 0xe803): M1AR
    <3ef>   DW_AT_decl_file   : 3
    <3f0>   DW_AT_decl_line   : 220
    <3f1>   DW_AT_decl_column : 17
    <3f2>   DW_AT_type        : <0x263>
    <3f6>   DW_AT_data_member_location: 16
 <2><3f7>: Abbrev Number: 11 (DW_TAG_member)
    <3f8>   DW_AT_name        : FCR
    <3fc>   DW_AT_decl_file   : 3
    <3fd>   DW_AT_decl_line   : 221
    <3fe>   DW_AT_decl_column : 17
    <3ff>   DW_AT_type        : <0x263>
    <403>   DW_AT_data_member_location: 20
 <2><404>: Abbrev Number: 0
 <1><405>: Abbrev Number: 4 (DW_TAG_typedef)
    <406>   DW_AT_name        : (indirect string, offset: 0x90550): DMA_Stream_TypeDef
    <40a>   DW_AT_decl_file   : 3
    <40b>   DW_AT_decl_line   : 222
    <40c>   DW_AT_decl_column : 3
    <40d>   DW_AT_type        : <0x3af>
 <1><411>: Abbrev Number: 17 (DW_TAG_structure_type)
    <412>   DW_AT_byte_size   : 40
    <413>   DW_AT_decl_file   : 3
    <414>   DW_AT_decl_line   : 265
    <416>   DW_AT_decl_column : 9
    <416>   DW_AT_sibling     : <0x493>
 <2><41a>: Abbrev Number: 3 (DW_TAG_member)
    <41b>   DW_AT_name        : (indirect string, offset: 0x155f): MODER
    <41f>   DW_AT_decl_file   : 3
    <420>   DW_AT_decl_line   : 267
    <422>   DW_AT_decl_column : 17
    <423>   DW_AT_type        : <0x263>
    <427>   DW_AT_data_member_location: 0
 <2><428>: Abbrev Number: 3 (DW_TAG_member)
    <429>   DW_AT_name        : (indirect string, offset: 0x7b082): OTYPER
    <42d>   DW_AT_decl_file   : 3
    <42e>   DW_AT_decl_line   : 268
    <430>   DW_AT_decl_column : 17
    <431>   DW_AT_type        : <0x263>
    <435>   DW_AT_data_member_location: 4
 <2><436>: Abbrev Number: 3 (DW_TAG_member)
    <437>   DW_AT_name        : (indirect string, offset: 0x8a4ba): OSPEEDR
    <43b>   DW_AT_decl_file   : 3
    <43c>   DW_AT_decl_line   : 269
    <43e>   DW_AT_decl_column : 17
    <43f>   DW_AT_type        : <0x263>
    <443>   DW_AT_data_member_location: 8
 <2><444>: Abbrev Number: 3 (DW_TAG_member)
    <445>   DW_AT_name        : (indirect string, offset: 0x1c31e): PUPDR
    <449>   DW_AT_decl_file   : 3
    <44a>   DW_AT_decl_line   : 270
    <44c>   DW_AT_decl_column : 17
    <44d>   DW_AT_type        : <0x263>
    <451>   DW_AT_data_member_location: 12
 <2><452>: Abbrev Number: 5 (DW_TAG_member)
    <453>   DW_AT_name        : IDR
    <457>   DW_AT_decl_file   : 3
    <457>   DW_AT_decl_line   : 271
    <459>   DW_AT_decl_column : 17
    <459>   DW_AT_type        : <0x263>
    <45d>   DW_AT_data_member_location: 16
 <2><45e>: Abbrev Number: 5 (DW_TAG_member)
    <45f>   DW_AT_name        : ODR
    <463>   DW_AT_decl_file   : 3
    <463>   DW_AT_decl_line   : 272
    <465>   DW_AT_decl_column : 17
    <465>   DW_AT_type        : <0x263>
    <469>   DW_AT_data_member_location: 20
 <2><46a>: Abbrev Number: 3 (DW_TAG_member)
    <46b>   DW_AT_name        : (indirect string, offset: 0x23452): BSRR
    <46f>   DW_AT_decl_file   : 3
    <470>   DW_AT_decl_line   : 273
    <472>   DW_AT_decl_column : 17
    <473>   DW_AT_type        : <0x263>
    <477>   DW_AT_data_member_location: 24
 <2><478>: Abbrev Number: 3 (DW_TAG_member)
    <479>   DW_AT_name        : (indirect string, offset: 0x88441): LCKR
    <47d>   DW_AT_decl_file   : 3
    <47e>   DW_AT_decl_line   : 274
    <480>   DW_AT_decl_column : 17
    <481>   DW_AT_type        : <0x263>
    <485>   DW_AT_data_member_location: 28
 <2><486>: Abbrev Number: 5 (DW_TAG_member)
    <487>   DW_AT_name        : AFR
    <48b>   DW_AT_decl_file   : 3
    <48b>   DW_AT_decl_line   : 275
    <48d>   DW_AT_decl_column : 17
    <48d>   DW_AT_type        : <0x4a3>
    <491>   DW_AT_data_member_location: 32
 <2><492>: Abbrev Number: 0
 <1><493>: Abbrev Number: 19 (DW_TAG_array_type)
    <494>   DW_AT_type        : <0x263>
    <498>   DW_AT_sibling     : <0x4a3>
 <2><49c>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <49d>   DW_AT_type        : <0x22e>
    <4a1>   DW_AT_upper_bound : 1
 <2><4a2>: Abbrev Number: 0
 <1><4a3>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <4a4>   DW_AT_type        : <0x493>
 <1><4a8>: Abbrev Number: 15 (DW_TAG_typedef)
    <4a9>   DW_AT_name        : (indirect string, offset: 0x9a1f2): GPIO_TypeDef
    <4ad>   DW_AT_decl_file   : 3
    <4ae>   DW_AT_decl_line   : 276
    <4b0>   DW_AT_decl_column : 3
    <4b0>   DW_AT_type        : <0x411>
 <1><4b4>: Abbrev Number: 17 (DW_TAG_structure_type)
    <4b5>   DW_AT_byte_size   : 40
    <4b6>   DW_AT_decl_file   : 3
    <4b7>   DW_AT_decl_line   : 295
    <4b9>   DW_AT_decl_column : 9
    <4b9>   DW_AT_sibling     : <0x53d>
 <2><4bd>: Abbrev Number: 5 (DW_TAG_member)
    <4be>   DW_AT_name        : CR1
    <4c2>   DW_AT_decl_file   : 3
    <4c2>   DW_AT_decl_line   : 297
    <4c4>   DW_AT_decl_column : 17
    <4c4>   DW_AT_type        : <0x263>
    <4c8>   DW_AT_data_member_location: 0
 <2><4c9>: Abbrev Number: 5 (DW_TAG_member)
    <4ca>   DW_AT_name        : CR2
    <4ce>   DW_AT_decl_file   : 3
    <4ce>   DW_AT_decl_line   : 298
    <4d0>   DW_AT_decl_column : 17
    <4d0>   DW_AT_type        : <0x263>
    <4d4>   DW_AT_data_member_location: 4
 <2><4d5>: Abbrev Number: 3 (DW_TAG_member)
    <4d6>   DW_AT_name        : (indirect string, offset: 0x17408): OAR1
    <4da>   DW_AT_decl_file   : 3
    <4db>   DW_AT_decl_line   : 299
    <4dd>   DW_AT_decl_column : 17
    <4de>   DW_AT_type        : <0x263>
    <4e2>   DW_AT_data_member_location: 8
 <2><4e3>: Abbrev Number: 3 (DW_TAG_member)
    <4e4>   DW_AT_name        : (indirect string, offset: 0x1740d): OAR2
    <4e8>   DW_AT_decl_file   : 3
    <4e9>   DW_AT_decl_line   : 300
    <4eb>   DW_AT_decl_column : 17
    <4ec>   DW_AT_type        : <0x263>
    <4f0>   DW_AT_data_member_location: 12
 <2><4f1>: Abbrev Number: 5 (DW_TAG_member)
    <4f2>   DW_AT_name        : DR
    <4f5>   DW_AT_decl_file   : 3
    <4f5>   DW_AT_decl_line   : 301
    <4f7>   DW_AT_decl_column : 17
    <4f7>   DW_AT_type        : <0x263>
    <4fb>   DW_AT_data_member_location: 16
 <2><4fc>: Abbrev Number: 5 (DW_TAG_member)
    <4fd>   DW_AT_name        : SR1
    <501>   DW_AT_decl_file   : 3
    <501>   DW_AT_decl_line   : 302
    <503>   DW_AT_decl_column : 17
    <503>   DW_AT_type        : <0x263>
    <507>   DW_AT_data_member_location: 20
 <2><508>: Abbrev Number: 5 (DW_TAG_member)
    <509>   DW_AT_name        : SR2
    <50d>   DW_AT_decl_file   : 3
    <50d>   DW_AT_decl_line   : 303
    <50f>   DW_AT_decl_column : 17
    <50f>   DW_AT_type        : <0x263>
    <513>   DW_AT_data_member_location: 24
 <2><514>: Abbrev Number: 5 (DW_TAG_member)
    <515>   DW_AT_name        : CCR
    <519>   DW_AT_decl_file   : 3
    <519>   DW_AT_decl_line   : 304
    <51b>   DW_AT_decl_column : 17
    <51b>   DW_AT_type        : <0x263>
    <51f>   DW_AT_data_member_location: 28
 <2><520>: Abbrev Number: 3 (DW_TAG_member)
    <521>   DW_AT_name        : (indirect string, offset: 0x50ff8): TRISE
    <525>   DW_AT_decl_file   : 3
    <526>   DW_AT_decl_line   : 305
    <528>   DW_AT_decl_column : 17
    <529>   DW_AT_type        : <0x263>
    <52d>   DW_AT_data_member_location: 32
 <2><52e>: Abbrev Number: 3 (DW_TAG_member)
    <52f>   DW_AT_name        : (indirect string, offset: 0x148c): FLTR
    <533>   DW_AT_decl_file   : 3
    <534>   DW_AT_decl_line   : 306
    <536>   DW_AT_decl_column : 17
    <537>   DW_AT_type        : <0x263>
    <53b>   DW_AT_data_member_location: 36
 <2><53c>: Abbrev Number: 0
 <1><53d>: Abbrev Number: 15 (DW_TAG_typedef)
    <53e>   DW_AT_name        : (indirect string, offset: 0x7d62e): I2C_TypeDef
    <542>   DW_AT_decl_file   : 3
    <543>   DW_AT_decl_line   : 307
    <545>   DW_AT_decl_column : 3
    <545>   DW_AT_type        : <0x4b4>
 <1><549>: Abbrev Number: 17 (DW_TAG_structure_type)
    <54a>   DW_AT_byte_size   : 8
    <54b>   DW_AT_decl_file   : 3
    <54c>   DW_AT_decl_line   : 326
    <54e>   DW_AT_decl_column : 9
    <54e>   DW_AT_sibling     : <0x56a>
 <2><552>: Abbrev Number: 5 (DW_TAG_member)
    <553>   DW_AT_name        : CR
    <556>   DW_AT_decl_file   : 3
    <556>   DW_AT_decl_line   : 328
    <558>   DW_AT_decl_column : 17
    <558>   DW_AT_type        : <0x263>
    <55c>   DW_AT_data_member_location: 0
 <2><55d>: Abbrev Number: 5 (DW_TAG_member)
    <55e>   DW_AT_name        : CSR
    <562>   DW_AT_decl_file   : 3
    <562>   DW_AT_decl_line   : 329
    <564>   DW_AT_decl_column : 17
    <564>   DW_AT_type        : <0x263>
    <568>   DW_AT_data_member_location: 4
 <2><569>: Abbrev Number: 0
 <1><56a>: Abbrev Number: 15 (DW_TAG_typedef)
    <56b>   DW_AT_name        : (indirect string, offset: 0x728e4): PWR_TypeDef
    <56f>   DW_AT_decl_file   : 3
    <570>   DW_AT_decl_line   : 330
    <572>   DW_AT_decl_column : 3
    <572>   DW_AT_type        : <0x549>
 <1><576>: Abbrev Number: 17 (DW_TAG_structure_type)
    <577>   DW_AT_byte_size   : 144
    <578>   DW_AT_decl_file   : 3
    <579>   DW_AT_decl_line   : 336
    <57b>   DW_AT_decl_column : 9
    <57b>   DW_AT_sibling     : <0x739>
 <2><57f>: Abbrev Number: 5 (DW_TAG_member)
    <580>   DW_AT_name        : CR
    <583>   DW_AT_decl_file   : 3
    <583>   DW_AT_decl_line   : 338
    <585>   DW_AT_decl_column : 17
    <585>   DW_AT_type        : <0x263>
    <589>   DW_AT_data_member_location: 0
 <2><58a>: Abbrev Number: 3 (DW_TAG_member)
    <58b>   DW_AT_name        : (indirect string, offset: 0x6e960): PLLCFGR
    <58f>   DW_AT_decl_file   : 3
    <590>   DW_AT_decl_line   : 339
    <592>   DW_AT_decl_column : 17
    <593>   DW_AT_type        : <0x263>
    <597>   DW_AT_data_member_location: 4
 <2><598>: Abbrev Number: 3 (DW_TAG_member)
    <599>   DW_AT_name        : (indirect string, offset: 0x443d6): CFGR
    <59d>   DW_AT_decl_file   : 3
    <59e>   DW_AT_decl_line   : 340
    <5a0>   DW_AT_decl_column : 17
    <5a1>   DW_AT_type        : <0x263>
    <5a5>   DW_AT_data_member_location: 8
 <2><5a6>: Abbrev Number: 5 (DW_TAG_member)
    <5a7>   DW_AT_name        : CIR
    <5ab>   DW_AT_decl_file   : 3
    <5ab>   DW_AT_decl_line   : 341
    <5ad>   DW_AT_decl_column : 17
    <5ad>   DW_AT_type        : <0x263>
    <5b1>   DW_AT_data_member_location: 12
 <2><5b2>: Abbrev Number: 3 (DW_TAG_member)
    <5b3>   DW_AT_name        : (indirect string, offset: 0x7ed09): AHB1RSTR
    <5b7>   DW_AT_decl_file   : 3
    <5b8>   DW_AT_decl_line   : 342
    <5ba>   DW_AT_decl_column : 17
    <5bb>   DW_AT_type        : <0x263>
    <5bf>   DW_AT_data_member_location: 16
 <2><5c0>: Abbrev Number: 3 (DW_TAG_member)
    <5c1>   DW_AT_name        : (indirect string, offset: 0x11bf7): AHB2RSTR
    <5c5>   DW_AT_decl_file   : 3
    <5c6>   DW_AT_decl_line   : 343
    <5c8>   DW_AT_decl_column : 17
    <5c9>   DW_AT_type        : <0x263>
    <5cd>   DW_AT_data_member_location: 20
 <2><5ce>: Abbrev Number: 3 (DW_TAG_member)
    <5cf>   DW_AT_name        : (indirect string, offset: 0x44279): AHB3RSTR
    <5d3>   DW_AT_decl_file   : 3
    <5d4>   DW_AT_decl_line   : 344
    <5d6>   DW_AT_decl_column : 17
    <5d7>   DW_AT_type        : <0x263>
    <5db>   DW_AT_data_member_location: 24
 <2><5dc>: Abbrev Number: 3 (DW_TAG_member)
    <5dd>   DW_AT_name        : (indirect string, offset: 0x95b50): RESERVED0
    <5e1>   DW_AT_decl_file   : 3
    <5e2>   DW_AT_decl_line   : 345
    <5e4>   DW_AT_decl_column : 17
    <5e5>   DW_AT_type        : <0x257>
    <5e9>   DW_AT_data_member_location: 28
 <2><5ea>: Abbrev Number: 3 (DW_TAG_member)
    <5eb>   DW_AT_name        : (indirect string, offset: 0x117b4): APB1RSTR
    <5ef>   DW_AT_decl_file   : 3
    <5f0>   DW_AT_decl_line   : 346
    <5f2>   DW_AT_decl_column : 17
    <5f3>   DW_AT_type        : <0x263>
    <5f7>   DW_AT_data_member_location: 32
 <2><5f8>: Abbrev Number: 3 (DW_TAG_member)
    <5f9>   DW_AT_name        : (indirect string, offset: 0x43dae): APB2RSTR
    <5fd>   DW_AT_decl_file   : 3
    <5fe>   DW_AT_decl_line   : 347
    <600>   DW_AT_decl_column : 17
    <601>   DW_AT_type        : <0x263>
    <605>   DW_AT_data_member_location: 36
 <2><606>: Abbrev Number: 3 (DW_TAG_member)
    <607>   DW_AT_name        : (indirect string, offset: 0x95b5a): RESERVED1
    <60b>   DW_AT_decl_file   : 3
    <60c>   DW_AT_decl_line   : 348
    <60e>   DW_AT_decl_column : 17
    <60f>   DW_AT_type        : <0x288>
    <613>   DW_AT_data_member_location: 40
 <2><614>: Abbrev Number: 3 (DW_TAG_member)
    <615>   DW_AT_name        : (indirect string, offset: 0xcb81): AHB1ENR
    <619>   DW_AT_decl_file   : 3
    <61a>   DW_AT_decl_line   : 349
    <61c>   DW_AT_decl_column : 17
    <61d>   DW_AT_type        : <0x263>
    <621>   DW_AT_data_member_location: 48
 <2><622>: Abbrev Number: 3 (DW_TAG_member)
    <623>   DW_AT_name        : (indirect string, offset: 0x2986c): AHB2ENR
    <627>   DW_AT_decl_file   : 3
    <628>   DW_AT_decl_line   : 350
    <62a>   DW_AT_decl_column : 17
    <62b>   DW_AT_type        : <0x263>
    <62f>   DW_AT_data_member_location: 52
 <2><630>: Abbrev Number: 3 (DW_TAG_member)
    <631>   DW_AT_name        : (indirect string, offset: 0x46473): AHB3ENR
    <635>   DW_AT_decl_file   : 3
    <636>   DW_AT_decl_line   : 351
    <638>   DW_AT_decl_column : 17
    <639>   DW_AT_type        : <0x263>
    <63d>   DW_AT_data_member_location: 56
 <2><63e>: Abbrev Number: 3 (DW_TAG_member)
    <63f>   DW_AT_name        : (indirect string, offset: 0x95b64): RESERVED2
    <643>   DW_AT_decl_file   : 3
    <644>   DW_AT_decl_line   : 352
    <646>   DW_AT_decl_column : 17
    <647>   DW_AT_type        : <0x257>
    <64b>   DW_AT_data_member_location: 60
 <2><64c>: Abbrev Number: 3 (DW_TAG_member)
    <64d>   DW_AT_name        : (indirect string, offset: 0x77882): APB1ENR
    <651>   DW_AT_decl_file   : 3
    <652>   DW_AT_decl_line   : 353
    <654>   DW_AT_decl_column : 17
    <655>   DW_AT_type        : <0x263>
    <659>   DW_AT_data_member_location: 64
 <2><65a>: Abbrev Number: 3 (DW_TAG_member)
    <65b>   DW_AT_name        : (indirect string, offset: 0x1246b): APB2ENR
    <65f>   DW_AT_decl_file   : 3
    <660>   DW_AT_decl_line   : 354
    <662>   DW_AT_decl_column : 17
    <663>   DW_AT_type        : <0x263>
    <667>   DW_AT_data_member_location: 68
 <2><668>: Abbrev Number: 3 (DW_TAG_member)
    <669>   DW_AT_name        : (indirect string, offset: 0x95b6e): RESERVED3
    <66d>   DW_AT_decl_file   : 3
    <66e>   DW_AT_decl_line   : 355
    <670>   DW_AT_decl_column : 17
    <671>   DW_AT_type        : <0x288>
    <675>   DW_AT_data_member_location: 72
 <2><676>: Abbrev Number: 3 (DW_TAG_member)
    <677>   DW_AT_name        : (indirect string, offset: 0x4e395): AHB1LPENR
    <67b>   DW_AT_decl_file   : 3
    <67c>   DW_AT_decl_line   : 356
    <67e>   DW_AT_decl_column : 17
    <67f>   DW_AT_type        : <0x263>
    <683>   DW_AT_data_member_location: 80
 <2><684>: Abbrev Number: 3 (DW_TAG_member)
    <685>   DW_AT_name        : (indirect string, offset: 0x2304e): AHB2LPENR
    <689>   DW_AT_decl_file   : 3
    <68a>   DW_AT_decl_line   : 357
    <68c>   DW_AT_decl_column : 17
    <68d>   DW_AT_type        : <0x263>
    <691>   DW_AT_data_member_location: 84
 <2><692>: Abbrev Number: 3 (DW_TAG_member)
    <693>   DW_AT_name        : (indirect string, offset: 0x6a5f4): AHB3LPENR
    <697>   DW_AT_decl_file   : 3
    <698>   DW_AT_decl_line   : 358
    <69a>   DW_AT_decl_column : 17
    <69b>   DW_AT_type        : <0x263>
    <69f>   DW_AT_data_member_location: 88
 <2><6a0>: Abbrev Number: 3 (DW_TAG_member)
    <6a1>   DW_AT_name        : (indirect string, offset: 0x95b78): RESERVED4
    <6a5>   DW_AT_decl_file   : 3
    <6a6>   DW_AT_decl_line   : 359
    <6a8>   DW_AT_decl_column : 17
    <6a9>   DW_AT_type        : <0x257>
    <6ad>   DW_AT_data_member_location: 92
 <2><6ae>: Abbrev Number: 3 (DW_TAG_member)
    <6af>   DW_AT_name        : (indirect string, offset: 0x68caa): APB1LPENR
    <6b3>   DW_AT_decl_file   : 3
    <6b4>   DW_AT_decl_line   : 360
    <6b6>   DW_AT_decl_column : 17
    <6b7>   DW_AT_type        : <0x263>
    <6bb>   DW_AT_data_member_location: 96
 <2><6bc>: Abbrev Number: 3 (DW_TAG_member)
    <6bd>   DW_AT_name        : (indirect string, offset: 0xbc45): APB2LPENR
    <6c1>   DW_AT_decl_file   : 3
    <6c2>   DW_AT_decl_line   : 361
    <6c4>   DW_AT_decl_column : 17
    <6c5>   DW_AT_type        : <0x263>
    <6c9>   DW_AT_data_member_location: 100
 <2><6ca>: Abbrev Number: 3 (DW_TAG_member)
    <6cb>   DW_AT_name        : (indirect string, offset: 0x95b82): RESERVED5
    <6cf>   DW_AT_decl_file   : 3
    <6d0>   DW_AT_decl_line   : 362
    <6d2>   DW_AT_decl_column : 17
    <6d3>   DW_AT_type        : <0x288>
    <6d7>   DW_AT_data_member_location: 104
 <2><6d8>: Abbrev Number: 3 (DW_TAG_member)
    <6d9>   DW_AT_name        : (indirect string, offset: 0x15cab): BDCR
    <6dd>   DW_AT_decl_file   : 3
    <6de>   DW_AT_decl_line   : 363
    <6e0>   DW_AT_decl_column : 17
    <6e1>   DW_AT_type        : <0x263>
    <6e5>   DW_AT_data_member_location: 112
 <2><6e6>: Abbrev Number: 5 (DW_TAG_member)
    <6e7>   DW_AT_name        : CSR
    <6eb>   DW_AT_decl_file   : 3
    <6eb>   DW_AT_decl_line   : 364
    <6ed>   DW_AT_decl_column : 17
    <6ed>   DW_AT_type        : <0x263>
    <6f1>   DW_AT_data_member_location: 116
 <2><6f2>: Abbrev Number: 3 (DW_TAG_member)
    <6f3>   DW_AT_name        : (indirect string, offset: 0x95b8c): RESERVED6
    <6f7>   DW_AT_decl_file   : 3
    <6f8>   DW_AT_decl_line   : 365
    <6fa>   DW_AT_decl_column : 17
    <6fb>   DW_AT_type        : <0x288>
    <6ff>   DW_AT_data_member_location: 120
 <2><700>: Abbrev Number: 3 (DW_TAG_member)
    <701>   DW_AT_name        : (indirect string, offset: 0x538d7): SSCGR
    <705>   DW_AT_decl_file   : 3
    <706>   DW_AT_decl_line   : 366
    <708>   DW_AT_decl_column : 17
    <709>   DW_AT_type        : <0x263>
    <70d>   DW_AT_data_member_location: 128
 <2><70e>: Abbrev Number: 3 (DW_TAG_member)
    <70f>   DW_AT_name        : (indirect string, offset: 0x33bf6): PLLI2SCFGR
    <713>   DW_AT_decl_file   : 3
    <714>   DW_AT_decl_line   : 367
    <716>   DW_AT_decl_column : 17
    <717>   DW_AT_type        : <0x263>
    <71b>   DW_AT_data_member_location: 132
 <2><71c>: Abbrev Number: 3 (DW_TAG_member)
    <71d>   DW_AT_name        : (indirect string, offset: 0x95b96): RESERVED7
    <721>   DW_AT_decl_file   : 3
    <722>   DW_AT_decl_line   : 368
    <724>   DW_AT_decl_column : 17
    <725>   DW_AT_type        : <0x268>
    <729>   DW_AT_data_member_location: 136
 <2><72a>: Abbrev Number: 3 (DW_TAG_member)
    <72b>   DW_AT_name        : (indirect string, offset: 0x443d3): DCKCFGR
    <72f>   DW_AT_decl_file   : 3
    <730>   DW_AT_decl_line   : 369
    <732>   DW_AT_decl_column : 17
    <733>   DW_AT_type        : <0x263>
    <737>   DW_AT_data_member_location: 140
 <2><738>: Abbrev Number: 0
 <1><739>: Abbrev Number: 15 (DW_TAG_typedef)
    <73a>   DW_AT_name        : (indirect string, offset: 0x48b62): RCC_TypeDef
    <73e>   DW_AT_decl_file   : 3
    <73f>   DW_AT_decl_line   : 370
    <741>   DW_AT_decl_column : 3
    <741>   DW_AT_type        : <0x576>
 <1><745>: Abbrev Number: 17 (DW_TAG_structure_type)
    <746>   DW_AT_byte_size   : 36
    <747>   DW_AT_decl_file   : 3
    <748>   DW_AT_decl_line   : 452
    <74a>   DW_AT_decl_column : 9
    <74a>   DW_AT_sibling     : <0x7c3>
 <2><74e>: Abbrev Number: 5 (DW_TAG_member)
    <74f>   DW_AT_name        : CR1
    <753>   DW_AT_decl_file   : 3
    <753>   DW_AT_decl_line   : 454
    <755>   DW_AT_decl_column : 17
    <755>   DW_AT_type        : <0x263>
    <759>   DW_AT_data_member_location: 0
 <2><75a>: Abbrev Number: 5 (DW_TAG_member)
    <75b>   DW_AT_name        : CR2
    <75f>   DW_AT_decl_file   : 3
    <75f>   DW_AT_decl_line   : 455
    <761>   DW_AT_decl_column : 17
    <761>   DW_AT_type        : <0x263>
    <765>   DW_AT_data_member_location: 4
 <2><766>: Abbrev Number: 5 (DW_TAG_member)
    <767>   DW_AT_name        : SR
    <76a>   DW_AT_decl_file   : 3
    <76a>   DW_AT_decl_line   : 456
    <76c>   DW_AT_decl_column : 17
    <76c>   DW_AT_type        : <0x263>
    <770>   DW_AT_data_member_location: 8
 <2><771>: Abbrev Number: 5 (DW_TAG_member)
    <772>   DW_AT_name        : DR
    <775>   DW_AT_decl_file   : 3
    <775>   DW_AT_decl_line   : 457
    <777>   DW_AT_decl_column : 17
    <777>   DW_AT_type        : <0x263>
    <77b>   DW_AT_data_member_location: 12
 <2><77c>: Abbrev Number: 3 (DW_TAG_member)
    <77d>   DW_AT_name        : (indirect string, offset: 0x25a6d): CRCPR
    <781>   DW_AT_decl_file   : 3
    <782>   DW_AT_decl_line   : 458
    <784>   DW_AT_decl_column : 17
    <785>   DW_AT_type        : <0x263>
    <789>   DW_AT_data_member_location: 16
 <2><78a>: Abbrev Number: 3 (DW_TAG_member)
    <78b>   DW_AT_name        : (indirect string, offset: 0x5d949): RXCRCR
    <78f>   DW_AT_decl_file   : 3
    <790>   DW_AT_decl_line   : 459
    <792>   DW_AT_decl_column : 17
    <793>   DW_AT_type        : <0x263>
    <797>   DW_AT_data_member_location: 20
 <2><798>: Abbrev Number: 3 (DW_TAG_member)
    <799>   DW_AT_name        : (indirect string, offset: 0x4ed8e): TXCRCR
    <79d>   DW_AT_decl_file   : 3
    <79e>   DW_AT_decl_line   : 460
    <7a0>   DW_AT_decl_column : 17
    <7a1>   DW_AT_type        : <0x263>
    <7a5>   DW_AT_data_member_location: 24
 <2><7a6>: Abbrev Number: 3 (DW_TAG_member)
    <7a7>   DW_AT_name        : (indirect string, offset: 0x33bf9): I2SCFGR
    <7ab>   DW_AT_decl_file   : 3
    <7ac>   DW_AT_decl_line   : 461
    <7ae>   DW_AT_decl_column : 17
    <7af>   DW_AT_type        : <0x263>
    <7b3>   DW_AT_data_member_location: 28
 <2><7b4>: Abbrev Number: 3 (DW_TAG_member)
    <7b5>   DW_AT_name        : (indirect string, offset: 0x37806): I2SPR
    <7b9>   DW_AT_decl_file   : 3
    <7ba>   DW_AT_decl_line   : 462
    <7bc>   DW_AT_decl_column : 17
    <7bd>   DW_AT_type        : <0x263>
    <7c1>   DW_AT_data_member_location: 32
 <2><7c2>: Abbrev Number: 0
 <1><7c3>: Abbrev Number: 15 (DW_TAG_typedef)
    <7c4>   DW_AT_name        : (indirect string, offset: 0x245f6): SPI_TypeDef
    <7c8>   DW_AT_decl_file   : 3
    <7c9>   DW_AT_decl_line   : 463
    <7cb>   DW_AT_decl_column : 3
    <7cb>   DW_AT_type        : <0x745>
 <1><7cf>: Abbrev Number: 17 (DW_TAG_structure_type)
    <7d0>   DW_AT_byte_size   : 84
    <7d1>   DW_AT_decl_file   : 3
    <7d2>   DW_AT_decl_line   : 470
    <7d4>   DW_AT_decl_column : 9
    <7d4>   DW_AT_sibling     : <0x8e9>
 <2><7d8>: Abbrev Number: 5 (DW_TAG_member)
    <7d9>   DW_AT_name        : CR1
    <7dd>   DW_AT_decl_file   : 3
    <7dd>   DW_AT_decl_line   : 472
    <7df>   DW_AT_decl_column : 17
    <7df>   DW_AT_type        : <0x263>
    <7e3>   DW_AT_data_member_location: 0
 <2><7e4>: Abbrev Number: 5 (DW_TAG_member)
    <7e5>   DW_AT_name        : CR2
    <7e9>   DW_AT_decl_file   : 3
    <7e9>   DW_AT_decl_line   : 473
    <7eb>   DW_AT_decl_column : 17
    <7eb>   DW_AT_type        : <0x263>
    <7ef>   DW_AT_data_member_location: 4
 <2><7f0>: Abbrev Number: 3 (DW_TAG_member)
    <7f1>   DW_AT_name        : (indirect string, offset: 0x2dc8b): SMCR
    <7f5>   DW_AT_decl_file   : 3
    <7f6>   DW_AT_decl_line   : 474
    <7f8>   DW_AT_decl_column : 17
    <7f9>   DW_AT_type        : <0x263>
    <7fd>   DW_AT_data_member_location: 8
 <2><7fe>: Abbrev Number: 3 (DW_TAG_member)
    <7ff>   DW_AT_name        : (indirect string, offset: 0x32820): DIER
    <803>   DW_AT_decl_file   : 3
    <804>   DW_AT_decl_line   : 475
    <806>   DW_AT_decl_column : 17
    <807>   DW_AT_type        : <0x263>
    <80b>   DW_AT_data_member_location: 12
 <2><80c>: Abbrev Number: 5 (DW_TAG_member)
    <80d>   DW_AT_name        : SR
    <810>   DW_AT_decl_file   : 3
    <810>   DW_AT_decl_line   : 476
    <812>   DW_AT_decl_column : 17
    <812>   DW_AT_type        : <0x263>
    <816>   DW_AT_data_member_location: 16
 <2><817>: Abbrev Number: 5 (DW_TAG_member)
    <818>   DW_AT_name        : EGR
    <81c>   DW_AT_decl_file   : 3
    <81c>   DW_AT_decl_line   : 477
    <81e>   DW_AT_decl_column : 17
    <81e>   DW_AT_type        : <0x263>
    <822>   DW_AT_data_member_location: 20
 <2><823>: Abbrev Number: 3 (DW_TAG_member)
    <824>   DW_AT_name        : (indirect string, offset: 0x9100c): CCMR1
    <828>   DW_AT_decl_file   : 3
    <829>   DW_AT_decl_line   : 478
    <82b>   DW_AT_decl_column : 17
    <82c>   DW_AT_type        : <0x263>
    <830>   DW_AT_data_member_location: 24
 <2><831>: Abbrev Number: 3 (DW_TAG_member)
    <832>   DW_AT_name        : (indirect string, offset: 0x3e7dc): CCMR2
    <836>   DW_AT_decl_file   : 3
    <837>   DW_AT_decl_line   : 479
    <839>   DW_AT_decl_column : 17
    <83a>   DW_AT_type        : <0x263>
    <83e>   DW_AT_data_member_location: 28
 <2><83f>: Abbrev Number: 3 (DW_TAG_member)
    <840>   DW_AT_name        : (indirect string, offset: 0x20cf5): CCER
    <844>   DW_AT_decl_file   : 3
    <845>   DW_AT_decl_line   : 480
    <847>   DW_AT_decl_column : 17
    <848>   DW_AT_type        : <0x263>
    <84c>   DW_AT_data_member_location: 32
 <2><84d>: Abbrev Number: 5 (DW_TAG_member)
    <84e>   DW_AT_name        : CNT
    <852>   DW_AT_decl_file   : 3
    <852>   DW_AT_decl_line   : 481
    <854>   DW_AT_decl_column : 17
    <854>   DW_AT_type        : <0x263>
    <858>   DW_AT_data_member_location: 36
 <2><859>: Abbrev Number: 5 (DW_TAG_member)
    <85a>   DW_AT_name        : PSC
    <85e>   DW_AT_decl_file   : 3
    <85e>   DW_AT_decl_line   : 482
    <860>   DW_AT_decl_column : 17
    <860>   DW_AT_type        : <0x263>
    <864>   DW_AT_data_member_location: 40
 <2><865>: Abbrev Number: 5 (DW_TAG_member)
    <866>   DW_AT_name        : ARR
    <86a>   DW_AT_decl_file   : 3
    <86a>   DW_AT_decl_line   : 483
    <86c>   DW_AT_decl_column : 17
    <86c>   DW_AT_type        : <0x263>
    <870>   DW_AT_data_member_location: 44
 <2><871>: Abbrev Number: 5 (DW_TAG_member)
    <872>   DW_AT_name        : RCR
    <876>   DW_AT_decl_file   : 3
    <876>   DW_AT_decl_line   : 484
    <878>   DW_AT_decl_column : 17
    <878>   DW_AT_type        : <0x263>
    <87c>   DW_AT_data_member_location: 48
 <2><87d>: Abbrev Number: 3 (DW_TAG_member)
    <87e>   DW_AT_name        : (indirect string, offset: 0x12466): CCR1
    <882>   DW_AT_decl_file   : 3
    <883>   DW_AT_decl_line   : 485
    <885>   DW_AT_decl_column : 17
    <886>   DW_AT_type        : <0x263>
    <88a>   DW_AT_data_member_location: 52
 <2><88b>: Abbrev Number: 3 (DW_TAG_member)
    <88c>   DW_AT_name        : (indirect string, offset: 0x4192c): CCR2
    <890>   DW_AT_decl_file   : 3
    <891>   DW_AT_decl_line   : 486
    <893>   DW_AT_decl_column : 17
    <894>   DW_AT_type        : <0x263>
    <898>   DW_AT_data_member_location: 56
 <2><899>: Abbrev Number: 3 (DW_TAG_member)
    <89a>   DW_AT_name        : (indirect string, offset: 0x2ca5e): CCR3
    <89e>   DW_AT_decl_file   : 3
    <89f>   DW_AT_decl_line   : 487
    <8a1>   DW_AT_decl_column : 17
    <8a2>   DW_AT_type        : <0x263>
    <8a6>   DW_AT_data_member_location: 60
 <2><8a7>: Abbrev Number: 3 (DW_TAG_member)
    <8a8>   DW_AT_name        : (indirect string, offset: 0x9de1): CCR4
    <8ac>   DW_AT_decl_file   : 3
    <8ad>   DW_AT_decl_line   : 488
    <8af>   DW_AT_decl_column : 17
    <8b0>   DW_AT_type        : <0x263>
    <8b4>   DW_AT_data_member_location: 64
 <2><8b5>: Abbrev Number: 3 (DW_TAG_member)
    <8b6>   DW_AT_name        : (indirect string, offset: 0x483db): BDTR
    <8ba>   DW_AT_decl_file   : 3
    <8bb>   DW_AT_decl_line   : 489
    <8bd>   DW_AT_decl_column : 17
    <8be>   DW_AT_type        : <0x263>
    <8c2>   DW_AT_data_member_location: 68
 <2><8c3>: Abbrev Number: 5 (DW_TAG_member)
    <8c4>   DW_AT_name        : DCR
    <8c8>   DW_AT_decl_file   : 3
    <8c8>   DW_AT_decl_line   : 490
    <8ca>   DW_AT_decl_column : 17
    <8ca>   DW_AT_type        : <0x263>
    <8ce>   DW_AT_data_member_location: 72
 <2><8cf>: Abbrev Number: 3 (DW_TAG_member)
    <8d0>   DW_AT_name        : (indirect string, offset: 0x88955): DMAR
    <8d4>   DW_AT_decl_file   : 3
    <8d5>   DW_AT_decl_line   : 491
    <8d7>   DW_AT_decl_column : 17
    <8d8>   DW_AT_type        : <0x263>
    <8dc>   DW_AT_data_member_location: 76
 <2><8dd>: Abbrev Number: 5 (DW_TAG_member)
    <8de>   DW_AT_name        : OR
    <8e1>   DW_AT_decl_file   : 3
    <8e1>   DW_AT_decl_line   : 492
    <8e3>   DW_AT_decl_column : 17
    <8e3>   DW_AT_type        : <0x263>
    <8e7>   DW_AT_data_member_location: 80
 <2><8e8>: Abbrev Number: 0
 <1><8e9>: Abbrev Number: 15 (DW_TAG_typedef)
    <8ea>   DW_AT_name        : (indirect string, offset: 0x568e): TIM_TypeDef
    <8ee>   DW_AT_decl_file   : 3
    <8ef>   DW_AT_decl_line   : 493
    <8f1>   DW_AT_decl_column : 3
    <8f1>   DW_AT_type        : <0x7cf>
 <1><8f5>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <8f6>   DW_AT_encoding    : 7	(unsigned)
    <8f7>   DW_AT_byte_size   : 1
    <8f8>   DW_AT_type        : <0x1de>
    <8fc>   DW_AT_decl_file   : 6
    <8fd>   DW_AT_decl_line   : 191
    <8fe>   DW_AT_decl_column : 1
    <8ff>   DW_AT_sibling     : <0x910>
 <2><903>: Abbrev Number: 1 (DW_TAG_enumerator)
    <904>   DW_AT_name        : (indirect string, offset: 0x4a959): DISABLE
    <908>   DW_AT_const_value : 0
 <2><909>: Abbrev Number: 1 (DW_TAG_enumerator)
    <90a>   DW_AT_name        : (indirect string, offset: 0x90a9e): ENABLE
    <90e>   DW_AT_const_value : 1
 <2><90f>: Abbrev Number: 0
 <1><910>: Abbrev Number: 4 (DW_TAG_typedef)
    <911>   DW_AT_name        : (indirect string, offset: 0x9e004): FunctionalState
    <915>   DW_AT_decl_file   : 6
    <916>   DW_AT_decl_line   : 194
    <917>   DW_AT_decl_column : 3
    <918>   DW_AT_type        : <0x8f5>
 <1><91c>: Abbrev Number: 13 (DW_TAG_base_type)
    <91d>   DW_AT_byte_size   : 8
    <91e>   DW_AT_encoding    : 4	(float)
    <91f>   DW_AT_name        : (indirect string, offset: 0x82835): long double
 <1><923>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <924>   DW_AT_encoding    : 7	(unsigned)
    <925>   DW_AT_byte_size   : 1
    <926>   DW_AT_type        : <0x1de>
    <92a>   DW_AT_decl_file   : 7
    <92b>   DW_AT_decl_line   : 39
    <92c>   DW_AT_decl_column : 1
    <92d>   DW_AT_sibling     : <0x94a>
 <2><931>: Abbrev Number: 1 (DW_TAG_enumerator)
    <932>   DW_AT_name        : (indirect string, offset: 0x34cb6): HAL_OK
    <936>   DW_AT_const_value : 0
 <2><937>: Abbrev Number: 1 (DW_TAG_enumerator)
    <938>   DW_AT_name        : (indirect string, offset: 0x6292d): HAL_ERROR
    <93c>   DW_AT_const_value : 1
 <2><93d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <93e>   DW_AT_name        : (indirect string, offset: 0x84e48): HAL_BUSY
    <942>   DW_AT_const_value : 2
 <2><943>: Abbrev Number: 1 (DW_TAG_enumerator)
    <944>   DW_AT_name        : (indirect string, offset: 0x2dbab): HAL_TIMEOUT
    <948>   DW_AT_const_value : 3
 <2><949>: Abbrev Number: 0
 <1><94a>: Abbrev Number: 4 (DW_TAG_typedef)
    <94b>   DW_AT_name        : (indirect string, offset: 0x8eb0a): HAL_StatusTypeDef
    <94f>   DW_AT_decl_file   : 7
    <950>   DW_AT_decl_line   : 44
    <951>   DW_AT_decl_column : 3
    <952>   DW_AT_type        : <0x923>
 <1><956>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <957>   DW_AT_encoding    : 7	(unsigned)
    <958>   DW_AT_byte_size   : 1
    <959>   DW_AT_type        : <0x1de>
    <95d>   DW_AT_decl_file   : 7
    <95e>   DW_AT_decl_line   : 50
    <95f>   DW_AT_decl_column : 1
    <960>   DW_AT_sibling     : <0x971>
 <2><964>: Abbrev Number: 1 (DW_TAG_enumerator)
    <965>   DW_AT_name        : (indirect string, offset: 0x75757): HAL_UNLOCKED
    <969>   DW_AT_const_value : 0
 <2><96a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <96b>   DW_AT_name        : (indirect string, offset: 0x9e96b): HAL_LOCKED
    <96f>   DW_AT_const_value : 1
 <2><970>: Abbrev Number: 0
 <1><971>: Abbrev Number: 4 (DW_TAG_typedef)
    <972>   DW_AT_name        : (indirect string, offset: 0x5fe8c): HAL_LockTypeDef
    <976>   DW_AT_decl_file   : 7
    <977>   DW_AT_decl_line   : 53
    <978>   DW_AT_decl_column : 3
    <979>   DW_AT_type        : <0x956>
 <1><97d>: Abbrev Number: 10 (DW_TAG_structure_type)
    <97e>   DW_AT_byte_size   : 24
    <97f>   DW_AT_decl_file   : 8
    <980>   DW_AT_decl_line   : 45
    <981>   DW_AT_decl_column : 9
    <981>   DW_AT_sibling     : <0x9d4>
 <2><985>: Abbrev Number: 2 (DW_TAG_member)
    <986>   DW_AT_name        : (indirect string, offset: 0x69757): PLLState
    <98a>   DW_AT_decl_file   : 8
    <98b>   DW_AT_decl_line   : 47
    <98c>   DW_AT_decl_column : 12
    <98d>   DW_AT_type        : <0x257>
    <991>   DW_AT_data_member_location: 0
 <2><992>: Abbrev Number: 2 (DW_TAG_member)
    <993>   DW_AT_name        : (indirect string, offset: 0x6abeb): PLLSource
    <997>   DW_AT_decl_file   : 8
    <998>   DW_AT_decl_line   : 50
    <999>   DW_AT_decl_column : 12
    <99a>   DW_AT_type        : <0x257>
    <99e>   DW_AT_data_member_location: 4
 <2><99f>: Abbrev Number: 2 (DW_TAG_member)
    <9a0>   DW_AT_name        : (indirect string, offset: 0x83e81): PLLM
    <9a4>   DW_AT_decl_file   : 8
    <9a5>   DW_AT_decl_line   : 53
    <9a6>   DW_AT_decl_column : 12
    <9a7>   DW_AT_type        : <0x257>
    <9ab>   DW_AT_data_member_location: 8
 <2><9ac>: Abbrev Number: 2 (DW_TAG_member)
    <9ad>   DW_AT_name        : (indirect string, offset: 0x83e86): PLLN
    <9b1>   DW_AT_decl_file   : 8
    <9b2>   DW_AT_decl_line   : 56
    <9b3>   DW_AT_decl_column : 12
    <9b4>   DW_AT_type        : <0x257>
    <9b8>   DW_AT_data_member_location: 12
 <2><9b9>: Abbrev Number: 2 (DW_TAG_member)
    <9ba>   DW_AT_name        : (indirect string, offset: 0x48da9): PLLP
    <9be>   DW_AT_decl_file   : 8
    <9bf>   DW_AT_decl_line   : 60
    <9c0>   DW_AT_decl_column : 12
    <9c1>   DW_AT_type        : <0x257>
    <9c5>   DW_AT_data_member_location: 16
 <2><9c6>: Abbrev Number: 2 (DW_TAG_member)
    <9c7>   DW_AT_name        : (indirect string, offset: 0x3a513): PLLQ
    <9cb>   DW_AT_decl_file   : 8
    <9cc>   DW_AT_decl_line   : 63
    <9cd>   DW_AT_decl_column : 12
    <9ce>   DW_AT_type        : <0x257>
    <9d2>   DW_AT_data_member_location: 20
 <2><9d3>: Abbrev Number: 0
 <1><9d4>: Abbrev Number: 4 (DW_TAG_typedef)
    <9d5>   DW_AT_name        : (indirect string, offset: 0x9bd22): RCC_PLLInitTypeDef
    <9d9>   DW_AT_decl_file   : 8
    <9da>   DW_AT_decl_line   : 73
    <9db>   DW_AT_decl_column : 3
    <9dc>   DW_AT_type        : <0x97d>
 <1><9e0>: Abbrev Number: 10 (DW_TAG_structure_type)
    <9e1>   DW_AT_byte_size   : 48
    <9e2>   DW_AT_decl_file   : 9
    <9e3>   DW_AT_decl_line   : 49
    <9e4>   DW_AT_decl_column : 9
    <9e4>   DW_AT_sibling     : <0xa44>
 <2><9e8>: Abbrev Number: 2 (DW_TAG_member)
    <9e9>   DW_AT_name        : (indirect string, offset: 0x81751): OscillatorType
    <9ed>   DW_AT_decl_file   : 9
    <9ee>   DW_AT_decl_line   : 51
    <9ef>   DW_AT_decl_column : 12
    <9f0>   DW_AT_type        : <0x257>
    <9f4>   DW_AT_data_member_location: 0
 <2><9f5>: Abbrev Number: 2 (DW_TAG_member)
    <9f6>   DW_AT_name        : (indirect string, offset: 0x6aa86): HSEState
    <9fa>   DW_AT_decl_file   : 9
    <9fb>   DW_AT_decl_line   : 54
    <9fc>   DW_AT_decl_column : 12
    <9fd>   DW_AT_type        : <0x257>
    <a01>   DW_AT_data_member_location: 4
 <2><a02>: Abbrev Number: 2 (DW_TAG_member)
    <a03>   DW_AT_name        : (indirect string, offset: 0x6304f): LSEState
    <a07>   DW_AT_decl_file   : 9
    <a08>   DW_AT_decl_line   : 57
    <a09>   DW_AT_decl_column : 12
    <a0a>   DW_AT_type        : <0x257>
    <a0e>   DW_AT_data_member_location: 8
 <2><a0f>: Abbrev Number: 2 (DW_TAG_member)
    <a10>   DW_AT_name        : (indirect string, offset: 0x45d9d): HSIState
    <a14>   DW_AT_decl_file   : 9
    <a15>   DW_AT_decl_line   : 60
    <a16>   DW_AT_decl_column : 12
    <a17>   DW_AT_type        : <0x257>
    <a1b>   DW_AT_data_member_location: 12
 <2><a1c>: Abbrev Number: 2 (DW_TAG_member)
    <a1d>   DW_AT_name        : (indirect string, offset: 0x88b15): HSICalibrationValue
    <a21>   DW_AT_decl_file   : 9
    <a22>   DW_AT_decl_line   : 63
    <a23>   DW_AT_decl_column : 12
    <a24>   DW_AT_type        : <0x257>
    <a28>   DW_AT_data_member_location: 16
 <2><a29>: Abbrev Number: 2 (DW_TAG_member)
    <a2a>   DW_AT_name        : (indirect string, offset: 0x8e11c): LSIState
    <a2e>   DW_AT_decl_file   : 9
    <a2f>   DW_AT_decl_line   : 66
    <a30>   DW_AT_decl_column : 12
    <a31>   DW_AT_type        : <0x257>
    <a35>   DW_AT_data_member_location: 20
 <2><a36>: Abbrev Number: 11 (DW_TAG_member)
    <a37>   DW_AT_name        : PLL
    <a3b>   DW_AT_decl_file   : 9
    <a3c>   DW_AT_decl_line   : 69
    <a3d>   DW_AT_decl_column : 22
    <a3e>   DW_AT_type        : <0x9d4>
    <a42>   DW_AT_data_member_location: 24
 <2><a43>: Abbrev Number: 0
 <1><a44>: Abbrev Number: 4 (DW_TAG_typedef)
    <a45>   DW_AT_name        : (indirect string, offset: 0x53db5): RCC_OscInitTypeDef
    <a49>   DW_AT_decl_file   : 9
    <a4a>   DW_AT_decl_line   : 70
    <a4b>   DW_AT_decl_column : 3
    <a4c>   DW_AT_type        : <0x9e0>
 <1><a50>: Abbrev Number: 21 (DW_TAG_const_type)
    <a51>   DW_AT_type        : <0xa44>
 <1><a55>: Abbrev Number: 10 (DW_TAG_structure_type)
    <a56>   DW_AT_byte_size   : 20
    <a57>   DW_AT_decl_file   : 9
    <a58>   DW_AT_decl_line   : 75
    <a59>   DW_AT_decl_column : 9
    <a59>   DW_AT_sibling     : <0xa9f>
 <2><a5d>: Abbrev Number: 2 (DW_TAG_member)
    <a5e>   DW_AT_name        : (indirect string, offset: 0x2fc4b): ClockType
    <a62>   DW_AT_decl_file   : 9
    <a63>   DW_AT_decl_line   : 77
    <a64>   DW_AT_decl_column : 12
    <a65>   DW_AT_type        : <0x257>
    <a69>   DW_AT_data_member_location: 0
 <2><a6a>: Abbrev Number: 2 (DW_TAG_member)
    <a6b>   DW_AT_name        : (indirect string, offset: 0x50733): SYSCLKSource
    <a6f>   DW_AT_decl_file   : 9
    <a70>   DW_AT_decl_line   : 80
    <a71>   DW_AT_decl_column : 12
    <a72>   DW_AT_type        : <0x257>
    <a76>   DW_AT_data_member_location: 4
 <2><a77>: Abbrev Number: 2 (DW_TAG_member)
    <a78>   DW_AT_name        : (indirect string, offset: 0x837d2): AHBCLKDivider
    <a7c>   DW_AT_decl_file   : 9
    <a7d>   DW_AT_decl_line   : 83
    <a7e>   DW_AT_decl_column : 12
    <a7f>   DW_AT_type        : <0x257>
    <a83>   DW_AT_data_member_location: 8
 <2><a84>: Abbrev Number: 2 (DW_TAG_member)
    <a85>   DW_AT_name        : (indirect string, offset: 0x61b4): APB1CLKDivider
    <a89>   DW_AT_decl_file   : 9
    <a8a>   DW_AT_decl_line   : 86
    <a8b>   DW_AT_decl_column : 12
    <a8c>   DW_AT_type        : <0x257>
    <a90>   DW_AT_data_member_location: 12
 <2><a91>: Abbrev Number: 2 (DW_TAG_member)
    <a92>   DW_AT_name        : (indirect string, offset: 0x47e0d): APB2CLKDivider
    <a96>   DW_AT_decl_file   : 9
    <a97>   DW_AT_decl_line   : 89
    <a98>   DW_AT_decl_column : 12
    <a99>   DW_AT_type        : <0x257>
    <a9d>   DW_AT_data_member_location: 16
 <2><a9e>: Abbrev Number: 0
 <1><a9f>: Abbrev Number: 4 (DW_TAG_typedef)
    <aa0>   DW_AT_name        : (indirect string, offset: 0x7ab7f): RCC_ClkInitTypeDef
    <aa4>   DW_AT_decl_file   : 9
    <aa5>   DW_AT_decl_line   : 92
    <aa6>   DW_AT_decl_column : 3
    <aa7>   DW_AT_type        : <0xa55>
 <1><aab>: Abbrev Number: 21 (DW_TAG_const_type)
    <aac>   DW_AT_type        : <0xa9f>
 <1><ab0>: Abbrev Number: 10 (DW_TAG_structure_type)
    <ab1>   DW_AT_byte_size   : 20
    <ab2>   DW_AT_decl_file   : 10
    <ab3>   DW_AT_decl_line   : 46
    <ab4>   DW_AT_decl_column : 9
    <ab4>   DW_AT_sibling     : <0xafa>
 <2><ab8>: Abbrev Number: 11 (DW_TAG_member)
    <ab9>   DW_AT_name        : Pin
    <abd>   DW_AT_decl_file   : 10
    <abe>   DW_AT_decl_line   : 48
    <abf>   DW_AT_decl_column : 12
    <ac0>   DW_AT_type        : <0x257>
    <ac4>   DW_AT_data_member_location: 0
 <2><ac5>: Abbrev Number: 2 (DW_TAG_member)
    <ac6>   DW_AT_name        : (indirect string, offset: 0xa4134): Mode
    <aca>   DW_AT_decl_file   : 10
    <acb>   DW_AT_decl_line   : 51
    <acc>   DW_AT_decl_column : 12
    <acd>   DW_AT_type        : <0x257>
    <ad1>   DW_AT_data_member_location: 4
 <2><ad2>: Abbrev Number: 2 (DW_TAG_member)
    <ad3>   DW_AT_name        : (indirect string, offset: 0x512cd): Pull
    <ad7>   DW_AT_decl_file   : 10
    <ad8>   DW_AT_decl_line   : 54
    <ad9>   DW_AT_decl_column : 12
    <ada>   DW_AT_type        : <0x257>
    <ade>   DW_AT_data_member_location: 8
 <2><adf>: Abbrev Number: 2 (DW_TAG_member)
    <ae0>   DW_AT_name        : (indirect string, offset: 0xa5034): Speed
    <ae4>   DW_AT_decl_file   : 10
    <ae5>   DW_AT_decl_line   : 57
    <ae6>   DW_AT_decl_column : 12
    <ae7>   DW_AT_type        : <0x257>
    <aeb>   DW_AT_data_member_location: 12
 <2><aec>: Abbrev Number: 2 (DW_TAG_member)
    <aed>   DW_AT_name        : (indirect string, offset: 0x47dcf): Alternate
    <af1>   DW_AT_decl_file   : 10
    <af2>   DW_AT_decl_line   : 60
    <af3>   DW_AT_decl_column : 12
    <af4>   DW_AT_type        : <0x257>
    <af8>   DW_AT_data_member_location: 16
 <2><af9>: Abbrev Number: 0
 <1><afa>: Abbrev Number: 4 (DW_TAG_typedef)
    <afb>   DW_AT_name        : (indirect string, offset: 0x7c635): GPIO_InitTypeDef
    <aff>   DW_AT_decl_file   : 10
    <b00>   DW_AT_decl_line   : 62
    <b01>   DW_AT_decl_column : 2
    <b02>   DW_AT_type        : <0xab0>
 <1><b06>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <b07>   DW_AT_encoding    : 7	(unsigned)
    <b08>   DW_AT_byte_size   : 1
    <b09>   DW_AT_type        : <0x1de>
    <b0d>   DW_AT_decl_file   : 10
    <b0e>   DW_AT_decl_line   : 68
    <b0f>   DW_AT_decl_column : 1
    <b10>   DW_AT_sibling     : <0xb21>
 <2><b14>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b15>   DW_AT_name        : (indirect string, offset: 0x2060a): GPIO_PIN_RESET
    <b19>   DW_AT_const_value : 0
 <2><b1a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b1b>   DW_AT_name        : (indirect string, offset: 0x1ba1a): GPIO_PIN_SET
    <b1f>   DW_AT_const_value : 1
 <2><b20>: Abbrev Number: 0
 <1><b21>: Abbrev Number: 4 (DW_TAG_typedef)
    <b22>   DW_AT_name        : (indirect string, offset: 0x9c11b): GPIO_PinState
    <b26>   DW_AT_decl_file   : 10
    <b27>   DW_AT_decl_line   : 71
    <b28>   DW_AT_decl_column : 2
    <b29>   DW_AT_type        : <0xb06>
 <1><b2d>: Abbrev Number: 10 (DW_TAG_structure_type)
    <b2e>   DW_AT_byte_size   : 48
    <b2f>   DW_AT_decl_file   : 11
    <b30>   DW_AT_decl_line   : 48
    <b31>   DW_AT_decl_column : 9
    <b31>   DW_AT_sibling     : <0xbd2>
 <2><b35>: Abbrev Number: 2 (DW_TAG_member)
    <b36>   DW_AT_name        : (indirect string, offset: 0xa0015): Channel
    <b3a>   DW_AT_decl_file   : 11
    <b3b>   DW_AT_decl_line   : 50
    <b3c>   DW_AT_decl_column : 12
    <b3d>   DW_AT_type        : <0x257>
    <b41>   DW_AT_data_member_location: 0
 <2><b42>: Abbrev Number: 2 (DW_TAG_member)
    <b43>   DW_AT_name        : (indirect string, offset: 0xa2798): Direction
    <b47>   DW_AT_decl_file   : 11
    <b48>   DW_AT_decl_line   : 53
    <b49>   DW_AT_decl_column : 12
    <b4a>   DW_AT_type        : <0x257>
    <b4e>   DW_AT_data_member_location: 4
 <2><b4f>: Abbrev Number: 2 (DW_TAG_member)
    <b50>   DW_AT_name        : (indirect string, offset: 0xa63b): PeriphInc
    <b54>   DW_AT_decl_file   : 11
    <b55>   DW_AT_decl_line   : 57
    <b56>   DW_AT_decl_column : 12
    <b57>   DW_AT_type        : <0x257>
    <b5b>   DW_AT_data_member_location: 8
 <2><b5c>: Abbrev Number: 2 (DW_TAG_member)
    <b5d>   DW_AT_name        : (indirect string, offset: 0x1888d): MemInc
    <b61>   DW_AT_decl_file   : 11
    <b62>   DW_AT_decl_line   : 60
    <b63>   DW_AT_decl_column : 12
    <b64>   DW_AT_type        : <0x257>
    <b68>   DW_AT_data_member_location: 12
 <2><b69>: Abbrev Number: 2 (DW_TAG_member)
    <b6a>   DW_AT_name        : (indirect string, offset: 0x4e7c7): PeriphDataAlignment
    <b6e>   DW_AT_decl_file   : 11
    <b6f>   DW_AT_decl_line   : 63
    <b70>   DW_AT_decl_column : 12
    <b71>   DW_AT_type        : <0x257>
    <b75>   DW_AT_data_member_location: 16
 <2><b76>: Abbrev Number: 2 (DW_TAG_member)
    <b77>   DW_AT_name        : (indirect string, offset: 0x8fc08): MemDataAlignment
    <b7b>   DW_AT_decl_file   : 11
    <b7c>   DW_AT_decl_line   : 66
    <b7d>   DW_AT_decl_column : 12
    <b7e>   DW_AT_type        : <0x257>
    <b82>   DW_AT_data_member_location: 20
 <2><b83>: Abbrev Number: 2 (DW_TAG_member)
    <b84>   DW_AT_name        : (indirect string, offset: 0xa4134): Mode
    <b88>   DW_AT_decl_file   : 11
    <b89>   DW_AT_decl_line   : 69
    <b8a>   DW_AT_decl_column : 12
    <b8b>   DW_AT_type        : <0x257>
    <b8f>   DW_AT_data_member_location: 24
 <2><b90>: Abbrev Number: 2 (DW_TAG_member)
    <b91>   DW_AT_name        : (indirect string, offset: 0xa1ad6): Priority
    <b95>   DW_AT_decl_file   : 11
    <b96>   DW_AT_decl_line   : 74
    <b97>   DW_AT_decl_column : 12
    <b98>   DW_AT_type        : <0x257>
    <b9c>   DW_AT_data_member_location: 28
 <2><b9d>: Abbrev Number: 2 (DW_TAG_member)
    <b9e>   DW_AT_name        : (indirect string, offset: 0x438b8): FIFOMode
    <ba2>   DW_AT_decl_file   : 11
    <ba3>   DW_AT_decl_line   : 77
    <ba4>   DW_AT_decl_column : 12
    <ba5>   DW_AT_type        : <0x257>
    <ba9>   DW_AT_data_member_location: 32
 <2><baa>: Abbrev Number: 2 (DW_TAG_member)
    <bab>   DW_AT_name        : (indirect string, offset: 0x78c6a): FIFOThreshold
    <baf>   DW_AT_decl_file   : 11
    <bb0>   DW_AT_decl_line   : 82
    <bb1>   DW_AT_decl_column : 12
    <bb2>   DW_AT_type        : <0x257>
    <bb6>   DW_AT_data_member_location: 36
 <2><bb7>: Abbrev Number: 2 (DW_TAG_member)
    <bb8>   DW_AT_name        : (indirect string, offset: 0x7739f): MemBurst
    <bbc>   DW_AT_decl_file   : 11
    <bbd>   DW_AT_decl_line   : 85
    <bbe>   DW_AT_decl_column : 12
    <bbf>   DW_AT_type        : <0x257>
    <bc3>   DW_AT_data_member_location: 40
 <2><bc4>: Abbrev Number: 2 (DW_TAG_member)
    <bc5>   DW_AT_name        : (indirect string, offset: 0x359f1): PeriphBurst
    <bc9>   DW_AT_decl_file   : 11
    <bca>   DW_AT_decl_line   : 91
    <bcb>   DW_AT_decl_column : 12
    <bcc>   DW_AT_type        : <0x257>
    <bd0>   DW_AT_data_member_location: 44
 <2><bd1>: Abbrev Number: 0
 <1><bd2>: Abbrev Number: 4 (DW_TAG_typedef)
    <bd3>   DW_AT_name        : (indirect string, offset: 0x2a033): DMA_InitTypeDef
    <bd7>   DW_AT_decl_file   : 11
    <bd8>   DW_AT_decl_line   : 96
    <bd9>   DW_AT_decl_column : 2
    <bda>   DW_AT_type        : <0xb2d>
 <1><bde>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <bdf>   DW_AT_encoding    : 7	(unsigned)
    <be0>   DW_AT_byte_size   : 1
    <be1>   DW_AT_type        : <0x1de>
    <be5>   DW_AT_decl_file   : 11
    <be6>   DW_AT_decl_line   : 103
    <be7>   DW_AT_decl_column : 1
    <be8>   DW_AT_sibling     : <0xc11>
 <2><bec>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bed>   DW_AT_name        : (indirect string, offset: 0x7674f): HAL_DMA_STATE_RESET
    <bf1>   DW_AT_const_value : 0
 <2><bf2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bf3>   DW_AT_name        : (indirect string, offset: 0x2affa): HAL_DMA_STATE_READY
    <bf7>   DW_AT_const_value : 1
 <2><bf8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bf9>   DW_AT_name        : (indirect string, offset: 0x6d3b6): HAL_DMA_STATE_BUSY
    <bfd>   DW_AT_const_value : 2
 <2><bfe>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bff>   DW_AT_name        : (indirect string, offset: 0x9c410): HAL_DMA_STATE_TIMEOUT
    <c03>   DW_AT_const_value : 3
 <2><c04>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c05>   DW_AT_name        : (indirect string, offset: 0x880bb): HAL_DMA_STATE_ERROR
    <c09>   DW_AT_const_value : 4
 <2><c0a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c0b>   DW_AT_name        : (indirect string, offset: 0x23acb): HAL_DMA_STATE_ABORT
    <c0f>   DW_AT_const_value : 5
 <2><c10>: Abbrev Number: 0
 <1><c11>: Abbrev Number: 4 (DW_TAG_typedef)
    <c12>   DW_AT_name        : (indirect string, offset: 0x68b80): HAL_DMA_StateTypeDef
    <c16>   DW_AT_decl_file   : 11
    <c17>   DW_AT_decl_line   : 110
    <c18>   DW_AT_decl_column : 2
    <c19>   DW_AT_type        : <0xbde>
 <1><c1d>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <c1e>   DW_AT_type        : <0xc11>
 <1><c22>: Abbrev Number: 31 (DW_TAG_structure_type)
    <c23>   DW_AT_name        : (indirect string, offset: 0x874b1): __DMA_HandleTypeDef
    <c27>   DW_AT_byte_size   : 96
    <c28>   DW_AT_decl_file   : 11
    <c29>   DW_AT_decl_line   : 138
    <c2a>   DW_AT_decl_column : 16
    <c2a>   DW_AT_sibling     : <0xce5>
 <2><c2e>: Abbrev Number: 2 (DW_TAG_member)
    <c2f>   DW_AT_name        : (indirect string, offset: 0x3ce8c): Instance
    <c33>   DW_AT_decl_file   : 11
    <c34>   DW_AT_decl_line   : 140
    <c35>   DW_AT_decl_column : 31
    <c36>   DW_AT_type        : <0xce5>
    <c3a>   DW_AT_data_member_location: 0
 <2><c3b>: Abbrev Number: 2 (DW_TAG_member)
    <c3c>   DW_AT_name        : (indirect string, offset: 0x8174c): Init
    <c40>   DW_AT_decl_file   : 11
    <c41>   DW_AT_decl_line   : 142
    <c42>   DW_AT_decl_column : 30
    <c43>   DW_AT_type        : <0xbd2>
    <c47>   DW_AT_data_member_location: 4
 <2><c48>: Abbrev Number: 2 (DW_TAG_member)
    <c49>   DW_AT_name        : (indirect string, offset: 0x70e56): Lock
    <c4d>   DW_AT_decl_file   : 11
    <c4e>   DW_AT_decl_line   : 144
    <c4f>   DW_AT_decl_column : 30
    <c50>   DW_AT_type        : <0x971>
    <c54>   DW_AT_data_member_location: 52
 <2><c55>: Abbrev Number: 2 (DW_TAG_member)
    <c56>   DW_AT_name        : (indirect string, offset: 0x6aa89): State
    <c5a>   DW_AT_decl_file   : 11
    <c5b>   DW_AT_decl_line   : 146
    <c5c>   DW_AT_decl_column : 30
    <c5d>   DW_AT_type        : <0xc1d>
    <c61>   DW_AT_data_member_location: 53
 <2><c62>: Abbrev Number: 2 (DW_TAG_member)
    <c63>   DW_AT_name        : (indirect string, offset: 0x96ed0): Parent
    <c67>   DW_AT_decl_file   : 11
    <c68>   DW_AT_decl_line   : 148
    <c69>   DW_AT_decl_column : 31
    <c6a>   DW_AT_type        : <0xcea>
    <c6e>   DW_AT_data_member_location: 56
 <2><c6f>: Abbrev Number: 2 (DW_TAG_member)
    <c70>   DW_AT_name        : (indirect string, offset: 0x9e212): XferCpltCallback
    <c74>   DW_AT_decl_file   : 11
    <c75>   DW_AT_decl_line   : 150
    <c76>   DW_AT_decl_column : 33
    <c77>   DW_AT_type        : <0xcfc>
    <c7b>   DW_AT_data_member_location: 60
 <2><c7c>: Abbrev Number: 2 (DW_TAG_member)
    <c7d>   DW_AT_name        : (indirect string, offset: 0x7b8be): XferHalfCpltCallback
    <c81>   DW_AT_decl_file   : 11
    <c82>   DW_AT_decl_line   : 152
    <c83>   DW_AT_decl_column : 33
    <c84>   DW_AT_type        : <0xcfc>
    <c88>   DW_AT_data_member_location: 64
 <2><c89>: Abbrev Number: 2 (DW_TAG_member)
    <c8a>   DW_AT_name        : (indirect string, offset: 0x256b6): XferM1CpltCallback
    <c8e>   DW_AT_decl_file   : 11
    <c8f>   DW_AT_decl_line   : 154
    <c90>   DW_AT_decl_column : 33
    <c91>   DW_AT_type        : <0xcfc>
    <c95>   DW_AT_data_member_location: 68
 <2><c96>: Abbrev Number: 2 (DW_TAG_member)
    <c97>   DW_AT_name        : (indirect string, offset: 0x57645): XferM1HalfCpltCallback
    <c9b>   DW_AT_decl_file   : 11
    <c9c>   DW_AT_decl_line   : 156
    <c9d>   DW_AT_decl_column : 33
    <c9e>   DW_AT_type        : <0xcfc>
    <ca2>   DW_AT_data_member_location: 72
 <2><ca3>: Abbrev Number: 2 (DW_TAG_member)
    <ca4>   DW_AT_name        : (indirect string, offset: 0x16a48): XferErrorCallback
    <ca8>   DW_AT_decl_file   : 11
    <ca9>   DW_AT_decl_line   : 158
    <caa>   DW_AT_decl_column : 33
    <cab>   DW_AT_type        : <0xcfc>
    <caf>   DW_AT_data_member_location: 76
 <2><cb0>: Abbrev Number: 2 (DW_TAG_member)
    <cb1>   DW_AT_name        : (indirect string, offset: 0x943a0): XferAbortCallback
    <cb5>   DW_AT_decl_file   : 11
    <cb6>   DW_AT_decl_line   : 160
    <cb7>   DW_AT_decl_column : 33
    <cb8>   DW_AT_type        : <0xcfc>
    <cbc>   DW_AT_data_member_location: 80
 <2><cbd>: Abbrev Number: 2 (DW_TAG_member)
    <cbe>   DW_AT_name        : (indirect string, offset: 0x9b4af): ErrorCode
    <cc2>   DW_AT_decl_file   : 11
    <cc3>   DW_AT_decl_line   : 162
    <cc4>   DW_AT_decl_column : 30
    <cc5>   DW_AT_type        : <0x263>
    <cc9>   DW_AT_data_member_location: 84
 <2><cca>: Abbrev Number: 2 (DW_TAG_member)
    <ccb>   DW_AT_name        : (indirect string, offset: 0x77f39): StreamBaseAddress
    <ccf>   DW_AT_decl_file   : 11
    <cd0>   DW_AT_decl_line   : 164
    <cd1>   DW_AT_decl_column : 30
    <cd2>   DW_AT_type        : <0x257>
    <cd6>   DW_AT_data_member_location: 88
 <2><cd7>: Abbrev Number: 2 (DW_TAG_member)
    <cd8>   DW_AT_name        : (indirect string, offset: 0x85b8f): StreamIndex
    <cdc>   DW_AT_decl_file   : 11
    <cdd>   DW_AT_decl_line   : 166
    <cde>   DW_AT_decl_column : 30
    <cdf>   DW_AT_type        : <0x257>
    <ce3>   DW_AT_data_member_location: 92
 <2><ce4>: Abbrev Number: 0
 <1><ce5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ce6>   DW_AT_byte_size   : 4
    <ce6>   DW_AT_type        : <0x405>
 <1><cea>: Abbrev Number: 39 (DW_TAG_pointer_type)
    <ceb>   DW_AT_byte_size   : 4
 <1><cec>: Abbrev Number: 27 (DW_TAG_subroutine_type)
    <ced>   DW_AT_prototyped  : 1
    <ced>   DW_AT_sibling     : <0xcf7>
 <2><cf1>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <cf2>   DW_AT_type        : <0xcf7>
 <2><cf6>: Abbrev Number: 0
 <1><cf7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <cf8>   DW_AT_byte_size   : 4
    <cf8>   DW_AT_type        : <0xc22>
 <1><cfc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <cfd>   DW_AT_byte_size   : 4
    <cfd>   DW_AT_type        : <0xcec>
 <1><d01>: Abbrev Number: 4 (DW_TAG_typedef)
    <d02>   DW_AT_name        : (indirect string, offset: 0x874b3): DMA_HandleTypeDef
    <d06>   DW_AT_decl_file   : 11
    <d07>   DW_AT_decl_line   : 168
    <d08>   DW_AT_decl_column : 2
    <d09>   DW_AT_type        : <0xc22>
 <1><d0d>: Abbrev Number: 10 (DW_TAG_structure_type)
    <d0e>   DW_AT_byte_size   : 48
    <d0f>   DW_AT_decl_file   : 12
    <d10>   DW_AT_decl_line   : 59
    <d11>   DW_AT_decl_column : 9
    <d11>   DW_AT_sibling     : <0xdb2>
 <2><d15>: Abbrev Number: 2 (DW_TAG_member)
    <d16>   DW_AT_name        : (indirect string, offset: 0x8c6ce): ClockPrescaler
    <d1a>   DW_AT_decl_file   : 12
    <d1b>   DW_AT_decl_line   : 61
    <d1c>   DW_AT_decl_column : 12
    <d1d>   DW_AT_type        : <0x257>
    <d21>   DW_AT_data_member_location: 0
 <2><d22>: Abbrev Number: 2 (DW_TAG_member)
    <d23>   DW_AT_name        : (indirect string, offset: 0xc8a1): Resolution
    <d27>   DW_AT_decl_file   : 12
    <d28>   DW_AT_decl_line   : 64
    <d29>   DW_AT_decl_column : 12
    <d2a>   DW_AT_type        : <0x257>
    <d2e>   DW_AT_data_member_location: 4
 <2><d2f>: Abbrev Number: 2 (DW_TAG_member)
    <d30>   DW_AT_name        : (indirect string, offset: 0x221dc): DataAlign
    <d34>   DW_AT_decl_file   : 12
    <d35>   DW_AT_decl_line   : 66
    <d36>   DW_AT_decl_column : 12
    <d37>   DW_AT_type        : <0x257>
    <d3b>   DW_AT_data_member_location: 8
 <2><d3c>: Abbrev Number: 2 (DW_TAG_member)
    <d3d>   DW_AT_name        : (indirect string, offset: 0x5ee2e): ScanConvMode
    <d41>   DW_AT_decl_file   : 12
    <d42>   DW_AT_decl_line   : 69
    <d43>   DW_AT_decl_column : 12
    <d44>   DW_AT_type        : <0x257>
    <d48>   DW_AT_data_member_location: 12
 <2><d49>: Abbrev Number: 2 (DW_TAG_member)
    <d4a>   DW_AT_name        : (indirect string, offset: 0x68fc1): EOCSelection
    <d4e>   DW_AT_decl_file   : 12
    <d4f>   DW_AT_decl_line   : 76
    <d50>   DW_AT_decl_column : 12
    <d51>   DW_AT_type        : <0x257>
    <d55>   DW_AT_data_member_location: 16
 <2><d56>: Abbrev Number: 2 (DW_TAG_member)
    <d57>   DW_AT_name        : (indirect string, offset: 0x419ac): ContinuousConvMode
    <d5b>   DW_AT_decl_file   : 12
    <d5c>   DW_AT_decl_line   : 83
    <d5d>   DW_AT_decl_column : 19
    <d5e>   DW_AT_type        : <0x910>
    <d62>   DW_AT_data_member_location: 20
 <2><d63>: Abbrev Number: 2 (DW_TAG_member)
    <d64>   DW_AT_name        : (indirect string, offset: 0xa1710): NbrOfConversion
    <d68>   DW_AT_decl_file   : 12
    <d69>   DW_AT_decl_line   : 86
    <d6a>   DW_AT_decl_column : 12
    <d6b>   DW_AT_type        : <0x257>
    <d6f>   DW_AT_data_member_location: 24
 <2><d70>: Abbrev Number: 2 (DW_TAG_member)
    <d71>   DW_AT_name        : (indirect string, offset: 0xa181b): DiscontinuousConvMode
    <d75>   DW_AT_decl_file   : 12
    <d76>   DW_AT_decl_line   : 89
    <d77>   DW_AT_decl_column : 19
    <d78>   DW_AT_type        : <0x910>
    <d7c>   DW_AT_data_member_location: 28
 <2><d7d>: Abbrev Number: 2 (DW_TAG_member)
    <d7e>   DW_AT_name        : (indirect string, offset: 0x168e3): NbrOfDiscConversion
    <d82>   DW_AT_decl_file   : 12
    <d83>   DW_AT_decl_line   : 93
    <d84>   DW_AT_decl_column : 12
    <d85>   DW_AT_type        : <0x257>
    <d89>   DW_AT_data_member_location: 32
 <2><d8a>: Abbrev Number: 2 (DW_TAG_member)
    <d8b>   DW_AT_name        : (indirect string, offset: 0x72419): ExternalTrigConv
    <d8f>   DW_AT_decl_file   : 12
    <d90>   DW_AT_decl_line   : 96
    <d91>   DW_AT_decl_column : 12
    <d92>   DW_AT_type        : <0x257>
    <d96>   DW_AT_data_member_location: 36
 <2><d97>: Abbrev Number: 2 (DW_TAG_member)
    <d98>   DW_AT_name        : (indirect string, offset: 0x2ac16): ExternalTrigConvEdge
    <d9c>   DW_AT_decl_file   : 12
    <d9d>   DW_AT_decl_line   : 100
    <d9e>   DW_AT_decl_column : 12
    <d9f>   DW_AT_type        : <0x257>
    <da3>   DW_AT_data_member_location: 40
 <2><da4>: Abbrev Number: 2 (DW_TAG_member)
    <da5>   DW_AT_name        : (indirect string, offset: 0x3e59f): DMAContinuousRequests
    <da9>   DW_AT_decl_file   : 12
    <daa>   DW_AT_decl_line   : 103
    <dab>   DW_AT_decl_column : 19
    <dac>   DW_AT_type        : <0x910>
    <db0>   DW_AT_data_member_location: 44
 <2><db1>: Abbrev Number: 0
 <1><db2>: Abbrev Number: 4 (DW_TAG_typedef)
    <db3>   DW_AT_name        : (indirect string, offset: 0x24bc5): ADC_InitTypeDef
    <db7>   DW_AT_decl_file   : 12
    <db8>   DW_AT_decl_line   : 108
    <db9>   DW_AT_decl_column : 3
    <dba>   DW_AT_type        : <0xd0d>
 <1><dbe>: Abbrev Number: 10 (DW_TAG_structure_type)
    <dbf>   DW_AT_byte_size   : 16
    <dc0>   DW_AT_decl_file   : 12
    <dc1>   DW_AT_decl_line   : 117
    <dc2>   DW_AT_decl_column : 9
    <dc2>   DW_AT_sibling     : <0xdfb>
 <2><dc6>: Abbrev Number: 2 (DW_TAG_member)
    <dc7>   DW_AT_name        : (indirect string, offset: 0xa0015): Channel
    <dcb>   DW_AT_decl_file   : 12
    <dcc>   DW_AT_decl_line   : 119
    <dcd>   DW_AT_decl_column : 12
    <dce>   DW_AT_type        : <0x257>
    <dd2>   DW_AT_data_member_location: 0
 <2><dd3>: Abbrev Number: 2 (DW_TAG_member)
    <dd4>   DW_AT_name        : (indirect string, offset: 0xa1728): Rank
    <dd8>   DW_AT_decl_file   : 12
    <dd9>   DW_AT_decl_line   : 121
    <dda>   DW_AT_decl_column : 12
    <ddb>   DW_AT_type        : <0x257>
    <ddf>   DW_AT_data_member_location: 4
 <2><de0>: Abbrev Number: 2 (DW_TAG_member)
    <de1>   DW_AT_name        : (indirect string, offset: 0xa18a1): SamplingTime
    <de5>   DW_AT_decl_file   : 12
    <de6>   DW_AT_decl_line   : 123
    <de7>   DW_AT_decl_column : 12
    <de8>   DW_AT_type        : <0x257>
    <dec>   DW_AT_data_member_location: 8
 <2><ded>: Abbrev Number: 2 (DW_TAG_member)
    <dee>   DW_AT_name        : (indirect string, offset: 0xa33d7): Offset
    <df2>   DW_AT_decl_file   : 12
    <df3>   DW_AT_decl_line   : 132
    <df4>   DW_AT_decl_column : 12
    <df5>   DW_AT_type        : <0x257>
    <df9>   DW_AT_data_member_location: 12
 <2><dfa>: Abbrev Number: 0
 <1><dfb>: Abbrev Number: 4 (DW_TAG_typedef)
    <dfc>   DW_AT_name        : (indirect string, offset: 0x9e440): ADC_ChannelConfTypeDef
    <e00>   DW_AT_decl_file   : 12
    <e01>   DW_AT_decl_line   : 133
    <e02>   DW_AT_decl_column : 3
    <e03>   DW_AT_type        : <0xdbe>
 <1><e07>: Abbrev Number: 10 (DW_TAG_structure_type)
    <e08>   DW_AT_byte_size   : 72
    <e09>   DW_AT_decl_file   : 12
    <e0a>   DW_AT_decl_line   : 195
    <e0b>   DW_AT_decl_column : 9
    <e0b>   DW_AT_sibling     : <0xe6b>
 <2><e0f>: Abbrev Number: 2 (DW_TAG_member)
    <e10>   DW_AT_name        : (indirect string, offset: 0x3ce8c): Instance
    <e14>   DW_AT_decl_file   : 12
    <e15>   DW_AT_decl_line   : 198
    <e16>   DW_AT_decl_column : 34
    <e17>   DW_AT_type        : <0xe6b>
    <e1b>   DW_AT_data_member_location: 0
 <2><e1c>: Abbrev Number: 2 (DW_TAG_member)
    <e1d>   DW_AT_name        : (indirect string, offset: 0x8174c): Init
    <e21>   DW_AT_decl_file   : 12
    <e22>   DW_AT_decl_line   : 200
    <e23>   DW_AT_decl_column : 33
    <e24>   DW_AT_type        : <0xdb2>
    <e28>   DW_AT_data_member_location: 4
 <2><e29>: Abbrev Number: 2 (DW_TAG_member)
    <e2a>   DW_AT_name        : (indirect string, offset: 0x285f9): NbrOfCurrentConversionRank
    <e2e>   DW_AT_decl_file   : 12
    <e2f>   DW_AT_decl_line   : 202
    <e30>   DW_AT_decl_column : 33
    <e31>   DW_AT_type        : <0x263>
    <e35>   DW_AT_data_member_location: 52
 <2><e36>: Abbrev Number: 2 (DW_TAG_member)
    <e37>   DW_AT_name        : (indirect string, offset: 0x1c3b): DMA_Handle
    <e3b>   DW_AT_decl_file   : 12
    <e3c>   DW_AT_decl_line   : 204
    <e3d>   DW_AT_decl_column : 34
    <e3e>   DW_AT_type        : <0xe70>
    <e42>   DW_AT_data_member_location: 56
 <2><e43>: Abbrev Number: 2 (DW_TAG_member)
    <e44>   DW_AT_name        : (indirect string, offset: 0x70e56): Lock
    <e48>   DW_AT_decl_file   : 12
    <e49>   DW_AT_decl_line   : 206
    <e4a>   DW_AT_decl_column : 33
    <e4b>   DW_AT_type        : <0x971>
    <e4f>   DW_AT_data_member_location: 60
 <2><e50>: Abbrev Number: 2 (DW_TAG_member)
    <e51>   DW_AT_name        : (indirect string, offset: 0x6aa89): State
    <e55>   DW_AT_decl_file   : 12
    <e56>   DW_AT_decl_line   : 208
    <e57>   DW_AT_decl_column : 33
    <e58>   DW_AT_type        : <0x263>
    <e5c>   DW_AT_data_member_location: 64
 <2><e5d>: Abbrev Number: 2 (DW_TAG_member)
    <e5e>   DW_AT_name        : (indirect string, offset: 0x9b4af): ErrorCode
    <e62>   DW_AT_decl_file   : 12
    <e63>   DW_AT_decl_line   : 210
    <e64>   DW_AT_decl_column : 33
    <e65>   DW_AT_type        : <0x263>
    <e69>   DW_AT_data_member_location: 68
 <2><e6a>: Abbrev Number: 0
 <1><e6b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e6c>   DW_AT_byte_size   : 4
    <e6c>   DW_AT_type        : <0x3a3>
 <1><e70>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e71>   DW_AT_byte_size   : 4
    <e71>   DW_AT_type        : <0xd01>
 <1><e75>: Abbrev Number: 4 (DW_TAG_typedef)
    <e76>   DW_AT_name        : (indirect string, offset: 0x1f652): ADC_HandleTypeDef
    <e7a>   DW_AT_decl_file   : 12
    <e7b>   DW_AT_decl_line   : 220
    <e7c>   DW_AT_decl_column : 3
    <e7d>   DW_AT_type        : <0xe07>
 <1><e81>: Abbrev Number: 10 (DW_TAG_structure_type)
    <e82>   DW_AT_byte_size   : 32
    <e83>   DW_AT_decl_file   : 13
    <e84>   DW_AT_decl_line   : 47
    <e85>   DW_AT_decl_column : 9
    <e85>   DW_AT_sibling     : <0xef2>
 <2><e89>: Abbrev Number: 2 (DW_TAG_member)
    <e8a>   DW_AT_name        : (indirect string, offset: 0x95c2f): ClockSpeed
    <e8e>   DW_AT_decl_file   : 13
    <e8f>   DW_AT_decl_line   : 49
    <e90>   DW_AT_decl_column : 12
    <e91>   DW_AT_type        : <0x257>
    <e95>   DW_AT_data_member_location: 0
 <2><e96>: Abbrev Number: 2 (DW_TAG_member)
    <e97>   DW_AT_name        : (indirect string, offset: 0x5f7a6): DutyCycle
    <e9b>   DW_AT_decl_file   : 13
    <e9c>   DW_AT_decl_line   : 52
    <e9d>   DW_AT_decl_column : 12
    <e9e>   DW_AT_type        : <0x257>
    <ea2>   DW_AT_data_member_location: 4
 <2><ea3>: Abbrev Number: 2 (DW_TAG_member)
    <ea4>   DW_AT_name        : (indirect string, offset: 0x38597): OwnAddress1
    <ea8>   DW_AT_decl_file   : 13
    <ea9>   DW_AT_decl_line   : 55
    <eaa>   DW_AT_decl_column : 12
    <eab>   DW_AT_type        : <0x257>
    <eaf>   DW_AT_data_member_location: 8
 <2><eb0>: Abbrev Number: 2 (DW_TAG_member)
    <eb1>   DW_AT_name        : (indirect string, offset: 0x42867): AddressingMode
    <eb5>   DW_AT_decl_file   : 13
    <eb6>   DW_AT_decl_line   : 58
    <eb7>   DW_AT_decl_column : 12
    <eb8>   DW_AT_type        : <0x257>
    <ebc>   DW_AT_data_member_location: 12
 <2><ebd>: Abbrev Number: 2 (DW_TAG_member)
    <ebe>   DW_AT_name        : (indirect string, offset: 0x71dd9): DualAddressMode
    <ec2>   DW_AT_decl_file   : 13
    <ec3>   DW_AT_decl_line   : 61
    <ec4>   DW_AT_decl_column : 12
    <ec5>   DW_AT_type        : <0x257>
    <ec9>   DW_AT_data_member_location: 16
 <2><eca>: Abbrev Number: 2 (DW_TAG_member)
    <ecb>   DW_AT_name        : (indirect string, offset: 0x385a3): OwnAddress2
    <ecf>   DW_AT_decl_file   : 13
    <ed0>   DW_AT_decl_line   : 64
    <ed1>   DW_AT_decl_column : 12
    <ed2>   DW_AT_type        : <0x257>
    <ed6>   DW_AT_data_member_location: 20
 <2><ed7>: Abbrev Number: 2 (DW_TAG_member)
    <ed8>   DW_AT_name        : (indirect string, offset: 0x199a5): GeneralCallMode
    <edc>   DW_AT_decl_file   : 13
    <edd>   DW_AT_decl_line   : 67
    <ede>   DW_AT_decl_column : 12
    <edf>   DW_AT_type        : <0x257>
    <ee3>   DW_AT_data_member_location: 24
 <2><ee4>: Abbrev Number: 2 (DW_TAG_member)
    <ee5>   DW_AT_name        : (indirect string, offset: 0x2ff08): NoStretchMode
    <ee9>   DW_AT_decl_file   : 13
    <eea>   DW_AT_decl_line   : 70
    <eeb>   DW_AT_decl_column : 12
    <eec>   DW_AT_type        : <0x257>
    <ef0>   DW_AT_data_member_location: 28
 <2><ef1>: Abbrev Number: 0
 <1><ef2>: Abbrev Number: 4 (DW_TAG_typedef)
    <ef3>   DW_AT_name        : (indirect string, offset: 0x31d78): I2C_InitTypeDef
    <ef7>   DW_AT_decl_file   : 13
    <ef8>   DW_AT_decl_line   : 73
    <ef9>   DW_AT_decl_column : 3
    <efa>   DW_AT_type        : <0xe81>
 <1><efe>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <eff>   DW_AT_encoding    : 7	(unsigned)
    <f00>   DW_AT_byte_size   : 1
    <f01>   DW_AT_type        : <0x1de>
    <f05>   DW_AT_decl_file   : 13
    <f06>   DW_AT_decl_line   : 107
    <f07>   DW_AT_decl_column : 1
    <f08>   DW_AT_sibling     : <0xf4f>
 <2><f0c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f0d>   DW_AT_name        : (indirect string, offset: 0x7e5a3): HAL_I2C_STATE_RESET
    <f11>   DW_AT_const_value : 0
 <2><f12>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f13>   DW_AT_name        : (indirect string, offset: 0x32b3e): HAL_I2C_STATE_READY
    <f17>   DW_AT_const_value : 32
 <2><f18>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f19>   DW_AT_name        : (indirect string, offset: 0x2d352): HAL_I2C_STATE_BUSY
    <f1d>   DW_AT_const_value : 36
 <2><f1e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f1f>   DW_AT_name        : (indirect string, offset: 0x66d48): HAL_I2C_STATE_BUSY_TX
    <f23>   DW_AT_const_value : 33
 <2><f24>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f25>   DW_AT_name        : (indirect string, offset: 0x37a2c): HAL_I2C_STATE_BUSY_RX
    <f29>   DW_AT_const_value : 34
 <2><f2a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f2b>   DW_AT_name        : (indirect string, offset: 0x3dcc2): HAL_I2C_STATE_LISTEN
    <f2f>   DW_AT_const_value : 40
 <2><f30>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f31>   DW_AT_name        : (indirect string, offset: 0x259a3): HAL_I2C_STATE_BUSY_TX_LISTEN
    <f35>   DW_AT_const_value : 41
 <2><f36>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f37>   DW_AT_name        : (indirect string, offset: 0x7997f): HAL_I2C_STATE_BUSY_RX_LISTEN
    <f3b>   DW_AT_const_value : 42
 <2><f3c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f3d>   DW_AT_name        : (indirect string, offset: 0x2b498): HAL_I2C_STATE_ABORT
    <f41>   DW_AT_const_value : 96
 <2><f42>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f43>   DW_AT_name        : (indirect string, offset: 0x84c36): HAL_I2C_STATE_TIMEOUT
    <f47>   DW_AT_const_value : 160
 <2><f48>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f49>   DW_AT_name        : (indirect string, offset: 0x9022b): HAL_I2C_STATE_ERROR
    <f4d>   DW_AT_const_value : 224
 <2><f4e>: Abbrev Number: 0
 <1><f4f>: Abbrev Number: 4 (DW_TAG_typedef)
    <f50>   DW_AT_name        : (indirect string, offset: 0x1a392): HAL_I2C_StateTypeDef
    <f54>   DW_AT_decl_file   : 13
    <f55>   DW_AT_decl_line   : 122
    <f56>   DW_AT_decl_column : 3
    <f57>   DW_AT_type        : <0xefe>
 <1><f5b>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <f5c>   DW_AT_type        : <0xf4f>
 <1><f60>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <f61>   DW_AT_encoding    : 7	(unsigned)
    <f62>   DW_AT_byte_size   : 1
    <f63>   DW_AT_type        : <0x1de>
    <f67>   DW_AT_decl_file   : 13
    <f68>   DW_AT_decl_line   : 147
    <f69>   DW_AT_decl_column : 1
    <f6a>   DW_AT_sibling     : <0xf87>
 <2><f6e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f6f>   DW_AT_name        : (indirect string, offset: 0x28f3d): HAL_I2C_MODE_NONE
    <f73>   DW_AT_const_value : 0
 <2><f74>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f75>   DW_AT_name        : (indirect string, offset: 0x30a8): HAL_I2C_MODE_MASTER
    <f79>   DW_AT_const_value : 16
 <2><f7a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f7b>   DW_AT_name        : (indirect string, offset: 0x4edb3): HAL_I2C_MODE_SLAVE
    <f7f>   DW_AT_const_value : 32
 <2><f80>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f81>   DW_AT_name        : (indirect string, offset: 0x3182c): HAL_I2C_MODE_MEM
    <f85>   DW_AT_const_value : 64
 <2><f86>: Abbrev Number: 0
 <1><f87>: Abbrev Number: 4 (DW_TAG_typedef)
    <f88>   DW_AT_name        : (indirect string, offset: 0x4c530): HAL_I2C_ModeTypeDef
    <f8c>   DW_AT_decl_file   : 13
    <f8d>   DW_AT_decl_line   : 153
    <f8e>   DW_AT_decl_column : 3
    <f8f>   DW_AT_type        : <0xf60>
 <1><f93>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <f94>   DW_AT_type        : <0xf87>
 <1><f98>: Abbrev Number: 10 (DW_TAG_structure_type)
    <f99>   DW_AT_byte_size   : 84
    <f9a>   DW_AT_decl_file   : 13
    <f9b>   DW_AT_decl_line   : 187
    <f9c>   DW_AT_decl_column : 9
    <f9c>   DW_AT_sibling     : <0x107e>
 <2><fa0>: Abbrev Number: 2 (DW_TAG_member)
    <fa1>   DW_AT_name        : (indirect string, offset: 0x3ce8c): Instance
    <fa5>   DW_AT_decl_file   : 13
    <fa6>   DW_AT_decl_line   : 190
    <fa7>   DW_AT_decl_column : 31
    <fa8>   DW_AT_type        : <0x107e>
    <fac>   DW_AT_data_member_location: 0
 <2><fad>: Abbrev Number: 2 (DW_TAG_member)
    <fae>   DW_AT_name        : (indirect string, offset: 0x8174c): Init
    <fb2>   DW_AT_decl_file   : 13
    <fb3>   DW_AT_decl_line   : 192
    <fb4>   DW_AT_decl_column : 30
    <fb5>   DW_AT_type        : <0xef2>
    <fb9>   DW_AT_data_member_location: 4
 <2><fba>: Abbrev Number: 2 (DW_TAG_member)
    <fbb>   DW_AT_name        : (indirect string, offset: 0xe8a5): pBuffPtr
    <fbf>   DW_AT_decl_file   : 13
    <fc0>   DW_AT_decl_line   : 194
    <fc1>   DW_AT_decl_column : 31
    <fc2>   DW_AT_type        : <0x1083>
    <fc6>   DW_AT_data_member_location: 36
 <2><fc7>: Abbrev Number: 2 (DW_TAG_member)
    <fc8>   DW_AT_name        : (indirect string, offset: 0x4e860): XferSize
    <fcc>   DW_AT_decl_file   : 13
    <fcd>   DW_AT_decl_line   : 196
    <fce>   DW_AT_decl_column : 30
    <fcf>   DW_AT_type        : <0x246>
    <fd3>   DW_AT_data_member_location: 40
 <2><fd4>: Abbrev Number: 2 (DW_TAG_member)
    <fd5>   DW_AT_name        : (indirect string, offset: 0x5eac6): XferCount
    <fd9>   DW_AT_decl_file   : 13
    <fda>   DW_AT_decl_line   : 198
    <fdb>   DW_AT_decl_column : 30
    <fdc>   DW_AT_type        : <0x252>
    <fe0>   DW_AT_data_member_location: 42
 <2><fe1>: Abbrev Number: 2 (DW_TAG_member)
    <fe2>   DW_AT_name        : (indirect string, offset: 0xa2292): XferOptions
    <fe6>   DW_AT_decl_file   : 13
    <fe7>   DW_AT_decl_line   : 200
    <fe8>   DW_AT_decl_column : 30
    <fe9>   DW_AT_type        : <0x263>
    <fed>   DW_AT_data_member_location: 44
 <2><fee>: Abbrev Number: 2 (DW_TAG_member)
    <fef>   DW_AT_name        : (indirect string, offset: 0x4585f): PreviousState
    <ff3>   DW_AT_decl_file   : 13
    <ff4>   DW_AT_decl_line   : 202
    <ff5>   DW_AT_decl_column : 30
    <ff6>   DW_AT_type        : <0x263>
    <ffa>   DW_AT_data_member_location: 48
 <2><ffb>: Abbrev Number: 2 (DW_TAG_member)
    <ffc>   DW_AT_name        : (indirect string, offset: 0x9aa00): hdmatx
    <1000>   DW_AT_decl_file   : 13
    <1001>   DW_AT_decl_line   : 205
    <1002>   DW_AT_decl_column : 31
    <1003>   DW_AT_type        : <0xe70>
    <1007>   DW_AT_data_member_location: 52
 <2><1008>: Abbrev Number: 2 (DW_TAG_member)
    <1009>   DW_AT_name        : (indirect string, offset: 0x99f73): hdmarx
    <100d>   DW_AT_decl_file   : 13
    <100e>   DW_AT_decl_line   : 207
    <100f>   DW_AT_decl_column : 31
    <1010>   DW_AT_type        : <0xe70>
    <1014>   DW_AT_data_member_location: 56
 <2><1015>: Abbrev Number: 2 (DW_TAG_member)
    <1016>   DW_AT_name        : (indirect string, offset: 0x70e56): Lock
    <101a>   DW_AT_decl_file   : 13
    <101b>   DW_AT_decl_line   : 209
    <101c>   DW_AT_decl_column : 30
    <101d>   DW_AT_type        : <0x971>
    <1021>   DW_AT_data_member_location: 60
 <2><1022>: Abbrev Number: 2 (DW_TAG_member)
    <1023>   DW_AT_name        : (indirect string, offset: 0x6aa89): State
    <1027>   DW_AT_decl_file   : 13
    <1028>   DW_AT_decl_line   : 211
    <1029>   DW_AT_decl_column : 30
    <102a>   DW_AT_type        : <0xf5b>
    <102e>   DW_AT_data_member_location: 61
 <2><102f>: Abbrev Number: 2 (DW_TAG_member)
    <1030>   DW_AT_name        : (indirect string, offset: 0xa4134): Mode
    <1034>   DW_AT_decl_file   : 13
    <1035>   DW_AT_decl_line   : 213
    <1036>   DW_AT_decl_column : 30
    <1037>   DW_AT_type        : <0xf93>
    <103b>   DW_AT_data_member_location: 62
 <2><103c>: Abbrev Number: 2 (DW_TAG_member)
    <103d>   DW_AT_name        : (indirect string, offset: 0x9b4af): ErrorCode
    <1041>   DW_AT_decl_file   : 13
    <1042>   DW_AT_decl_line   : 215
    <1043>   DW_AT_decl_column : 30
    <1044>   DW_AT_type        : <0x263>
    <1048>   DW_AT_data_member_location: 64
 <2><1049>: Abbrev Number: 2 (DW_TAG_member)
    <104a>   DW_AT_name        : (indirect string, offset: 0x6618e): Devaddress
    <104e>   DW_AT_decl_file   : 13
    <104f>   DW_AT_decl_line   : 217
    <1050>   DW_AT_decl_column : 30
    <1051>   DW_AT_type        : <0x263>
    <1055>   DW_AT_data_member_location: 68
 <2><1056>: Abbrev Number: 2 (DW_TAG_member)
    <1057>   DW_AT_name        : (indirect string, offset: 0x8ff44): Memaddress
    <105b>   DW_AT_decl_file   : 13
    <105c>   DW_AT_decl_line   : 219
    <105d>   DW_AT_decl_column : 30
    <105e>   DW_AT_type        : <0x263>
    <1062>   DW_AT_data_member_location: 72
 <2><1063>: Abbrev Number: 2 (DW_TAG_member)
    <1064>   DW_AT_name        : (indirect string, offset: 0x4a6a7): MemaddSize
    <1068>   DW_AT_decl_file   : 13
    <1069>   DW_AT_decl_line   : 221
    <106a>   DW_AT_decl_column : 30
    <106b>   DW_AT_type        : <0x263>
    <106f>   DW_AT_data_member_location: 76
 <2><1070>: Abbrev Number: 2 (DW_TAG_member)
    <1071>   DW_AT_name        : (indirect string, offset: 0x69c69): EventCount
    <1075>   DW_AT_decl_file   : 13
    <1076>   DW_AT_decl_line   : 223
    <1077>   DW_AT_decl_column : 30
    <1078>   DW_AT_type        : <0x263>
    <107c>   DW_AT_data_member_location: 80
 <2><107d>: Abbrev Number: 0
 <1><107e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <107f>   DW_AT_byte_size   : 4
    <107f>   DW_AT_type        : <0x53d>
 <1><1083>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <1084>   DW_AT_byte_size   : 4
    <1084>   DW_AT_type        : <0x235>
 <1><1088>: Abbrev Number: 4 (DW_TAG_typedef)
    <1089>   DW_AT_name        : (indirect string, offset: 0x358b5): I2C_HandleTypeDef
    <108d>   DW_AT_decl_file   : 13
    <108e>   DW_AT_decl_line   : 243
    <108f>   DW_AT_decl_column : 3
    <1090>   DW_AT_type        : <0xf98>
 <1><1094>: Abbrev Number: 10 (DW_TAG_structure_type)
    <1095>   DW_AT_byte_size   : 44
    <1096>   DW_AT_decl_file   : 14
    <1097>   DW_AT_decl_line   : 46
    <1098>   DW_AT_decl_column : 9
    <1098>   DW_AT_sibling     : <0x112c>
 <2><109c>: Abbrev Number: 2 (DW_TAG_member)
    <109d>   DW_AT_name        : (indirect string, offset: 0xa4134): Mode
    <10a1>   DW_AT_decl_file   : 14
    <10a2>   DW_AT_decl_line   : 48
    <10a3>   DW_AT_decl_column : 12
    <10a4>   DW_AT_type        : <0x257>
    <10a8>   DW_AT_data_member_location: 0
 <2><10a9>: Abbrev Number: 2 (DW_TAG_member)
    <10aa>   DW_AT_name        : (indirect string, offset: 0xa2798): Direction
    <10ae>   DW_AT_decl_file   : 14
    <10af>   DW_AT_decl_line   : 51
    <10b0>   DW_AT_decl_column : 12
    <10b1>   DW_AT_type        : <0x257>
    <10b5>   DW_AT_data_member_location: 4
 <2><10b6>: Abbrev Number: 2 (DW_TAG_member)
    <10b7>   DW_AT_name        : (indirect string, offset: 0xa53c4): DataSize
    <10bb>   DW_AT_decl_file   : 14
    <10bc>   DW_AT_decl_line   : 54
    <10bd>   DW_AT_decl_column : 12
    <10be>   DW_AT_type        : <0x257>
    <10c2>   DW_AT_data_member_location: 8
 <2><10c3>: Abbrev Number: 2 (DW_TAG_member)
    <10c4>   DW_AT_name        : (indirect string, offset: 0x65de): CLKPolarity
    <10c8>   DW_AT_decl_file   : 14
    <10c9>   DW_AT_decl_line   : 57
    <10ca>   DW_AT_decl_column : 12
    <10cb>   DW_AT_type        : <0x257>
    <10cf>   DW_AT_data_member_location: 12
 <2><10d0>: Abbrev Number: 2 (DW_TAG_member)
    <10d1>   DW_AT_name        : (indirect string, offset: 0x69ec0): CLKPhase
    <10d5>   DW_AT_decl_file   : 14
    <10d6>   DW_AT_decl_line   : 60
    <10d7>   DW_AT_decl_column : 12
    <10d8>   DW_AT_type        : <0x257>
    <10dc>   DW_AT_data_member_location: 16
 <2><10dd>: Abbrev Number: 11 (DW_TAG_member)
    <10de>   DW_AT_name        : NSS
    <10e2>   DW_AT_decl_file   : 14
    <10e3>   DW_AT_decl_line   : 63
    <10e4>   DW_AT_decl_column : 12
    <10e5>   DW_AT_type        : <0x257>
    <10e9>   DW_AT_data_member_location: 20
 <2><10ea>: Abbrev Number: 2 (DW_TAG_member)
    <10eb>   DW_AT_name        : (indirect string, offset: 0x4325e): BaudRatePrescaler
    <10ef>   DW_AT_decl_file   : 14
    <10f0>   DW_AT_decl_line   : 67
    <10f1>   DW_AT_decl_column : 12
    <10f2>   DW_AT_type        : <0x257>
    <10f6>   DW_AT_data_member_location: 24
 <2><10f7>: Abbrev Number: 2 (DW_TAG_member)
    <10f8>   DW_AT_name        : (indirect string, offset: 0x6634e): FirstBit
    <10fc>   DW_AT_decl_file   : 14
    <10fd>   DW_AT_decl_line   : 73
    <10fe>   DW_AT_decl_column : 12
    <10ff>   DW_AT_type        : <0x257>
    <1103>   DW_AT_data_member_location: 28
 <2><1104>: Abbrev Number: 2 (DW_TAG_member)
    <1105>   DW_AT_name        : (indirect string, offset: 0x5b80c): TIMode
    <1109>   DW_AT_decl_file   : 14
    <110a>   DW_AT_decl_line   : 76
    <110b>   DW_AT_decl_column : 12
    <110c>   DW_AT_type        : <0x257>
    <1110>   DW_AT_data_member_location: 32
 <2><1111>: Abbrev Number: 2 (DW_TAG_member)
    <1112>   DW_AT_name        : (indirect string, offset: 0x71375): CRCCalculation
    <1116>   DW_AT_decl_file   : 14
    <1117>   DW_AT_decl_line   : 79
    <1118>   DW_AT_decl_column : 12
    <1119>   DW_AT_type        : <0x257>
    <111d>   DW_AT_data_member_location: 36
 <2><111e>: Abbrev Number: 2 (DW_TAG_member)
    <111f>   DW_AT_name        : (indirect string, offset: 0x556ae): CRCPolynomial
    <1123>   DW_AT_decl_file   : 14
    <1124>   DW_AT_decl_line   : 82
    <1125>   DW_AT_decl_column : 12
    <1126>   DW_AT_type        : <0x257>
    <112a>   DW_AT_data_member_location: 40
 <2><112b>: Abbrev Number: 0
 <1><112c>: Abbrev Number: 4 (DW_TAG_typedef)
    <112d>   DW_AT_name        : (indirect string, offset: 0x1d76a): SPI_InitTypeDef
    <1131>   DW_AT_decl_file   : 14
    <1132>   DW_AT_decl_line   : 84
    <1133>   DW_AT_decl_column : 3
    <1134>   DW_AT_type        : <0x1094>
 <1><1138>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <1139>   DW_AT_encoding    : 7	(unsigned)
    <113a>   DW_AT_byte_size   : 1
    <113b>   DW_AT_type        : <0x1de>
    <113f>   DW_AT_decl_file   : 14
    <1140>   DW_AT_decl_line   : 90
    <1141>   DW_AT_decl_column : 1
    <1142>   DW_AT_sibling     : <0x1177>
 <2><1146>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1147>   DW_AT_name        : (indirect string, offset: 0x67e73): HAL_SPI_STATE_RESET
    <114b>   DW_AT_const_value : 0
 <2><114c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <114d>   DW_AT_name        : (indirect string, offset: 0x1e725): HAL_SPI_STATE_READY
    <1151>   DW_AT_const_value : 1
 <2><1152>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1153>   DW_AT_name        : (indirect string, offset: 0x863b2): HAL_SPI_STATE_BUSY
    <1157>   DW_AT_const_value : 2
 <2><1158>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1159>   DW_AT_name        : (indirect string, offset: 0x5625b): HAL_SPI_STATE_BUSY_TX
    <115d>   DW_AT_const_value : 3
 <2><115e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <115f>   DW_AT_name        : (indirect string, offset: 0x55473): HAL_SPI_STATE_BUSY_RX
    <1163>   DW_AT_const_value : 4
 <2><1164>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1165>   DW_AT_name        : (indirect string, offset: 0x40a55): HAL_SPI_STATE_BUSY_TX_RX
    <1169>   DW_AT_const_value : 5
 <2><116a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <116b>   DW_AT_name        : (indirect string, offset: 0x7b03d): HAL_SPI_STATE_ERROR
    <116f>   DW_AT_const_value : 6
 <2><1170>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1171>   DW_AT_name        : (indirect string, offset: 0x16df6): HAL_SPI_STATE_ABORT
    <1175>   DW_AT_const_value : 7
 <2><1176>: Abbrev Number: 0
 <1><1177>: Abbrev Number: 4 (DW_TAG_typedef)
    <1178>   DW_AT_name        : (indirect string, offset: 0x8fb57): HAL_SPI_StateTypeDef
    <117c>   DW_AT_decl_file   : 14
    <117d>   DW_AT_decl_line   : 99
    <117e>   DW_AT_decl_column : 3
    <117f>   DW_AT_type        : <0x1138>
 <1><1183>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <1184>   DW_AT_type        : <0x1177>
 <1><1188>: Abbrev Number: 31 (DW_TAG_structure_type)
    <1189>   DW_AT_name        : (indirect string, offset: 0x8d973): __SPI_HandleTypeDef
    <118d>   DW_AT_byte_size   : 88
    <118e>   DW_AT_decl_file   : 14
    <118f>   DW_AT_decl_line   : 104
    <1190>   DW_AT_decl_column : 16
    <1190>   DW_AT_sibling     : <0x1258>
 <2><1194>: Abbrev Number: 2 (DW_TAG_member)
    <1195>   DW_AT_name        : (indirect string, offset: 0x3ce8c): Instance
    <1199>   DW_AT_decl_file   : 14
    <119a>   DW_AT_decl_line   : 106
    <119b>   DW_AT_decl_column : 31
    <119c>   DW_AT_type        : <0x1258>
    <11a0>   DW_AT_data_member_location: 0
 <2><11a1>: Abbrev Number: 2 (DW_TAG_member)
    <11a2>   DW_AT_name        : (indirect string, offset: 0x8174c): Init
    <11a6>   DW_AT_decl_file   : 14
    <11a7>   DW_AT_decl_line   : 108
    <11a8>   DW_AT_decl_column : 30
    <11a9>   DW_AT_type        : <0x112c>
    <11ad>   DW_AT_data_member_location: 4
 <2><11ae>: Abbrev Number: 2 (DW_TAG_member)
    <11af>   DW_AT_name        : (indirect string, offset: 0x4b3f6): pTxBuffPtr
    <11b3>   DW_AT_decl_file   : 14
    <11b4>   DW_AT_decl_line   : 110
    <11b5>   DW_AT_decl_column : 31
    <11b6>   DW_AT_type        : <0x125d>
    <11ba>   DW_AT_data_member_location: 48
 <2><11bb>: Abbrev Number: 2 (DW_TAG_member)
    <11bc>   DW_AT_name        : (indirect string, offset: 0x4a62): TxXferSize
    <11c0>   DW_AT_decl_file   : 14
    <11c1>   DW_AT_decl_line   : 112
    <11c2>   DW_AT_decl_column : 30
    <11c3>   DW_AT_type        : <0x246>
    <11c7>   DW_AT_data_member_location: 52
 <2><11c8>: Abbrev Number: 2 (DW_TAG_member)
    <11c9>   DW_AT_name        : (indirect string, offset: 0xa3aed): TxXferCount
    <11cd>   DW_AT_decl_file   : 14
    <11ce>   DW_AT_decl_line   : 114
    <11cf>   DW_AT_decl_column : 30
    <11d0>   DW_AT_type        : <0x252>
    <11d4>   DW_AT_data_member_location: 54
 <2><11d5>: Abbrev Number: 2 (DW_TAG_member)
    <11d6>   DW_AT_name        : (indirect string, offset: 0x936aa): pRxBuffPtr
    <11da>   DW_AT_decl_file   : 14
    <11db>   DW_AT_decl_line   : 116
    <11dc>   DW_AT_decl_column : 31
    <11dd>   DW_AT_type        : <0x1083>
    <11e1>   DW_AT_data_member_location: 56
 <2><11e2>: Abbrev Number: 2 (DW_TAG_member)
    <11e3>   DW_AT_name        : (indirect string, offset: 0x4e85e): RxXferSize
    <11e7>   DW_AT_decl_file   : 14
    <11e8>   DW_AT_decl_line   : 118
    <11e9>   DW_AT_decl_column : 30
    <11ea>   DW_AT_type        : <0x246>
    <11ee>   DW_AT_data_member_location: 60
 <2><11ef>: Abbrev Number: 2 (DW_TAG_member)
    <11f0>   DW_AT_name        : (indirect string, offset: 0x5eac4): RxXferCount
