Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x1ed0 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 37 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x9e163): GNU C11 13.3.1 20240614 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x8f798): ../Core/Src/main.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0xad65): C:/Users/rguilletlhomat/STM32CubeIDE/workspace_1.17.0/Remote_STM32F411CEU6/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_byte_size   : 1
    <2d>   DW_AT_type        : <0x1bf>
    <31>   DW_AT_decl_file   : 3
    <32>   DW_AT_decl_line   : 66
    <33>   DW_AT_decl_column : 1
    <34>   DW_AT_sibling     : <0x1bf>
 <2><38>: Abbrev Number: 10 (DW_TAG_enumerator)
    <39>   DW_AT_name        : (indirect string, offset: 0x8efaa): NonMaskableInt_IRQn
    <3d>   DW_AT_const_value : -14
 <2><3e>: Abbrev Number: 10 (DW_TAG_enumerator)

 <2><1ac>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1ad>   DW_AT_name        : (indirect string, offset: 0xc278): FPU_IRQn
    <1b1>   DW_AT_const_value : 81
 <2><1b2>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1b3>   DW_AT_name        : (indirect string, offset: 0x4367e): SPI4_IRQn
    <1b7>   DW_AT_const_value : 84
 <2><1b8>: Abbrev Number: 2 (DW_TAG_enumerator)
    <1b9>   DW_AT_name        : (indirect string, offset: 0x8e757): SPI5_IRQn
    <1bd>   DW_AT_const_value : 85
 <2><1be>: Abbrev Number: 0
 <1><1bf>: Abbrev Number: 15 (DW_TAG_base_type)
    <1c0>   DW_AT_byte_size   : 1
    <1c1>   DW_AT_encoding    : 6	(signed char)
    <1c2>   DW_AT_name        : (indirect string, offset: 0x4fcc0): signed char
 <1><1c6>: Abbrev Number: 4 (DW_TAG_typedef)
    <1c7>   DW_AT_name        : (indirect string, offset: 0x8c951): IRQn_Type
    <1cb>   DW_AT_decl_file   : 3
    <1cc>   DW_AT_decl_line   : 134
    <1cd>   DW_AT_decl_column : 3
    <1ce>   DW_AT_type        : <0x2a>
 <1><1d2>: Abbrev Number: 4 (DW_TAG_typedef)
    <1d3>   DW_AT_name        : (indirect string, offset: 0x2da91): __uint8_t
    <1d7>   DW_AT_decl_file   : 4
    <1d8>   DW_AT_decl_line   : 43
    <1d9>   DW_AT_decl_column : 24
    <1da>   DW_AT_type        : <0x1de>
 <1><1de>: Abbrev Number: 15 (DW_TAG_base_type)
    <1df>   DW_AT_byte_size   : 1
    <1e0>   DW_AT_encoding    : 8	(unsigned char)
    <1e1>   DW_AT_name        : (indirect string, offset: 0x20188): unsigned char
 <1><1e5>: Abbrev Number: 15 (DW_TAG_base_type)
    <1e6>   DW_AT_byte_size   : 2
    <1e7>   DW_AT_encoding    : 5	(signed)
    <1e8>   DW_AT_name        : (indirect string, offset: 0x77c57): short int
 <1><1ec>: Abbrev Number: 4 (DW_TAG_typedef)
    <1ed>   DW_AT_name        : (indirect string, offset: 0x835f1): __uint16_t
    <1f1>   DW_AT_decl_file   : 4
    <1f2>   DW_AT_decl_line   : 57
    <1f3>   DW_AT_decl_column : 25
    <1f4>   DW_AT_type        : <0x1f8>
 <1><1f8>: Abbrev Number: 15 (DW_TAG_base_type)
    <1f9>   DW_AT_byte_size   : 2
    <1fa>   DW_AT_encoding    : 7	(unsigned)
    <1fb>   DW_AT_name        : (indirect string, offset: 0x99edc): short unsigned int
 <1><1ff>: Abbrev Number: 15 (DW_TAG_base_type)
    <200>   DW_AT_byte_size   : 4
    <201>   DW_AT_encoding    : 5	(signed)
    <202>   DW_AT_name        : (indirect string, offset: 0xd415): long int
 <1><206>: Abbrev Number: 4 (DW_TAG_typedef)
    <207>   DW_AT_name        : (indirect string, offset: 0x658bc): __uint32_t
    <20b>   DW_AT_decl_file   : 4
    <20c>   DW_AT_decl_line   : 79
    <20d>   DW_AT_decl_column : 25
    <20e>   DW_AT_type        : <0x212>
 <1><212>: Abbrev Number: 15 (DW_TAG_base_type)
    <213>   DW_AT_byte_size   : 4
    <214>   DW_AT_encoding    : 7	(unsigned)
    <215>   DW_AT_name        : (indirect string, offset: 0x30996): long unsigned int
 <1><219>: Abbrev Number: 15 (DW_TAG_base_type)
    <21a>   DW_AT_byte_size   : 8
    <21b>   DW_AT_encoding    : 5	(signed)
    <21c>   DW_AT_name        : (indirect string, offset: 0x47fcd): long long int
 <1><220>: Abbrev Number: 15 (DW_TAG_base_type)
    <221>   DW_AT_byte_size   : 8
    <222>   DW_AT_encoding    : 7	(unsigned)
    <223>   DW_AT_name        : (indirect string, offset: 0x20cb5): long long unsigned int
 <1><227>: Abbrev Number: 38 (DW_TAG_base_type)
    <228>   DW_AT_byte_size   : 4
    <229>   DW_AT_encoding    : 5	(signed)
    <22a>   DW_AT_name        : int
 <1><22e>: Abbrev Number: 15 (DW_TAG_base_type)
    <22f>   DW_AT_byte_size   : 4
    <230>   DW_AT_encoding    : 7	(unsigned)
    <231>   DW_AT_name        : (indirect string, offset: 0xcdd2): unsigned int
 <1><235>: Abbrev Number: 4 (DW_TAG_typedef)
    <236>   DW_AT_name        : (indirect string, offset: 0x2da93): uint8_t
    <23a>   DW_AT_decl_file   : 5
    <23b>   DW_AT_decl_line   : 24
    <23c>   DW_AT_decl_column : 19
    <23d>   DW_AT_type        : <0x1d2>
 <1><241>: Abbrev Number: 21 (DW_TAG_const_type)
    <242>   DW_AT_type        : <0x235>
 <1><246>: Abbrev Number: 4 (DW_TAG_typedef)
    <247>   DW_AT_name        : (indirect string, offset: 0x75049): uint16_t
    <24b>   DW_AT_decl_file   : 5
    <24c>   DW_AT_decl_line   : 36
    <24d>   DW_AT_decl_column : 20
    <24e>   DW_AT_type        : <0x1ec>
 <1><252>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <253>   DW_AT_type        : <0x246>
 <1><257>: Abbrev Number: 4 (DW_TAG_typedef)
    <258>   DW_AT_name        : (indirect string, offset: 0x74764): uint32_t
    <25c>   DW_AT_decl_file   : 5
    <25d>   DW_AT_decl_line   : 48
    <25e>   DW_AT_decl_column : 20
    <25f>   DW_AT_type        : <0x206>
 <1><263>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <264>   DW_AT_type        : <0x257>
 <1><268>: Abbrev Number: 19 (DW_TAG_array_type)
    <269>   DW_AT_type        : <0x257>
    <26d>   DW_AT_sibling     : <0x278>
 <2><271>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <272>   DW_AT_type        : <0x22e>
    <276>   DW_AT_upper_bound : 0
 <2><277>: Abbrev Number: 0
 <1><278>: Abbrev Number: 19 (DW_TAG_array_type)
    <279>   DW_AT_type        : <0x257>
    <27d>   DW_AT_sibling     : <0x288>
 <2><281>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <282>   DW_AT_type        : <0x22e>
    <286>   DW_AT_upper_bound : 5
 <2><287>: Abbrev Number: 0
 <1><288>: Abbrev Number: 19 (DW_TAG_array_type)
    <289>   DW_AT_type        : <0x257>
    <28d>   DW_AT_sibling     : <0x298>
 <2><291>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <292>   DW_AT_type        : <0x22e>
    <296>   DW_AT_upper_bound : 1
 <2><297>: Abbrev Number: 0
 <1><298>: Abbrev Number: 9 (DW_TAG_structure_type)
    <299>   DW_AT_byte_size   : 80
    <29a>   DW_AT_decl_file   : 3
    <29b>   DW_AT_decl_line   : 152
    <29c>   DW_AT_decl_column : 9
    <29c>   DW_AT_sibling     : <0x3a3>
 <2><2a0>: Abbrev Number: 13 (DW_TAG_member)
    <2a1>   DW_AT_name        : SR
    <2a4>   DW_AT_decl_file   : 3
    <2a5>   DW_AT_decl_line   : 154
    <2a6>   DW_AT_decl_column : 17
    <2a7>   DW_AT_type        : <0x263>
    <2ab>   DW_AT_data_member_location: 0
 <2><2ac>: Abbrev Number: 13 (DW_TAG_member)
    <2ad>   DW_AT_name        : CR1
    <2b1>   DW_AT_decl_file   : 3
    <2b2>   DW_AT_decl_line   : 155
    <2b3>   DW_AT_decl_column : 17
    <2b4>   DW_AT_type        : <0x263>
    <2b8>   DW_AT_data_member_location: 4
 <2><2b9>: Abbrev Number: 13 (DW_TAG_member)
    <2ba>   DW_AT_name        : CR2
    <2be>   DW_AT_decl_file   : 3
    <2bf>   DW_AT_decl_line   : 156
    <2c0>   DW_AT_decl_column : 17
    <2c1>   DW_AT_type        : <0x263>
    <2c5>   DW_AT_data_member_location: 8
 <2><2c6>: Abbrev Number: 1 (DW_TAG_member)
    <2c7>   DW_AT_name        : (indirect string, offset: 0x90889): SMPR1
    <2cb>   DW_AT_decl_file   : 3
    <2cc>   DW_AT_decl_line   : 157
    <2cd>   DW_AT_decl_column : 17
    <2ce>   DW_AT_type        : <0x263>
    <2d2>   DW_AT_data_member_location: 12
 <2><2d3>: Abbrev Number: 1 (DW_TAG_member)
    <2d4>   DW_AT_name        : (indirect string, offset: 0x38613): SMPR2
    <2d8>   DW_AT_decl_file   : 3
    <2d9>   DW_AT_decl_line   : 158
    <2da>   DW_AT_decl_column : 17
    <2db>   DW_AT_type        : <0x263>
    <2df>   DW_AT_data_member_location: 16
 <2><2e0>: Abbrev Number: 1 (DW_TAG_member)
    <2e1>   DW_AT_name        : (indirect string, offset: 0x36675): JOFR1
    <2e5>   DW_AT_decl_file   : 3
    <2e6>   DW_AT_decl_line   : 159
    <2e7>   DW_AT_decl_column : 17
    <2e8>   DW_AT_type        : <0x263>
    <2ec>   DW_AT_data_member_location: 20
 <2><2ed>: Abbrev Number: 1 (DW_TAG_member)
    <2ee>   DW_AT_name        : (indirect string, offset: 0x3667b): JOFR2
    <2f2>   DW_AT_decl_file   : 3
    <2f3>   DW_AT_decl_line   : 160
    <2f4>   DW_AT_decl_column : 17
    <2f5>   DW_AT_type        : <0x263>
    <2f9>   DW_AT_data_member_location: 24
 <2><2fa>: Abbrev Number: 1 (DW_TAG_member)
    <2fb>   DW_AT_name        : (indirect string, offset: 0x36681): JOFR3
    <2ff>   DW_AT_decl_file   : 3
    <300>   DW_AT_decl_line   : 161
    <301>   DW_AT_decl_column : 17
    <302>   DW_AT_type        : <0x263>
    <306>   DW_AT_data_member_location: 28
 <2><307>: Abbrev Number: 1 (DW_TAG_member)
    <308>   DW_AT_name        : (indirect string, offset: 0x36687): JOFR4
    <30c>   DW_AT_decl_file   : 3
    <30d>   DW_AT_decl_line   : 162
    <30e>   DW_AT_decl_column : 17
    <30f>   DW_AT_type        : <0x263>
    <313>   DW_AT_data_member_location: 32
 <2><314>: Abbrev Number: 13 (DW_TAG_member)
    <315>   DW_AT_name        : HTR
    <319>   DW_AT_decl_file   : 3
    <31a>   DW_AT_decl_line   : 163
    <31b>   DW_AT_decl_column : 17
    <31c>   DW_AT_type        : <0x263>
    <320>   DW_AT_data_member_location: 36
 <2><321>: Abbrev Number: 13 (DW_TAG_member)
    <322>   DW_AT_name        : LTR
    <326>   DW_AT_decl_file   : 3
    <327>   DW_AT_decl_line   : 164
    <328>   DW_AT_decl_column : 17
    <329>   DW_AT_type        : <0x263>
    <32d>   DW_AT_data_member_location: 40
 <2><32e>: Abbrev Number: 1 (DW_TAG_member)
    <32f>   DW_AT_name        : (indirect string, offset: 0xd4e0): SQR1
    <333>   DW_AT_decl_file   : 3
    <334>   DW_AT_decl_line   : 165
    <335>   DW_AT_decl_column : 17
    <336>   DW_AT_type        : <0x263>
    <33a>   DW_AT_data_member_location: 44
 <2><33b>: Abbrev Number: 1 (DW_TAG_member)
    <33c>   DW_AT_name        : (indirect string, offset: 0xbf65): SQR2
    <340>   DW_AT_decl_file   : 3
    <341>   DW_AT_decl_line   : 166
    <342>   DW_AT_decl_column : 17
    <343>   DW_AT_type        : <0x263>
    <347>   DW_AT_data_member_location: 48
 <2><348>: Abbrev Number: 1 (DW_TAG_member)
    <349>   DW_AT_name        : (indirect string, offset: 0xbf6a): SQR3
    <34d>   DW_AT_decl_file   : 3
    <34e>   DW_AT_decl_line   : 167
    <34f>   DW_AT_decl_column : 17
    <350>   DW_AT_type        : <0x263>
    <354>   DW_AT_data_member_location: 52
 <2><355>: Abbrev Number: 1 (DW_TAG_member)
    <356>   DW_AT_name        : (indirect string, offset: 0x7b5fd): JSQR
    <35a>   DW_AT_decl_file   : 3
    <35b>   DW_AT_decl_line   : 168
    <35c>   DW_AT_decl_column : 17
    <35d>   DW_AT_type        : <0x263>
    <361>   DW_AT_data_member_location: 56
 <2><362>: Abbrev Number: 1 (DW_TAG_member)
    <363>   DW_AT_name        : (indirect string, offset: 0x6620b): JDR1
    <367>   DW_AT_decl_file   : 3
    <368>   DW_AT_decl_line   : 169
    <369>   DW_AT_decl_column : 17
    <36a>   DW_AT_type        : <0x263>
    <36e>   DW_AT_data_member_location: 60
 <2><36f>: Abbrev Number: 1 (DW_TAG_member)
    <370>   DW_AT_name        : (indirect string, offset: 0x66210): JDR2
    <374>   DW_AT_decl_file   : 3
    <375>   DW_AT_decl_line   : 170
    <376>   DW_AT_decl_column : 17
    <377>   DW_AT_type        : <0x263>
    <37b>   DW_AT_data_member_location: 64
 <2><37c>: Abbrev Number: 1 (DW_TAG_member)
    <37d>   DW_AT_name        : (indirect string, offset: 0x66215): JDR3
    <381>   DW_AT_decl_file   : 3
    <382>   DW_AT_decl_line   : 171
    <383>   DW_AT_decl_column : 17
    <384>   DW_AT_type        : <0x263>
    <388>   DW_AT_data_member_location: 68
 <2><389>: Abbrev Number: 1 (DW_TAG_member)
    <38a>   DW_AT_name        : (indirect string, offset: 0x29e61): JDR4
    <38e>   DW_AT_decl_file   : 3
    <38f>   DW_AT_decl_line   : 172
    <390>   DW_AT_decl_column : 17
    <391>   DW_AT_type        : <0x263>
    <395>   DW_AT_data_member_location: 72
 <2><396>: Abbrev Number: 13 (DW_TAG_member)
    <397>   DW_AT_name        : DR
    <39a>   DW_AT_decl_file   : 3
    <39b>   DW_AT_decl_line   : 173
    <39c>   DW_AT_decl_column : 17
    <39d>   DW_AT_type        : <0x263>
    <3a1>   DW_AT_data_member_location: 76
 <2><3a2>: Abbrev Number: 0
 <1><3a3>: Abbrev Number: 4 (DW_TAG_typedef)
    <3a4>   DW_AT_name        : (indirect string, offset: 0x7b4e3): ADC_TypeDef
    <3a8>   DW_AT_decl_file   : 3
    <3a9>   DW_AT_decl_line   : 174
    <3aa>   DW_AT_decl_column : 3
    <3ab>   DW_AT_type        : <0x298>
 <1><3af>: Abbrev Number: 9 (DW_TAG_structure_type)
    <3b0>   DW_AT_byte_size   : 24
    <3b1>   DW_AT_decl_file   : 3
    <3b2>   DW_AT_decl_line   : 214
    <3b3>   DW_AT_decl_column : 9
    <3b3>   DW_AT_sibling     : <0x405>
 <2><3b7>: Abbrev Number: 13 (DW_TAG_member)
    <3b8>   DW_AT_name        : CR
    <3bb>   DW_AT_decl_file   : 3
    <3bc>   DW_AT_decl_line   : 216
    <3bd>   DW_AT_decl_column : 17
    <3be>   DW_AT_type        : <0x263>
    <3c2>   DW_AT_data_member_location: 0
 <2><3c3>: Abbrev Number: 1 (DW_TAG_member)
    <3c4>   DW_AT_name        : (indirect string, offset: 0x4dcf8): NDTR
    <3c8>   DW_AT_decl_file   : 3
    <3c9>   DW_AT_decl_line   : 217
    <3ca>   DW_AT_decl_column : 17
    <3cb>   DW_AT_type        : <0x263>
    <3cf>   DW_AT_data_member_location: 4
 <2><3d0>: Abbrev Number: 13 (DW_TAG_member)
    <3d1>   DW_AT_name        : PAR
    <3d5>   DW_AT_decl_file   : 3
    <3d6>   DW_AT_decl_line   : 218
    <3d7>   DW_AT_decl_column : 17
    <3d8>   DW_AT_type        : <0x263>
    <3dc>   DW_AT_data_member_location: 8
 <2><3dd>: Abbrev Number: 1 (DW_TAG_member)
    <3de>   DW_AT_name        : (indirect string, offset: 0x41878): M0AR
    <3e2>   DW_AT_decl_file   : 3
    <3e3>   DW_AT_decl_line   : 219
    <3e4>   DW_AT_decl_column : 17
    <3e5>   DW_AT_type        : <0x263>
    <3e9>   DW_AT_data_member_location: 12
 <2><3ea>: Abbrev Number: 1 (DW_TAG_member)
    <3eb>   DW_AT_name        : (indirect string, offset: 0xea2b): M1AR
    <3ef>   DW_AT_decl_file   : 3
    <3f0>   DW_AT_decl_line   : 220
    <3f1>   DW_AT_decl_column : 17
    <3f2>   DW_AT_type        : <0x263>
    <3f6>   DW_AT_data_member_location: 16
 <2><3f7>: Abbrev Number: 13 (DW_TAG_member)
    <3f8>   DW_AT_name        : FCR
    <3fc>   DW_AT_decl_file   : 3
    <3fd>   DW_AT_decl_line   : 221
    <3fe>   DW_AT_decl_column : 17
    <3ff>   DW_AT_type        : <0x263>
    <403>   DW_AT_data_member_location: 20
 <2><404>: Abbrev Number: 0
 <1><405>: Abbrev Number: 4 (DW_TAG_typedef)
    <406>   DW_AT_name        : (indirect string, offset: 0x92250): DMA_Stream_TypeDef
    <40a>   DW_AT_decl_file   : 3
    <40b>   DW_AT_decl_line   : 222
    <40c>   DW_AT_decl_column : 3
    <40d>   DW_AT_type        : <0x3af>
 <1><411>: Abbrev Number: 17 (DW_TAG_structure_type)
    <412>   DW_AT_byte_size   : 40
    <413>   DW_AT_decl_file   : 3
    <414>   DW_AT_decl_line   : 265
    <416>   DW_AT_decl_column : 9
    <416>   DW_AT_sibling     : <0x493>
 <2><41a>: Abbrev Number: 3 (DW_TAG_member)
    <41b>   DW_AT_name        : (indirect string, offset: 0x155f): MODER
    <41f>   DW_AT_decl_file   : 3
    <420>   DW_AT_decl_line   : 267
    <422>   DW_AT_decl_column : 17
    <423>   DW_AT_type        : <0x263>
    <427>   DW_AT_data_member_location: 0
 <2><428>: Abbrev Number: 3 (DW_TAG_member)
    <429>   DW_AT_name        : (indirect string, offset: 0x7c847): OTYPER
    <42d>   DW_AT_decl_file   : 3
    <42e>   DW_AT_decl_line   : 268
    <430>   DW_AT_decl_column : 17
    <431>   DW_AT_type        : <0x263>
    <435>   DW_AT_data_member_location: 4
 <2><436>: Abbrev Number: 3 (DW_TAG_member)
    <437>   DW_AT_name        : (indirect string, offset: 0x8bf18): OSPEEDR
    <43b>   DW_AT_decl_file   : 3
    <43c>   DW_AT_decl_line   : 269
    <43e>   DW_AT_decl_column : 17
    <43f>   DW_AT_type        : <0x263>
    <443>   DW_AT_data_member_location: 8
 <2><444>: Abbrev Number: 3 (DW_TAG_member)
    <445>   DW_AT_name        : (indirect string, offset: 0x1c6e2): PUPDR
    <449>   DW_AT_decl_file   : 3
    <44a>   DW_AT_decl_line   : 270
    <44c>   DW_AT_decl_column : 17
    <44d>   DW_AT_type        : <0x263>
    <451>   DW_AT_data_member_location: 12
 <2><452>: Abbrev Number: 5 (DW_TAG_member)
    <453>   DW_AT_name        : IDR
    <457>   DW_AT_decl_file   : 3
    <457>   DW_AT_decl_line   : 271
    <459>   DW_AT_decl_column : 17
    <459>   DW_AT_type        : <0x263>
    <45d>   DW_AT_data_member_location: 16
 <2><45e>: Abbrev Number: 5 (DW_TAG_member)
    <45f>   DW_AT_name        : ODR
    <463>   DW_AT_decl_file   : 3
    <463>   DW_AT_decl_line   : 272
    <465>   DW_AT_decl_column : 17
    <465>   DW_AT_type        : <0x263>
    <469>   DW_AT_data_member_location: 20
 <2><46a>: Abbrev Number: 3 (DW_TAG_member)
    <46b>   DW_AT_name        : (indirect string, offset: 0x2380c): BSRR
    <46f>   DW_AT_decl_file   : 3
    <470>   DW_AT_decl_line   : 273
    <472>   DW_AT_decl_column : 17
    <473>   DW_AT_type        : <0x263>
    <477>   DW_AT_data_member_location: 24
 <2><478>: Abbrev Number: 3 (DW_TAG_member)
    <479>   DW_AT_name        : (indirect string, offset: 0x89e92): LCKR
    <47d>   DW_AT_decl_file   : 3
    <47e>   DW_AT_decl_line   : 274
    <480>   DW_AT_decl_column : 17
    <481>   DW_AT_type        : <0x263>
    <485>   DW_AT_data_member_location: 28
 <2><486>: Abbrev Number: 5 (DW_TAG_member)
    <487>   DW_AT_name        : AFR
    <48b>   DW_AT_decl_file   : 3
    <48b>   DW_AT_decl_line   : 275
    <48d>   DW_AT_decl_column : 17
    <48d>   DW_AT_type        : <0x4a3>
    <491>   DW_AT_data_member_location: 32
 <2><492>: Abbrev Number: 0
 <1><493>: Abbrev Number: 19 (DW_TAG_array_type)
    <494>   DW_AT_type        : <0x263>
    <498>   DW_AT_sibling     : <0x4a3>
 <2><49c>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <49d>   DW_AT_type        : <0x22e>
    <4a1>   DW_AT_upper_bound : 1
 <2><4a2>: Abbrev Number: 0
 <1><4a3>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <4a4>   DW_AT_type        : <0x493>
 <1><4a8>: Abbrev Number: 14 (DW_TAG_typedef)
    <4a9>   DW_AT_name        : (indirect string, offset: 0x9c13e): GPIO_TypeDef
    <4ad>   DW_AT_decl_file   : 3
    <4ae>   DW_AT_decl_line   : 276
    <4b0>   DW_AT_decl_column : 3
    <4b0>   DW_AT_type        : <0x411>
 <1><4b4>: Abbrev Number: 17 (DW_TAG_structure_type)
    <4b5>   DW_AT_byte_size   : 40
    <4b6>   DW_AT_decl_file   : 3
    <4b7>   DW_AT_decl_line   : 295
    <4b9>   DW_AT_decl_column : 9
    <4b9>   DW_AT_sibling     : <0x53d>
 <2><4bd>: Abbrev Number: 5 (DW_TAG_member)
    <4be>   DW_AT_name        : CR1
    <4c2>   DW_AT_decl_file   : 3
    <4c2>   DW_AT_decl_line   : 297
    <4c4>   DW_AT_decl_column : 17
    <4c4>   DW_AT_type        : <0x263>
    <4c8>   DW_AT_data_member_location: 0
 <2><4c9>: Abbrev Number: 5 (DW_TAG_member)
    <4ca>   DW_AT_name        : CR2
    <4ce>   DW_AT_decl_file   : 3
    <4ce>   DW_AT_decl_line   : 298
    <4d0>   DW_AT_decl_column : 17
    <4d0>   DW_AT_type        : <0x263>
    <4d4>   DW_AT_data_member_location: 4
 <2><4d5>: Abbrev Number: 3 (DW_TAG_member)
    <4d6>   DW_AT_name        : (indirect string, offset: 0x17791): OAR1
    <4da>   DW_AT_decl_file   : 3
    <4db>   DW_AT_decl_line   : 299
    <4dd>   DW_AT_decl_column : 17
    <4de>   DW_AT_type        : <0x263>
    <4e2>   DW_AT_data_member_location: 8
 <2><4e3>: Abbrev Number: 3 (DW_TAG_member)
    <4e4>   DW_AT_name        : (indirect string, offset: 0x17796): OAR2
    <4e8>   DW_AT_decl_file   : 3
    <4e9>   DW_AT_decl_line   : 300
    <4eb>   DW_AT_decl_column : 17
    <4ec>   DW_AT_type        : <0x263>
    <4f0>   DW_AT_data_member_location: 12
 <2><4f1>: Abbrev Number: 5 (DW_TAG_member)
    <4f2>   DW_AT_name        : DR
    <4f5>   DW_AT_decl_file   : 3
    <4f5>   DW_AT_decl_line   : 301
    <4f7>   DW_AT_decl_column : 17
    <4f7>   DW_AT_type        : <0x263>
    <4fb>   DW_AT_data_member_location: 16
 <2><4fc>: Abbrev Number: 5 (DW_TAG_member)
    <4fd>   DW_AT_name        : SR1
    <501>   DW_AT_decl_file   : 3
    <501>   DW_AT_decl_line   : 302
    <503>   DW_AT_decl_column : 17
    <503>   DW_AT_type        : <0x263>
    <507>   DW_AT_data_member_location: 20
 <2><508>: Abbrev Number: 5 (DW_TAG_member)
    <509>   DW_AT_name        : SR2
    <50d>   DW_AT_decl_file   : 3
    <50d>   DW_AT_decl_line   : 303
    <50f>   DW_AT_decl_column : 17
    <50f>   DW_AT_type        : <0x263>
    <513>   DW_AT_data_member_location: 24
 <2><514>: Abbrev Number: 5 (DW_TAG_member)
    <515>   DW_AT_name        : CCR
    <519>   DW_AT_decl_file   : 3
    <519>   DW_AT_decl_line   : 304
    <51b>   DW_AT_decl_column : 17
    <51b>   DW_AT_type        : <0x263>
    <51f>   DW_AT_data_member_location: 28
 <2><520>: Abbrev Number: 3 (DW_TAG_member)
    <521>   DW_AT_name        : (indirect string, offset: 0x51c33): TRISE
    <525>   DW_AT_decl_file   : 3
    <526>   DW_AT_decl_line   : 305
    <528>   DW_AT_decl_column : 17
    <529>   DW_AT_type        : <0x263>
    <52d>   DW_AT_data_member_location: 32
 <2><52e>: Abbrev Number: 3 (DW_TAG_member)
    <52f>   DW_AT_name        : (indirect string, offset: 0x148c): FLTR
    <533>   DW_AT_decl_file   : 3
    <534>   DW_AT_decl_line   : 306
    <536>   DW_AT_decl_column : 17
    <537>   DW_AT_type        : <0x263>
    <53b>   DW_AT_data_member_location: 36
 <2><53c>: Abbrev Number: 0
 <1><53d>: Abbrev Number: 14 (DW_TAG_typedef)
    <53e>   DW_AT_name        : (indirect string, offset: 0x7edbb): I2C_TypeDef
    <542>   DW_AT_decl_file   : 3
    <543>   DW_AT_decl_line   : 307
    <545>   DW_AT_decl_column : 3
    <545>   DW_AT_type        : <0x4b4>
 <1><549>: Abbrev Number: 17 (DW_TAG_structure_type)
    <54a>   DW_AT_byte_size   : 8
    <54b>   DW_AT_decl_file   : 3
    <54c>   DW_AT_decl_line   : 326
    <54e>   DW_AT_decl_column : 9
    <54e>   DW_AT_sibling     : <0x56a>
 <2><552>: Abbrev Number: 5 (DW_TAG_member)
    <553>   DW_AT_name        : CR
    <556>   DW_AT_decl_file   : 3
    <556>   DW_AT_decl_line   : 328
    <558>   DW_AT_decl_column : 17
    <558>   DW_AT_type        : <0x263>
    <55c>   DW_AT_data_member_location: 0
 <2><55d>: Abbrev Number: 5 (DW_TAG_member)
    <55e>   DW_AT_name        : CSR
    <562>   DW_AT_decl_file   : 3
    <562>   DW_AT_decl_line   : 329
    <564>   DW_AT_decl_column : 17
    <564>   DW_AT_type        : <0x263>
    <568>   DW_AT_data_member_location: 4
 <2><569>: Abbrev Number: 0
 <1><56a>: Abbrev Number: 14 (DW_TAG_typedef)
    <56b>   DW_AT_name        : (indirect string, offset: 0x73dd3): PWR_TypeDef
    <56f>   DW_AT_decl_file   : 3
    <570>   DW_AT_decl_line   : 330
    <572>   DW_AT_decl_column : 3
    <572>   DW_AT_type        : <0x549>
 <1><576>: Abbrev Number: 17 (DW_TAG_structure_type)
    <577>   DW_AT_byte_size   : 144
    <578>   DW_AT_decl_file   : 3
    <579>   DW_AT_decl_line   : 336
    <57b>   DW_AT_decl_column : 9
    <57b>   DW_AT_sibling     : <0x739>
 <2><57f>: Abbrev Number: 5 (DW_TAG_member)
    <580>   DW_AT_name        : CR
    <583>   DW_AT_decl_file   : 3
    <583>   DW_AT_decl_line   : 338
    <585>   DW_AT_decl_column : 17
    <585>   DW_AT_type        : <0x263>
    <589>   DW_AT_data_member_location: 0
 <2><58a>: Abbrev Number: 3 (DW_TAG_member)
    <58b>   DW_AT_name        : (indirect string, offset: 0x6fdd2): PLLCFGR
    <58f>   DW_AT_decl_file   : 3
    <590>   DW_AT_decl_line   : 339
    <592>   DW_AT_decl_column : 17
    <593>   DW_AT_type        : <0x263>
    <597>   DW_AT_data_member_location: 4
 <2><598>: Abbrev Number: 3 (DW_TAG_member)
    <599>   DW_AT_name        : (indirect string, offset: 0x44c06): CFGR
    <59d>   DW_AT_decl_file   : 3
    <59e>   DW_AT_decl_line   : 340
    <5a0>   DW_AT_decl_column : 17
    <5a1>   DW_AT_type        : <0x263>
    <5a5>   DW_AT_data_member_location: 8
 <2><5a6>: Abbrev Number: 5 (DW_TAG_member)
    <5a7>   DW_AT_name        : CIR
    <5ab>   DW_AT_decl_file   : 3
    <5ab>   DW_AT_decl_line   : 341
    <5ad>   DW_AT_decl_column : 17
    <5ad>   DW_AT_type        : <0x263>
    <5b1>   DW_AT_data_member_location: 12
 <2><5b2>: Abbrev Number: 3 (DW_TAG_member)
    <5b3>   DW_AT_name        : (indirect string, offset: 0x8048b): AHB1RSTR
    <5b7>   DW_AT_decl_file   : 3
    <5b8>   DW_AT_decl_line   : 342
    <5ba>   DW_AT_decl_column : 17
    <5bb>   DW_AT_type        : <0x263>
    <5bf>   DW_AT_data_member_location: 16
 <2><5c0>: Abbrev Number: 3 (DW_TAG_member)
    <5c1>   DW_AT_name        : (indirect string, offset: 0x11ebc): AHB2RSTR
    <5c5>   DW_AT_decl_file   : 3
    <5c6>   DW_AT_decl_line   : 343
    <5c8>   DW_AT_decl_column : 17
    <5c9>   DW_AT_type        : <0x263>
    <5cd>   DW_AT_data_member_location: 20
 <2><5ce>: Abbrev Number: 3 (DW_TAG_member)
    <5cf>   DW_AT_name        : (indirect string, offset: 0x44aa9): AHB3RSTR
    <5d3>   DW_AT_decl_file   : 3
    <5d4>   DW_AT_decl_line   : 344
    <5d6>   DW_AT_decl_column : 17
    <5d7>   DW_AT_type        : <0x263>
    <5db>   DW_AT_data_member_location: 24
 <2><5dc>: Abbrev Number: 3 (DW_TAG_member)
    <5dd>   DW_AT_name        : (indirect string, offset: 0x97a92): RESERVED0
    <5e1>   DW_AT_decl_file   : 3
    <5e2>   DW_AT_decl_line   : 345
    <5e4>   DW_AT_decl_column : 17
    <5e5>   DW_AT_type        : <0x257>
    <5e9>   DW_AT_data_member_location: 28
 <2><5ea>: Abbrev Number: 3 (DW_TAG_member)
    <5eb>   DW_AT_name        : (indirect string, offset: 0x11a2d): APB1RSTR
    <5ef>   DW_AT_decl_file   : 3
    <5f0>   DW_AT_decl_line   : 346
    <5f2>   DW_AT_decl_column : 17
    <5f3>   DW_AT_type        : <0x263>
    <5f7>   DW_AT_data_member_location: 32
 <2><5f8>: Abbrev Number: 3 (DW_TAG_member)
    <5f9>   DW_AT_name        : (indirect string, offset: 0x44572): APB2RSTR
    <5fd>   DW_AT_decl_file   : 3
    <5fe>   DW_AT_decl_line   : 347
    <600>   DW_AT_decl_column : 17
    <601>   DW_AT_type        : <0x263>
    <605>   DW_AT_data_member_location: 36
 <2><606>: Abbrev Number: 3 (DW_TAG_member)
    <607>   DW_AT_name        : (indirect string, offset: 0x97a9c): RESERVED1
    <60b>   DW_AT_decl_file   : 3
    <60c>   DW_AT_decl_line   : 348
    <60e>   DW_AT_decl_column : 17
    <60f>   DW_AT_type        : <0x288>
    <613>   DW_AT_data_member_location: 40
 <2><614>: Abbrev Number: 3 (DW_TAG_member)
    <615>   DW_AT_name        : (indirect string, offset: 0xcd67): AHB1ENR
    <619>   DW_AT_decl_file   : 3
    <61a>   DW_AT_decl_line   : 349
    <61c>   DW_AT_decl_column : 17
    <61d>   DW_AT_type        : <0x263>
    <621>   DW_AT_data_member_location: 48
 <2><622>: Abbrev Number: 3 (DW_TAG_member)
    <623>   DW_AT_name        : (indirect string, offset: 0x29d79): AHB2ENR
    <627>   DW_AT_decl_file   : 3
    <628>   DW_AT_decl_line   : 350
    <62a>   DW_AT_decl_column : 17
    <62b>   DW_AT_type        : <0x263>
    <62f>   DW_AT_data_member_location: 52
 <2><630>: Abbrev Number: 3 (DW_TAG_member)
    <631>   DW_AT_name        : (indirect string, offset: 0x46d46): AHB3ENR
    <635>   DW_AT_decl_file   : 3
    <636>   DW_AT_decl_line   : 351
    <638>   DW_AT_decl_column : 17
    <639>   DW_AT_type        : <0x263>
    <63d>   DW_AT_data_member_location: 56
 <2><63e>: Abbrev Number: 3 (DW_TAG_member)
    <63f>   DW_AT_name        : (indirect string, offset: 0x97aa6): RESERVED2
    <643>   DW_AT_decl_file   : 3
    <644>   DW_AT_decl_line   : 352
    <646>   DW_AT_decl_column : 17
    <647>   DW_AT_type        : <0x257>
    <64b>   DW_AT_data_member_location: 60
 <2><64c>: Abbrev Number: 3 (DW_TAG_member)
    <64d>   DW_AT_name        : (indirect string, offset: 0x79028): APB1ENR
    <651>   DW_AT_decl_file   : 3
    <652>   DW_AT_decl_line   : 353
    <654>   DW_AT_decl_column : 17
    <655>   DW_AT_type        : <0x263>
    <659>   DW_AT_data_member_location: 64
 <2><65a>: Abbrev Number: 3 (DW_TAG_member)
    <65b>   DW_AT_name        : (indirect string, offset: 0x1274f): APB2ENR
    <65f>   DW_AT_decl_file   : 3
    <660>   DW_AT_decl_line   : 354
    <662>   DW_AT_decl_column : 17
    <663>   DW_AT_type        : <0x263>
    <667>   DW_AT_data_member_location: 68
 <2><668>: Abbrev Number: 3 (DW_TAG_member)
    <669>   DW_AT_name        : (indirect string, offset: 0x97ab0): RESERVED3
    <66d>   DW_AT_decl_file   : 3
    <66e>   DW_AT_decl_line   : 355
    <670>   DW_AT_decl_column : 17
    <671>   DW_AT_type        : <0x288>
    <675>   DW_AT_data_member_location: 72
 <2><676>: Abbrev Number: 3 (DW_TAG_member)
    <677>   DW_AT_name        : (indirect string, offset: 0x4eeaf): AHB1LPENR
    <67b>   DW_AT_decl_file   : 3
    <67c>   DW_AT_decl_line   : 356
    <67e>   DW_AT_decl_column : 17
    <67f>   DW_AT_type        : <0x263>
    <683>   DW_AT_data_member_location: 80
 <2><684>: Abbrev Number: 3 (DW_TAG_member)
    <685>   DW_AT_name        : (indirect string, offset: 0x233ee): AHB2LPENR
    <689>   DW_AT_decl_file   : 3
    <68a>   DW_AT_decl_line   : 357
    <68c>   DW_AT_decl_column : 17
    <68d>   DW_AT_type        : <0x263>
    <691>   DW_AT_data_member_location: 84
 <2><692>: Abbrev Number: 3 (DW_TAG_member)
    <693>   DW_AT_name        : (indirect string, offset: 0x6b861): AHB3LPENR
    <697>   DW_AT_decl_file   : 3
    <698>   DW_AT_decl_line   : 358
    <69a>   DW_AT_decl_column : 17
    <69b>   DW_AT_type        : <0x263>
    <69f>   DW_AT_data_member_location: 88
 <2><6a0>: Abbrev Number: 3 (DW_TAG_member)
    <6a1>   DW_AT_name        : (indirect string, offset: 0x97aba): RESERVED4
    <6a5>   DW_AT_decl_file   : 3
    <6a6>   DW_AT_decl_line   : 359
    <6a8>   DW_AT_decl_column : 17
    <6a9>   DW_AT_type        : <0x257>
    <6ad>   DW_AT_data_member_location: 92
 <2><6ae>: Abbrev Number: 3 (DW_TAG_member)
    <6af>   DW_AT_name        : (indirect string, offset: 0x69e7c): APB1LPENR
    <6b3>   DW_AT_decl_file   : 3
    <6b4>   DW_AT_decl_line   : 360
    <6b6>   DW_AT_decl_column : 17
    <6b7>   DW_AT_type        : <0x263>
    <6bb>   DW_AT_data_member_location: 96
 <2><6bc>: Abbrev Number: 3 (DW_TAG_member)
    <6bd>   DW_AT_name        : (indirect string, offset: 0xbe3d): APB2LPENR
    <6c1>   DW_AT_decl_file   : 3
    <6c2>   DW_AT_decl_line   : 361
    <6c4>   DW_AT_decl_column : 17
    <6c5>   DW_AT_type        : <0x263>
    <6c9>   DW_AT_data_member_location: 100
 <2><6ca>: Abbrev Number: 3 (DW_TAG_member)
    <6cb>   DW_AT_name        : (indirect string, offset: 0x97ac4): RESERVED5
    <6cf>   DW_AT_decl_file   : 3
    <6d0>   DW_AT_decl_line   : 362
    <6d2>   DW_AT_decl_column : 17
    <6d3>   DW_AT_type        : <0x288>
    <6d7>   DW_AT_data_member_location: 104
 <2><6d8>: Abbrev Number: 3 (DW_TAG_member)
    <6d9>   DW_AT_name        : (indirect string, offset: 0x16034): BDCR
    <6dd>   DW_AT_decl_file   : 3
    <6de>   DW_AT_decl_line   : 363
    <6e0>   DW_AT_decl_column : 17
    <6e1>   DW_AT_type        : <0x263>
    <6e5>   DW_AT_data_member_location: 112
 <2><6e6>: Abbrev Number: 5 (DW_TAG_member)
    <6e7>   DW_AT_name        : CSR
    <6eb>   DW_AT_decl_file   : 3
    <6eb>   DW_AT_decl_line   : 364
    <6ed>   DW_AT_decl_column : 17
    <6ed>   DW_AT_type        : <0x263>
    <6f1>   DW_AT_data_member_location: 116
 <2><6f2>: Abbrev Number: 3 (DW_TAG_member)
    <6f3>   DW_AT_name        : (indirect string, offset: 0x97ace): RESERVED6
    <6f7>   DW_AT_decl_file   : 3
    <6f8>   DW_AT_decl_line   : 365
    <6fa>   DW_AT_decl_column : 17
    <6fb>   DW_AT_type        : <0x288>
    <6ff>   DW_AT_data_member_location: 120
 <2><700>: Abbrev Number: 3 (DW_TAG_member)
    <701>   DW_AT_name        : (indirect string, offset: 0x54580): SSCGR
    <705>   DW_AT_decl_file   : 3
    <706>   DW_AT_decl_line   : 366
    <708>   DW_AT_decl_column : 17
    <709>   DW_AT_type        : <0x263>
    <70d>   DW_AT_data_member_location: 128
 <2><70e>: Abbrev Number: 3 (DW_TAG_member)
    <70f>   DW_AT_name        : (indirect string, offset: 0x34163): PLLI2SCFGR
    <713>   DW_AT_decl_file   : 3
    <714>   DW_AT_decl_line   : 367
    <716>   DW_AT_decl_column : 17
    <717>   DW_AT_type        : <0x263>
    <71b>   DW_AT_data_member_location: 132
 <2><71c>: Abbrev Number: 3 (DW_TAG_member)
    <71d>   DW_AT_name        : (indirect string, offset: 0x97ad8): RESERVED7
    <721>   DW_AT_decl_file   : 3
    <722>   DW_AT_decl_line   : 368
    <724>   DW_AT_decl_column : 17
    <725>   DW_AT_type        : <0x268>
    <729>   DW_AT_data_member_location: 136
 <2><72a>: Abbrev Number: 3 (DW_TAG_member)
    <72b>   DW_AT_name        : (indirect string, offset: 0x44c03): DCKCFGR
    <72f>   DW_AT_decl_file   : 3
    <730>   DW_AT_decl_line   : 369
    <732>   DW_AT_decl_column : 17
    <733>   DW_AT_type        : <0x263>
    <737>   DW_AT_data_member_location: 140
 <2><738>: Abbrev Number: 0
 <1><739>: Abbrev Number: 14 (DW_TAG_typedef)
    <73a>   DW_AT_name        : (indirect string, offset: 0x49497): RCC_TypeDef
    <73e>   DW_AT_decl_file   : 3
    <73f>   DW_AT_decl_line   : 370
    <741>   DW_AT_decl_column : 3
    <741>   DW_AT_type        : <0x576>
 <1><745>: Abbrev Number: 17 (DW_TAG_structure_type)
    <746>   DW_AT_byte_size   : 36
    <747>   DW_AT_decl_file   : 3
    <748>   DW_AT_decl_line   : 452
    <74a>   DW_AT_decl_column : 9
    <74a>   DW_AT_sibling     : <0x7c3>
 <2><74e>: Abbrev Number: 5 (DW_TAG_member)
    <74f>   DW_AT_name        : CR1
    <753>   DW_AT_decl_file   : 3
    <753>   DW_AT_decl_line   : 454
    <755>   DW_AT_decl_column : 17
    <755>   DW_AT_type        : <0x263>
    <759>   DW_AT_data_member_location: 0
 <2><75a>: Abbrev Number: 5 (DW_TAG_member)
    <75b>   DW_AT_name        : CR2
    <75f>   DW_AT_decl_file   : 3
    <75f>   DW_AT_decl_line   : 455
    <761>   DW_AT_decl_column : 17
    <761>   DW_AT_type        : <0x263>
    <765>   DW_AT_data_member_location: 4
 <2><766>: Abbrev Number: 5 (DW_TAG_member)
    <767>   DW_AT_name        : SR
    <76a>   DW_AT_decl_file   : 3
    <76a>   DW_AT_decl_line   : 456
    <76c>   DW_AT_decl_column : 17
    <76c>   DW_AT_type        : <0x263>
    <770>   DW_AT_data_member_location: 8
 <2><771>: Abbrev Number: 5 (DW_TAG_member)
    <772>   DW_AT_name        : DR
    <775>   DW_AT_decl_file   : 3
    <775>   DW_AT_decl_line   : 457
    <777>   DW_AT_decl_column : 17
    <777>   DW_AT_type        : <0x263>
    <77b>   DW_AT_data_member_location: 12
 <2><77c>: Abbrev Number: 3 (DW_TAG_member)
    <77d>   DW_AT_name        : (indirect string, offset: 0x25ea3): CRCPR
    <781>   DW_AT_decl_file   : 3
    <782>   DW_AT_decl_line   : 458
    <784>   DW_AT_decl_column : 17
    <785>   DW_AT_type        : <0x263>
    <789>   DW_AT_data_member_location: 16
 <2><78a>: Abbrev Number: 3 (DW_TAG_member)
    <78b>   DW_AT_name        : (indirect string, offset: 0x5e7f1): RXCRCR
    <78f>   DW_AT_decl_file   : 3
    <790>   DW_AT_decl_line   : 459
    <792>   DW_AT_decl_column : 17
    <793>   DW_AT_type        : <0x263>
    <797>   DW_AT_data_member_location: 20
 <2><798>: Abbrev Number: 3 (DW_TAG_member)
    <799>   DW_AT_name        : (indirect string, offset: 0x4f981): TXCRCR
    <79d>   DW_AT_decl_file   : 3
    <79e>   DW_AT_decl_line   : 460
    <7a0>   DW_AT_decl_column : 17
    <7a1>   DW_AT_type        : <0x263>
    <7a5>   DW_AT_data_member_location: 24
 <2><7a6>: Abbrev Number: 3 (DW_TAG_member)
    <7a7>   DW_AT_name        : (indirect string, offset: 0x34166): I2SCFGR
    <7ab>   DW_AT_decl_file   : 3
    <7ac>   DW_AT_decl_line   : 461
    <7ae>   DW_AT_decl_column : 17
    <7af>   DW_AT_type        : <0x263>
    <7b3>   DW_AT_data_member_location: 28
 <2><7b4>: Abbrev Number: 3 (DW_TAG_member)
    <7b5>   DW_AT_name        : (indirect string, offset: 0x37db3): I2SPR
    <7b9>   DW_AT_decl_file   : 3
    <7ba>   DW_AT_decl_line   : 462
    <7bc>   DW_AT_decl_column : 17
    <7bd>   DW_AT_type        : <0x263>
    <7c1>   DW_AT_data_member_location: 32
 <2><7c2>: Abbrev Number: 0
 <1><7c3>: Abbrev Number: 14 (DW_TAG_typedef)
    <7c4>   DW_AT_name        : (indirect string, offset: 0x249e0): SPI_TypeDef
    <7c8>   DW_AT_decl_file   : 3
    <7c9>   DW_AT_decl_line   : 463
    <7cb>   DW_AT_decl_column : 3
    <7cb>   DW_AT_type        : <0x745>
 <1><7cf>: Abbrev Number: 17 (DW_TAG_structure_type)
    <7d0>   DW_AT_byte_size   : 84
    <7d1>   DW_AT_decl_file   : 3
    <7d2>   DW_AT_decl_line   : 470
    <7d4>   DW_AT_decl_column : 9
    <7d4>   DW_AT_sibling     : <0x8e9>
 <2><7d8>: Abbrev Number: 5 (DW_TAG_member)
    <7d9>   DW_AT_name        : CR1
    <7dd>   DW_AT_decl_file   : 3
    <7dd>   DW_AT_decl_line   : 472
    <7df>   DW_AT_decl_column : 17
    <7df>   DW_AT_type        : <0x263>
    <7e3>   DW_AT_data_member_location: 0
 <2><7e4>: Abbrev Number: 5 (DW_TAG_member)
    <7e5>   DW_AT_name        : CR2
    <7e9>   DW_AT_decl_file   : 3
    <7e9>   DW_AT_decl_line   : 473
    <7eb>   DW_AT_decl_column : 17
    <7eb>   DW_AT_type        : <0x263>
    <7ef>   DW_AT_data_member_location: 4
 <2><7f0>: Abbrev Number: 3 (DW_TAG_member)
    <7f1>   DW_AT_name        : (indirect string, offset: 0x2e1db): SMCR
    <7f5>   DW_AT_decl_file   : 3
    <7f6>   DW_AT_decl_line   : 474
    <7f8>   DW_AT_decl_column : 17
    <7f9>   DW_AT_type        : <0x263>
    <7fd>   DW_AT_data_member_location: 8
 <2><7fe>: Abbrev Number: 3 (DW_TAG_member)
    <7ff>   DW_AT_name        : (indirect string, offset: 0x32d7a): DIER
    <803>   DW_AT_decl_file   : 3
    <804>   DW_AT_decl_line   : 475
    <806>   DW_AT_decl_column : 17
    <807>   DW_AT_type        : <0x263>
    <80b>   DW_AT_data_member_location: 12
 <2><80c>: Abbrev Number: 5 (DW_TAG_member)
    <80d>   DW_AT_name        : SR
    <810>   DW_AT_decl_file   : 3
    <810>   DW_AT_decl_line   : 476
    <812>   DW_AT_decl_column : 17
    <812>   DW_AT_type        : <0x263>
    <816>   DW_AT_data_member_location: 16
 <2><817>: Abbrev Number: 5 (DW_TAG_member)
    <818>   DW_AT_name        : EGR
    <81c>   DW_AT_decl_file   : 3
    <81c>   DW_AT_decl_line   : 477
    <81e>   DW_AT_decl_column : 17
    <81e>   DW_AT_type        : <0x263>
    <822>   DW_AT_data_member_location: 20
 <2><823>: Abbrev Number: 3 (DW_TAG_member)
    <824>   DW_AT_name        : (indirect string, offset: 0x92e89): CCMR1
    <828>   DW_AT_decl_file   : 3
    <829>   DW_AT_decl_line   : 478
    <82b>   DW_AT_decl_column : 17
    <82c>   DW_AT_type        : <0x263>
    <830>   DW_AT_data_member_location: 24
 <2><831>: Abbrev Number: 3 (DW_TAG_member)
    <832>   DW_AT_name        : (indirect string, offset: 0x3ef5c): CCMR2
    <836>   DW_AT_decl_file   : 3
    <837>   DW_AT_decl_line   : 479
    <839>   DW_AT_decl_column : 17
    <83a>   DW_AT_type        : <0x263>
    <83e>   DW_AT_data_member_location: 28
 <2><83f>: Abbrev Number: 3 (DW_TAG_member)
    <840>   DW_AT_name        : (indirect string, offset: 0x21071): CCER
    <844>   DW_AT_decl_file   : 3
    <845>   DW_AT_decl_line   : 480
    <847>   DW_AT_decl_column : 17
    <848>   DW_AT_type        : <0x263>
    <84c>   DW_AT_data_member_location: 32
 <2><84d>: Abbrev Number: 5 (DW_TAG_member)
    <84e>   DW_AT_name        : CNT
    <852>   DW_AT_decl_file   : 3
    <852>   DW_AT_decl_line   : 481
    <854>   DW_AT_decl_column : 17
    <854>   DW_AT_type        : <0x263>
    <858>   DW_AT_data_member_location: 36
 <2><859>: Abbrev Number: 5 (DW_TAG_member)
    <85a>   DW_AT_name        : PSC
    <85e>   DW_AT_decl_file   : 3
    <85e>   DW_AT_decl_line   : 482
    <860>   DW_AT_decl_column : 17
    <860>   DW_AT_type        : <0x263>
    <864>   DW_AT_data_member_location: 40
 <2><865>: Abbrev Number: 5 (DW_TAG_member)
    <866>   DW_AT_name        : ARR
    <86a>   DW_AT_decl_file   : 3
    <86a>   DW_AT_decl_line   : 483
    <86c>   DW_AT_decl_column : 17
    <86c>   DW_AT_type        : <0x263>
    <870>   DW_AT_data_member_location: 44
 <2><871>: Abbrev Number: 5 (DW_TAG_member)
    <872>   DW_AT_name        : RCR
    <876>   DW_AT_decl_file   : 3
    <876>   DW_AT_decl_line   : 484
    <878>   DW_AT_decl_column : 17
    <878>   DW_AT_type        : <0x263>
    <87c>   DW_AT_data_member_location: 48
 <2><87d>: Abbrev Number: 3 (DW_TAG_member)
    <87e>   DW_AT_name        : (indirect string, offset: 0x1274a): CCR1
    <882>   DW_AT_decl_file   : 3
    <883>   DW_AT_decl_line   : 485
    <885>   DW_AT_decl_column : 17
    <886>   DW_AT_type        : <0x263>
    <88a>   DW_AT_data_member_location: 52
 <2><88b>: Abbrev Number: 3 (DW_TAG_member)
    <88c>   DW_AT_name        : (indirect string, offset: 0x420df): CCR2
    <890>   DW_AT_decl_file   : 3
    <891>   DW_AT_decl_line   : 486
    <893>   DW_AT_decl_column : 17
    <894>   DW_AT_type        : <0x263>
    <898>   DW_AT_data_member_location: 56
 <2><899>: Abbrev Number: 3 (DW_TAG_member)
    <89a>   DW_AT_name        : (indirect string, offset: 0x2cfae): CCR3
    <89e>   DW_AT_decl_file   : 3
    <89f>   DW_AT_decl_line   : 487
    <8a1>   DW_AT_decl_column : 17
    <8a2>   DW_AT_type        : <0x263>
    <8a6>   DW_AT_data_member_location: 60
 <2><8a7>: Abbrev Number: 3 (DW_TAG_member)
    <8a8>   DW_AT_name        : (indirect string, offset: 0x9f69): CCR4
    <8ac>   DW_AT_decl_file   : 3
    <8ad>   DW_AT_decl_line   : 488
    <8af>   DW_AT_decl_column : 17
    <8b0>   DW_AT_type        : <0x263>
    <8b4>   DW_AT_data_member_location: 64
 <2><8b5>: Abbrev Number: 3 (DW_TAG_member)
    <8b6>   DW_AT_name        : (indirect string, offset: 0x48cf2): BDTR
    <8ba>   DW_AT_decl_file   : 3
    <8bb>   DW_AT_decl_line   : 489
    <8bd>   DW_AT_decl_column : 17
    <8be>   DW_AT_type        : <0x263>
    <8c2>   DW_AT_data_member_location: 68
 <2><8c3>: Abbrev Number: 5 (DW_TAG_member)
    <8c4>   DW_AT_name        : DCR
    <8c8>   DW_AT_decl_file   : 3
    <8c8>   DW_AT_decl_line   : 490
    <8ca>   DW_AT_decl_column : 17
    <8ca>   DW_AT_type        : <0x263>
    <8ce>   DW_AT_data_member_location: 72
 <2><8cf>: Abbrev Number: 3 (DW_TAG_member)
    <8d0>   DW_AT_name        : (indirect string, offset: 0x8a3a6): DMAR
    <8d4>   DW_AT_decl_file   : 3
    <8d5>   DW_AT_decl_line   : 491
    <8d7>   DW_AT_decl_column : 17
    <8d8>   DW_AT_type        : <0x263>
    <8dc>   DW_AT_data_member_location: 76
 <2><8dd>: Abbrev Number: 5 (DW_TAG_member)
    <8de>   DW_AT_name        : OR
    <8e1>   DW_AT_decl_file   : 3
    <8e1>   DW_AT_decl_line   : 492
    <8e3>   DW_AT_decl_column : 17
    <8e3>   DW_AT_type        : <0x263>
    <8e7>   DW_AT_data_member_location: 80
 <2><8e8>: Abbrev Number: 0
 <1><8e9>: Abbrev Number: 14 (DW_TAG_typedef)
    <8ea>   DW_AT_name        : (indirect string, offset: 0x57be): TIM_TypeDef
    <8ee>   DW_AT_decl_file   : 3
    <8ef>   DW_AT_decl_line   : 493
    <8f1>   DW_AT_decl_column : 3
    <8f1>   DW_AT_type        : <0x7cf>
 <1><8f5>: Abbrev Number: 17 (DW_TAG_structure_type)
    <8f6>   DW_AT_byte_size   : 28
    <8f7>   DW_AT_decl_file   : 3
    <8f8>   DW_AT_decl_line   : 499
    <8fa>   DW_AT_decl_column : 9
    <8fa>   DW_AT_sibling     : <0x953>
 <2><8fe>: Abbrev Number: 5 (DW_TAG_member)
    <8ff>   DW_AT_name        : SR
    <902>   DW_AT_decl_file   : 3
    <902>   DW_AT_decl_line   : 501
    <904>   DW_AT_decl_column : 17
    <904>   DW_AT_type        : <0x263>
    <908>   DW_AT_data_member_location: 0
 <2><909>: Abbrev Number: 5 (DW_TAG_member)
    <90a>   DW_AT_name        : DR
    <90d>   DW_AT_decl_file   : 3
    <90d>   DW_AT_decl_line   : 502
    <90f>   DW_AT_decl_column : 17
    <90f>   DW_AT_type        : <0x263>
    <913>   DW_AT_data_member_location: 4
 <2><914>: Abbrev Number: 5 (DW_TAG_member)
    <915>   DW_AT_name        : BRR
    <919>   DW_AT_decl_file   : 3
    <919>   DW_AT_decl_line   : 503
    <91b>   DW_AT_decl_column : 17
    <91b>   DW_AT_type        : <0x263>
    <91f>   DW_AT_data_member_location: 8
 <2><920>: Abbrev Number: 5 (DW_TAG_member)
    <921>   DW_AT_name        : CR1
    <925>   DW_AT_decl_file   : 3
    <925>   DW_AT_decl_line   : 504
    <927>   DW_AT_decl_column : 17
    <927>   DW_AT_type        : <0x263>
    <92b>   DW_AT_data_member_location: 12
 <2><92c>: Abbrev Number: 5 (DW_TAG_member)
    <92d>   DW_AT_name        : CR2
    <931>   DW_AT_decl_file   : 3
    <931>   DW_AT_decl_line   : 505
    <933>   DW_AT_decl_column : 17
    <933>   DW_AT_type        : <0x263>
    <937>   DW_AT_data_member_location: 16
 <2><938>: Abbrev Number: 5 (DW_TAG_member)
    <939>   DW_AT_name        : CR3
    <93d>   DW_AT_decl_file   : 3
    <93d>   DW_AT_decl_line   : 506
    <93f>   DW_AT_decl_column : 17
    <93f>   DW_AT_type        : <0x263>
    <943>   DW_AT_data_member_location: 20
 <2><944>: Abbrev Number: 3 (DW_TAG_member)
    <945>   DW_AT_name        : (indirect string, offset: 0x2bc5a): GTPR
    <949>   DW_AT_decl_file   : 3
    <94a>   DW_AT_decl_line   : 507
    <94c>   DW_AT_decl_column : 17
    <94d>   DW_AT_type        : <0x263>
    <951>   DW_AT_data_member_location: 24
 <2><952>: Abbrev Number: 0
 <1><953>: Abbrev Number: 14 (DW_TAG_typedef)
    <954>   DW_AT_name        : (indirect string, offset: 0x9f690): USART_TypeDef
    <958>   DW_AT_decl_file   : 3
    <959>   DW_AT_decl_line   : 508
    <95b>   DW_AT_decl_column : 3
    <95b>   DW_AT_type        : <0x8f5>
 <1><95f>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <960>   DW_AT_encoding    : 7	(unsigned)
    <961>   DW_AT_byte_size   : 1
    <962>   DW_AT_type        : <0x1de>
    <966>   DW_AT_decl_file   : 6
    <967>   DW_AT_decl_line   : 191
    <968>   DW_AT_decl_column : 1
    <969>   DW_AT_sibling     : <0x97a>
 <2><96d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <96e>   DW_AT_name        : (indirect string, offset: 0x4b425): DISABLE
    <972>   DW_AT_const_value : 0
 <2><973>: Abbrev Number: 2 (DW_TAG_enumerator)
    <974>   DW_AT_name        : (indirect string, offset: 0x9283b): ENABLE
    <978>   DW_AT_const_value : 1
 <2><979>: Abbrev Number: 0
 <1><97a>: Abbrev Number: 4 (DW_TAG_typedef)
    <97b>   DW_AT_name        : (indirect string, offset: 0x9ff6e): FunctionalState
    <97f>   DW_AT_decl_file   : 6
    <980>   DW_AT_decl_line   : 194
    <981>   DW_AT_decl_column : 3
    <982>   DW_AT_type        : <0x95f>
 <1><986>: Abbrev Number: 15 (DW_TAG_base_type)
    <987>   DW_AT_byte_size   : 8
    <988>   DW_AT_encoding    : 4	(float)
    <989>   DW_AT_name        : (indirect string, offset: 0x840c9): long double
 <1><98d>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <98e>   DW_AT_encoding    : 7	(unsigned)
    <98f>   DW_AT_byte_size   : 1
    <990>   DW_AT_type        : <0x1de>
    <994>   DW_AT_decl_file   : 7
    <995>   DW_AT_decl_line   : 39
    <996>   DW_AT_decl_column : 1
    <997>   DW_AT_sibling     : <0x9b4>
 <2><99b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <99c>   DW_AT_name        : (indirect string, offset: 0x35223): HAL_OK
    <9a0>   DW_AT_const_value : 0
 <2><9a1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <9a2>   DW_AT_name        : (indirect string, offset: 0x639bb): HAL_ERROR
    <9a6>   DW_AT_const_value : 1
 <2><9a7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <9a8>   DW_AT_name        : (indirect string, offset: 0x866ea): HAL_BUSY
    <9ac>   DW_AT_const_value : 2
 <2><9ad>: Abbrev Number: 2 (DW_TAG_enumerator)
    <9ae>   DW_AT_name        : (indirect string, offset: 0x2e0fb): HAL_TIMEOUT
    <9b2>   DW_AT_const_value : 3
 <2><9b3>: Abbrev Number: 0
 <1><9b4>: Abbrev Number: 4 (DW_TAG_typedef)
    <9b5>   DW_AT_name        : (indirect string, offset: 0x90751): HAL_StatusTypeDef
    <9b9>   DW_AT_decl_file   : 7
    <9ba>   DW_AT_decl_line   : 44
    <9bb>   DW_AT_decl_column : 3
    <9bc>   DW_AT_type        : <0x98d>
 <1><9c0>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <9c1>   DW_AT_encoding    : 7	(unsigned)
    <9c2>   DW_AT_byte_size   : 1
    <9c3>   DW_AT_type        : <0x1de>
    <9c7>   DW_AT_decl_file   : 7
    <9c8>   DW_AT_decl_line   : 50
    <9c9>   DW_AT_decl_column : 1
    <9ca>   DW_AT_sibling     : <0x9db>
 <2><9ce>: Abbrev Number: 2 (DW_TAG_enumerator)
    <9cf>   DW_AT_name        : (indirect string, offset: 0x76e7b): HAL_UNLOCKED
    <9d3>   DW_AT_const_value : 0
 <2><9d4>: Abbrev Number: 2 (DW_TAG_enumerator)
    <9d5>   DW_AT_name        : (indirect string, offset: 0xa08f7): HAL_LOCKED
    <9d9>   DW_AT_const_value : 1
 <2><9da>: Abbrev Number: 0
 <1><9db>: Abbrev Number: 4 (DW_TAG_typedef)
    <9dc>   DW_AT_name        : (indirect string, offset: 0x60e64): HAL_LockTypeDef
    <9e0>   DW_AT_decl_file   : 7
    <9e1>   DW_AT_decl_line   : 53
    <9e2>   DW_AT_decl_column : 3
    <9e3>   DW_AT_type        : <0x9c0>
 <1><9e7>: Abbrev Number: 9 (DW_TAG_structure_type)
    <9e8>   DW_AT_byte_size   : 24
    <9e9>   DW_AT_decl_file   : 8
    <9ea>   DW_AT_decl_line   : 45
    <9eb>   DW_AT_decl_column : 9
    <9eb>   DW_AT_sibling     : <0xa3e>
 <2><9ef>: Abbrev Number: 1 (DW_TAG_member)
    <9f0>   DW_AT_name        : (indirect string, offset: 0x6a9c4): PLLState
    <9f4>   DW_AT_decl_file   : 8
    <9f5>   DW_AT_decl_line   : 47
    <9f6>   DW_AT_decl_column : 12
    <9f7>   DW_AT_type        : <0x257>
    <9fb>   DW_AT_data_member_location: 0
 <2><9fc>: Abbrev Number: 1 (DW_TAG_member)
    <9fd>   DW_AT_name        : (indirect string, offset: 0x6be91): PLLSource
    <a01>   DW_AT_decl_file   : 8
    <a02>   DW_AT_decl_line   : 50
    <a03>   DW_AT_decl_column : 12
    <a04>   DW_AT_type        : <0x257>
    <a08>   DW_AT_data_member_location: 4
 <2><a09>: Abbrev Number: 1 (DW_TAG_member)
    <a0a>   DW_AT_name        : (indirect string, offset: 0x85715): PLLM
    <a0e>   DW_AT_decl_file   : 8
    <a0f>   DW_AT_decl_line   : 53
    <a10>   DW_AT_decl_column : 12
    <a11>   DW_AT_type        : <0x257>
    <a15>   DW_AT_data_member_location: 8
 <2><a16>: Abbrev Number: 1 (DW_TAG_member)
    <a17>   DW_AT_name        : (indirect string, offset: 0x8571a): PLLN
    <a1b>   DW_AT_decl_file   : 8
    <a1c>   DW_AT_decl_line   : 56
    <a1d>   DW_AT_decl_column : 12
    <a1e>   DW_AT_type        : <0x257>
    <a22>   DW_AT_data_member_location: 12
 <2><a23>: Abbrev Number: 1 (DW_TAG_member)
    <a24>   DW_AT_name        : (indirect string, offset: 0x496c0): PLLP
    <a28>   DW_AT_decl_file   : 8
    <a29>   DW_AT_decl_line   : 60
    <a2a>   DW_AT_decl_column : 12
    <a2b>   DW_AT_type        : <0x257>
    <a2f>   DW_AT_data_member_location: 16
 <2><a30>: Abbrev Number: 1 (DW_TAG_member)
    <a31>   DW_AT_name        : (indirect string, offset: 0x3abe6): PLLQ
    <a35>   DW_AT_decl_file   : 8
    <a36>   DW_AT_decl_line   : 63
    <a37>   DW_AT_decl_column : 12
    <a38>   DW_AT_type        : <0x257>
    <a3c>   DW_AT_data_member_location: 20
 <2><a3d>: Abbrev Number: 0
 <1><a3e>: Abbrev Number: 4 (DW_TAG_typedef)
    <a3f>   DW_AT_name        : (indirect string, offset: 0x9dc6f): RCC_PLLInitTypeDef
    <a43>   DW_AT_decl_file   : 8
    <a44>   DW_AT_decl_line   : 73
    <a45>   DW_AT_decl_column : 3
    <a46>   DW_AT_type        : <0x9e7>
 <1><a4a>: Abbrev Number: 9 (DW_TAG_structure_type)
    <a4b>   DW_AT_byte_size   : 48
    <a4c>   DW_AT_decl_file   : 9
    <a4d>   DW_AT_decl_line   : 49
    <a4e>   DW_AT_decl_column : 9
    <a4e>   DW_AT_sibling     : <0xaae>
 <2><a52>: Abbrev Number: 1 (DW_TAG_member)
    <a53>   DW_AT_name        : (indirect string, offset: 0x82fe5): OscillatorType
    <a57>   DW_AT_decl_file   : 9
    <a58>   DW_AT_decl_line   : 51
    <a59>   DW_AT_decl_column : 12
    <a5a>   DW_AT_type        : <0x257>
    <a5e>   DW_AT_data_member_location: 0
 <2><a5f>: Abbrev Number: 1 (DW_TAG_member)
    <a60>   DW_AT_name        : (indirect string, offset: 0x6bd2c): HSEState
    <a64>   DW_AT_decl_file   : 9
    <a65>   DW_AT_decl_line   : 54
    <a66>   DW_AT_decl_column : 12
    <a67>   DW_AT_type        : <0x257>
    <a6b>   DW_AT_data_member_location: 4
 <2><a6c>: Abbrev Number: 1 (DW_TAG_member)
    <a6d>   DW_AT_name        : (indirect string, offset: 0x6412b): LSEState
    <a71>   DW_AT_decl_file   : 9
    <a72>   DW_AT_decl_line   : 57
    <a73>   DW_AT_decl_column : 12
    <a74>   DW_AT_type        : <0x257>
    <a78>   DW_AT_data_member_location: 8
 <2><a79>: Abbrev Number: 1 (DW_TAG_member)
    <a7a>   DW_AT_name        : (indirect string, offset: 0x4662a): HSIState
    <a7e>   DW_AT_decl_file   : 9
    <a7f>   DW_AT_decl_line   : 60
    <a80>   DW_AT_decl_column : 12
    <a81>   DW_AT_type        : <0x257>
    <a85>   DW_AT_data_member_location: 12
 <2><a86>: Abbrev Number: 1 (DW_TAG_member)
    <a87>   DW_AT_name        : (indirect string, offset: 0x8a566): HSICalibrationValue
    <a8b>   DW_AT_decl_file   : 9
    <a8c>   DW_AT_decl_line   : 63
    <a8d>   DW_AT_decl_column : 12
    <a8e>   DW_AT_type        : <0x257>
    <a92>   DW_AT_data_member_location: 16
 <2><a93>: Abbrev Number: 1 (DW_TAG_member)
    <a94>   DW_AT_name        : (indirect string, offset: 0x8fbe7): LSIState
    <a98>   DW_AT_decl_file   : 9
    <a99>   DW_AT_decl_line   : 66
    <a9a>   DW_AT_decl_column : 12
    <a9b>   DW_AT_type        : <0x257>
    <a9f>   DW_AT_data_member_location: 20
 <2><aa0>: Abbrev Number: 13 (DW_TAG_member)
    <aa1>   DW_AT_name        : PLL
    <aa5>   DW_AT_decl_file   : 9
    <aa6>   DW_AT_decl_line   : 69
    <aa7>   DW_AT_decl_column : 22
    <aa8>   DW_AT_type        : <0xa3e>
    <aac>   DW_AT_data_member_location: 24
 <2><aad>: Abbrev Number: 0
 <1><aae>: Abbrev Number: 4 (DW_TAG_typedef)
    <aaf>   DW_AT_name        : (indirect string, offset: 0x54a5e): RCC_OscInitTypeDef
    <ab3>   DW_AT_decl_file   : 9
    <ab4>   DW_AT_decl_line   : 70
    <ab5>   DW_AT_decl_column : 3
    <ab6>   DW_AT_type        : <0xa4a>
 <1><aba>: Abbrev Number: 21 (DW_TAG_const_type)
    <abb>   DW_AT_type        : <0xaae>
 <1><abf>: Abbrev Number: 9 (DW_TAG_structure_type)
    <ac0>   DW_AT_byte_size   : 20
    <ac1>   DW_AT_decl_file   : 9
    <ac2>   DW_AT_decl_line   : 75
    <ac3>   DW_AT_decl_column : 9
    <ac3>   DW_AT_sibling     : <0xb09>
 <2><ac7>: Abbrev Number: 1 (DW_TAG_member)
    <ac8>   DW_AT_name        : (indirect string, offset: 0x3014a): ClockType
    <acc>   DW_AT_decl_file   : 9
    <acd>   DW_AT_decl_line   : 77
    <ace>   DW_AT_decl_column : 12
    <acf>   DW_AT_type        : <0x257>
    <ad3>   DW_AT_data_member_location: 0
 <2><ad4>: Abbrev Number: 1 (DW_TAG_member)
    <ad5>   DW_AT_name        : (indirect string, offset: 0x5136e): SYSCLKSource
    <ad9>   DW_AT_decl_file   : 9
    <ada>   DW_AT_decl_line   : 80
    <adb>   DW_AT_decl_column : 12
    <adc>   DW_AT_type        : <0x257>
    <ae0>   DW_AT_data_member_location: 4
 <2><ae1>: Abbrev Number: 1 (DW_TAG_member)
    <ae2>   DW_AT_name        : (indirect string, offset: 0x85066): AHBCLKDivider
    <ae6>   DW_AT_decl_file   : 9
    <ae7>   DW_AT_decl_line   : 83
    <ae8>   DW_AT_decl_column : 12
    <ae9>   DW_AT_type        : <0x257>
    <aed>   DW_AT_data_member_location: 8
 <2><aee>: Abbrev Number: 1 (DW_TAG_member)
    <aef>   DW_AT_name        : (indirect string, offset: 0x630f): APB1CLKDivider
    <af3>   DW_AT_decl_file   : 9
    <af4>   DW_AT_decl_line   : 86
    <af5>   DW_AT_decl_column : 12
    <af6>   DW_AT_type        : <0x257>
    <afa>   DW_AT_data_member_location: 12
 <2><afb>: Abbrev Number: 1 (DW_TAG_member)
    <afc>   DW_AT_name        : (indirect string, offset: 0x48724): APB2CLKDivider
    <b00>   DW_AT_decl_file   : 9
    <b01>   DW_AT_decl_line   : 89
    <b02>   DW_AT_decl_column : 12
    <b03>   DW_AT_type        : <0x257>
    <b07>   DW_AT_data_member_location: 16
 <2><b08>: Abbrev Number: 0
 <1><b09>: Abbrev Number: 4 (DW_TAG_typedef)
    <b0a>   DW_AT_name        : (indirect string, offset: 0x7c344): RCC_ClkInitTypeDef
    <b0e>   DW_AT_decl_file   : 9
    <b0f>   DW_AT_decl_line   : 92
    <b10>   DW_AT_decl_column : 3
    <b11>   DW_AT_type        : <0xabf>
 <1><b15>: Abbrev Number: 21 (DW_TAG_const_type)
    <b16>   DW_AT_type        : <0xb09>
 <1><b1a>: Abbrev Number: 9 (DW_TAG_structure_type)
    <b1b>   DW_AT_byte_size   : 20
    <b1c>   DW_AT_decl_file   : 10
    <b1d>   DW_AT_decl_line   : 46
    <b1e>   DW_AT_decl_column : 9
    <b1e>   DW_AT_sibling     : <0xb64>
 <2><b22>: Abbrev Number: 13 (DW_TAG_member)
    <b23>   DW_AT_name        : Pin
    <b27>   DW_AT_decl_file   : 10
    <b28>   DW_AT_decl_line   : 48
    <b29>   DW_AT_decl_column : 12
    <b2a>   DW_AT_type        : <0x257>
    <b2e>   DW_AT_data_member_location: 0
 <2><b2f>: Abbrev Number: 1 (DW_TAG_member)
    <b30>   DW_AT_name        : (indirect string, offset: 0xa60b7): Mode
    <b34>   DW_AT_decl_file   : 10
    <b35>   DW_AT_decl_line   : 51
    <b36>   DW_AT_decl_column : 12
    <b37>   DW_AT_type        : <0x257>
    <b3b>   DW_AT_data_member_location: 4
 <2><b3c>: Abbrev Number: 1 (DW_TAG_member)
    <b3d>   DW_AT_name        : (indirect string, offset: 0x51f4f): Pull
    <b41>   DW_AT_decl_file   : 10
    <b42>   DW_AT_decl_line   : 54
    <b43>   DW_AT_decl_column : 12
    <b44>   DW_AT_type        : <0x257>
    <b48>   DW_AT_data_member_location: 8
 <2><b49>: Abbrev Number: 1 (DW_TAG_member)
    <b4a>   DW_AT_name        : (indirect string, offset: 0xa75b3): Speed
    <b4e>   DW_AT_decl_file   : 10
    <b4f>   DW_AT_decl_line   : 57
    <b50>   DW_AT_decl_column : 12
    <b51>   DW_AT_type        : <0x257>
    <b55>   DW_AT_data_member_location: 12
 <2><b56>: Abbrev Number: 1 (DW_TAG_member)
    <b57>   DW_AT_name        : (indirect string, offset: 0x486e6): Alternate
    <b5b>   DW_AT_decl_file   : 10
    <b5c>   DW_AT_decl_line   : 60
    <b5d>   DW_AT_decl_column : 12
    <b5e>   DW_AT_type        : <0x257>
    <b62>   DW_AT_data_member_location: 16
 <2><b63>: Abbrev Number: 0
 <1><b64>: Abbrev Number: 4 (DW_TAG_typedef)
    <b65>   DW_AT_name        : (indirect string, offset: 0x7ddfa): GPIO_InitTypeDef
    <b69>   DW_AT_decl_file   : 10
    <b6a>   DW_AT_decl_line   : 62
    <b6b>   DW_AT_decl_column : 2
    <b6c>   DW_AT_type        : <0xb1a>
 <1><b70>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <b71>   DW_AT_encoding    : 7	(unsigned)
    <b72>   DW_AT_byte_size   : 1
    <b73>   DW_AT_type        : <0x1de>
    <b77>   DW_AT_decl_file   : 10
    <b78>   DW_AT_decl_line   : 68
    <b79>   DW_AT_decl_column : 1
    <b7a>   DW_AT_sibling     : <0xb8b>
 <2><b7e>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b7f>   DW_AT_name        : (indirect string, offset: 0x20919): GPIO_PIN_RESET
    <b83>   DW_AT_const_value : 0
 <2><b84>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b85>   DW_AT_name        : (indirect string, offset: 0x1bd77): GPIO_PIN_SET
    <b89>   DW_AT_const_value : 1
 <2><b8a>: Abbrev Number: 0
 <1><b8b>: Abbrev Number: 4 (DW_TAG_typedef)
    <b8c>   DW_AT_name        : (indirect string, offset: 0x9e068): GPIO_PinState
    <b90>   DW_AT_decl_file   : 10
    <b91>   DW_AT_decl_line   : 71
    <b92>   DW_AT_decl_column : 2
    <b93>   DW_AT_type        : <0xb70>
 <1><b97>: Abbrev Number: 9 (DW_TAG_structure_type)
    <b98>   DW_AT_byte_size   : 48
    <b99>   DW_AT_decl_file   : 11
    <b9a>   DW_AT_decl_line   : 48
    <b9b>   DW_AT_decl_column : 9
    <b9b>   DW_AT_sibling     : <0xc3c>
 <2><b9f>: Abbrev Number: 1 (DW_TAG_member)
    <ba0>   DW_AT_name        : (indirect string, offset: 0xa1fa1): Channel
    <ba4>   DW_AT_decl_file   : 11
    <ba5>   DW_AT_decl_line   : 50
    <ba6>   DW_AT_decl_column : 12
    <ba7>   DW_AT_type        : <0x257>
    <bab>   DW_AT_data_member_location: 0
 <2><bac>: Abbrev Number: 1 (DW_TAG_member)
    <bad>   DW_AT_name        : (indirect string, offset: 0xa471b): Direction
    <bb1>   DW_AT_decl_file   : 11
    <bb2>   DW_AT_decl_line   : 53
    <bb3>   DW_AT_decl_column : 12
    <bb4>   DW_AT_type        : <0x257>
    <bb8>   DW_AT_data_member_location: 4
 <2><bb9>: Abbrev Number: 1 (DW_TAG_member)
    <bba>   DW_AT_name        : (indirect string, offset: 0xa7c3): PeriphInc
    <bbe>   DW_AT_decl_file   : 11
    <bbf>   DW_AT_decl_line   : 57
    <bc0>   DW_AT_decl_column : 12
    <bc1>   DW_AT_type        : <0x257>
    <bc5>   DW_AT_data_member_location: 8
 <2><bc6>: Abbrev Number: 1 (DW_TAG_member)
    <bc7>   DW_AT_name        : (indirect string, offset: 0x18c43): MemInc
    <bcb>   DW_AT_decl_file   : 11
    <bcc>   DW_AT_decl_line   : 60
    <bcd>   DW_AT_decl_column : 12
    <bce>   DW_AT_type        : <0x257>
    <bd2>   DW_AT_data_member_location: 12
 <2><bd3>: Abbrev Number: 1 (DW_TAG_member)
    <bd4>   DW_AT_name        : (indirect string, offset: 0x4f3ba): PeriphDataAlignment
    <bd8>   DW_AT_decl_file   : 11
    <bd9>   DW_AT_decl_line   : 63
    <bda>   DW_AT_decl_column : 12
    <bdb>   DW_AT_type        : <0x257>
    <bdf>   DW_AT_data_member_location: 16
 <2><be0>: Abbrev Number: 1 (DW_TAG_member)
    <be1>   DW_AT_name        : (indirect string, offset: 0x9189f): MemDataAlignment
    <be5>   DW_AT_decl_file   : 11
    <be6>   DW_AT_decl_line   : 66
    <be7>   DW_AT_decl_column : 12
    <be8>   DW_AT_type        : <0x257>
    <bec>   DW_AT_data_member_location: 20
 <2><bed>: Abbrev Number: 1 (DW_TAG_member)
    <bee>   DW_AT_name        : (indirect string, offset: 0xa60b7): Mode
    <bf2>   DW_AT_decl_file   : 11
    <bf3>   DW_AT_decl_line   : 69
    <bf4>   DW_AT_decl_column : 12
    <bf5>   DW_AT_type        : <0x257>
    <bf9>   DW_AT_data_member_location: 24
 <2><bfa>: Abbrev Number: 1 (DW_TAG_member)
    <bfb>   DW_AT_name        : (indirect string, offset: 0xa3a59): Priority
    <bff>   DW_AT_decl_file   : 11
    <c00>   DW_AT_decl_line   : 74
    <c01>   DW_AT_decl_column : 12
    <c02>   DW_AT_type        : <0x257>
    <c06>   DW_AT_data_member_location: 28
 <2><c07>: Abbrev Number: 1 (DW_TAG_member)
    <c08>   DW_AT_name        : (indirect string, offset: 0x4407c): FIFOMode
    <c0c>   DW_AT_decl_file   : 11
    <c0d>   DW_AT_decl_line   : 77
    <c0e>   DW_AT_decl_column : 12
    <c0f>   DW_AT_type        : <0x257>
    <c13>   DW_AT_data_member_location: 32
 <2><c14>: Abbrev Number: 1 (DW_TAG_member)
    <c15>   DW_AT_name        : (indirect string, offset: 0x7a3fb): FIFOThreshold
    <c19>   DW_AT_decl_file   : 11
    <c1a>   DW_AT_decl_line   : 82
    <c1b>   DW_AT_decl_column : 12
    <c1c>   DW_AT_type        : <0x257>
    <c20>   DW_AT_data_member_location: 36
 <2><c21>: Abbrev Number: 1 (DW_TAG_member)
    <c22>   DW_AT_name        : (indirect string, offset: 0x78b45): MemBurst
    <c26>   DW_AT_decl_file   : 11
    <c27>   DW_AT_decl_line   : 85
    <c28>   DW_AT_decl_column : 12
    <c29>   DW_AT_type        : <0x257>
    <c2d>   DW_AT_data_member_location: 40
 <2><c2e>: Abbrev Number: 1 (DW_TAG_member)
    <c2f>   DW_AT_name        : (indirect string, offset: 0x35f70): PeriphBurst
    <c33>   DW_AT_decl_file   : 11
    <c34>   DW_AT_decl_line   : 91
    <c35>   DW_AT_decl_column : 12
    <c36>   DW_AT_type        : <0x257>
    <c3a>   DW_AT_data_member_location: 44
 <2><c3b>: Abbrev Number: 0
 <1><c3c>: Abbrev Number: 4 (DW_TAG_typedef)
    <c3d>   DW_AT_name        : (indirect string, offset: 0x2a55a): DMA_InitTypeDef
    <c41>   DW_AT_decl_file   : 11
    <c42>   DW_AT_decl_line   : 96
    <c43>   DW_AT_decl_column : 2
    <c44>   DW_AT_type        : <0xb97>
 <1><c48>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <c49>   DW_AT_encoding    : 7	(unsigned)
    <c4a>   DW_AT_byte_size   : 1
    <c4b>   DW_AT_type        : <0x1de>
    <c4f>   DW_AT_decl_file   : 11
    <c50>   DW_AT_decl_line   : 103
    <c51>   DW_AT_decl_column : 1
    <c52>   DW_AT_sibling     : <0xc7b>
 <2><c56>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c57>   DW_AT_name        : (indirect string, offset: 0x77ef5): HAL_DMA_STATE_RESET
    <c5b>   DW_AT_const_value : 0
 <2><c5c>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c5d>   DW_AT_name        : (indirect string, offset: 0x2b515): HAL_DMA_STATE_READY
    <c61>   DW_AT_const_value : 1
 <2><c62>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c63>   DW_AT_name        : (indirect string, offset: 0x6e813): HAL_DMA_STATE_BUSY
    <c67>   DW_AT_const_value : 2
 <2><c68>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c69>   DW_AT_name        : (indirect string, offset: 0x9e35d): HAL_DMA_STATE_TIMEOUT
    <c6d>   DW_AT_const_value : 3
 <2><c6e>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c6f>   DW_AT_name        : (indirect string, offset: 0x89b0c): HAL_DMA_STATE_ERROR
    <c73>   DW_AT_const_value : 4
 <2><c74>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c75>   DW_AT_name        : (indirect string, offset: 0x23ea1): HAL_DMA_STATE_ABORT
    <c79>   DW_AT_const_value : 5
 <2><c7a>: Abbrev Number: 0
 <1><c7b>: Abbrev Number: 4 (DW_TAG_typedef)
    <c7c>   DW_AT_name        : (indirect string, offset: 0x69d52): HAL_DMA_StateTypeDef
    <c80>   DW_AT_decl_file   : 11
    <c81>   DW_AT_decl_line   : 110
    <c82>   DW_AT_decl_column : 2
    <c83>   DW_AT_type        : <0xc48>
 <1><c87>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <c88>   DW_AT_type        : <0xc7b>
 <1><c8c>: Abbrev Number: 27 (DW_TAG_structure_type)
    <c8d>   DW_AT_name        : (indirect string, offset: 0x88ee2): __DMA_HandleTypeDef
    <c91>   DW_AT_byte_size   : 96
    <c92>   DW_AT_decl_file   : 11
    <c93>   DW_AT_decl_line   : 138
    <c94>   DW_AT_decl_column : 16
    <c94>   DW_AT_sibling     : <0xd4f>
 <2><c98>: Abbrev Number: 1 (DW_TAG_member)
    <c99>   DW_AT_name        : (indirect string, offset: 0x3d5fb): Instance
    <c9d>   DW_AT_decl_file   : 11
    <c9e>   DW_AT_decl_line   : 140
    <c9f>   DW_AT_decl_column : 31
    <ca0>   DW_AT_type        : <0xd4f>
    <ca4>   DW_AT_data_member_location: 0
 <2><ca5>: Abbrev Number: 1 (DW_TAG_member)
    <ca6>   DW_AT_name        : (indirect string, offset: 0x82fe0): Init
    <caa>   DW_AT_decl_file   : 11
    <cab>   DW_AT_decl_line   : 142
    <cac>   DW_AT_decl_column : 30
    <cad>   DW_AT_type        : <0xc3c>
    <cb1>   DW_AT_data_member_location: 4
 <2><cb2>: Abbrev Number: 1 (DW_TAG_member)
    <cb3>   DW_AT_name        : (indirect string, offset: 0x722ef): Lock
    <cb7>   DW_AT_decl_file   : 11
    <cb8>   DW_AT_decl_line   : 144
    <cb9>   DW_AT_decl_column : 30
    <cba>   DW_AT_type        : <0x9db>
    <cbe>   DW_AT_data_member_location: 52
 <2><cbf>: Abbrev Number: 1 (DW_TAG_member)
    <cc0>   DW_AT_name        : (indirect string, offset: 0x6bd2f): State
    <cc4>   DW_AT_decl_file   : 11
    <cc5>   DW_AT_decl_line   : 146
    <cc6>   DW_AT_decl_column : 30
    <cc7>   DW_AT_type        : <0xc87>
    <ccb>   DW_AT_data_member_location: 53
 <2><ccc>: Abbrev Number: 1 (DW_TAG_member)
    <ccd>   DW_AT_name        : (indirect string, offset: 0x98de8): Parent
    <cd1>   DW_AT_decl_file   : 11
    <cd2>   DW_AT_decl_line   : 148
    <cd3>   DW_AT_decl_column : 31
    <cd4>   DW_AT_type        : <0xd54>
    <cd8>   DW_AT_data_member_location: 56
 <2><cd9>: Abbrev Number: 1 (DW_TAG_member)
    <cda>   DW_AT_name        : (indirect string, offset: 0xa017c): XferCpltCallback
    <cde>   DW_AT_decl_file   : 11
    <cdf>   DW_AT_decl_line   : 150
    <ce0>   DW_AT_decl_column : 33
    <ce1>   DW_AT_type        : <0xd66>
    <ce5>   DW_AT_data_member_location: 60
 <2><ce6>: Abbrev Number: 1 (DW_TAG_member)
    <ce7>   DW_AT_name        : (indirect string, offset: 0x7d083): XferHalfCpltCallback
    <ceb>   DW_AT_decl_file   : 11
    <cec>   DW_AT_decl_line   : 152
    <ced>   DW_AT_decl_column : 33
    <cee>   DW_AT_type        : <0xd66>
    <cf2>   DW_AT_data_member_location: 64
 <2><cf3>: Abbrev Number: 1 (DW_TAG_member)
    <cf4>   DW_AT_name        : (indirect string, offset: 0x25ad2): XferM1CpltCallback
    <cf8>   DW_AT_decl_file   : 11
    <cf9>   DW_AT_decl_line   : 154
    <cfa>   DW_AT_decl_column : 33
    <cfb>   DW_AT_type        : <0xd66>
    <cff>   DW_AT_data_member_location: 68
 <2><d00>: Abbrev Number: 1 (DW_TAG_member)
    <d01>   DW_AT_name        : (indirect string, offset: 0x58392): XferM1HalfCpltCallback
    <d05>   DW_AT_decl_file   : 11
    <d06>   DW_AT_decl_line   : 156
    <d07>   DW_AT_decl_column : 33
    <d08>   DW_AT_type        : <0xd66>
    <d0c>   DW_AT_data_member_location: 72
 <2><d0d>: Abbrev Number: 1 (DW_TAG_member)
    <d0e>   DW_AT_name        : (indirect string, offset: 0x16dd1): XferErrorCallback
    <d12>   DW_AT_decl_file   : 11
    <d13>   DW_AT_decl_line   : 158
    <d14>   DW_AT_decl_column : 33
    <d15>   DW_AT_type        : <0xd66>
    <d19>   DW_AT_data_member_location: 76
 <2><d1a>: Abbrev Number: 1 (DW_TAG_member)
    <d1b>   DW_AT_name        : (indirect string, offset: 0x96317): XferAbortCallback
    <d1f>   DW_AT_decl_file   : 11
    <d20>   DW_AT_decl_line   : 160
    <d21>   DW_AT_decl_column : 33
    <d22>   DW_AT_type        : <0xd66>
    <d26>   DW_AT_data_member_location: 80
 <2><d27>: Abbrev Number: 1 (DW_TAG_member)
    <d28>   DW_AT_name        : (indirect string, offset: 0x9d3fc): ErrorCode
    <d2c>   DW_AT_decl_file   : 11
    <d2d>   DW_AT_decl_line   : 162
    <d2e>   DW_AT_decl_column : 30
    <d2f>   DW_AT_type        : <0x263>
    <d33>   DW_AT_data_member_location: 84
 <2><d34>: Abbrev Number: 1 (DW_TAG_member)
    <d35>   DW_AT_name        : (indirect string, offset: 0x796df): StreamBaseAddress
    <d39>   DW_AT_decl_file   : 11
    <d3a>   DW_AT_decl_line   : 164
    <d3b>   DW_AT_decl_column : 30
    <d3c>   DW_AT_type        : <0x257>
    <d40>   DW_AT_data_member_location: 88
 <2><d41>: Abbrev Number: 1 (DW_TAG_member)
    <d42>   DW_AT_name        : (indirect string, offset: 0x8743e): StreamIndex
    <d46>   DW_AT_decl_file   : 11
    <d47>   DW_AT_decl_line   : 166
    <d48>   DW_AT_decl_column : 30
    <d49>   DW_AT_type        : <0x257>
    <d4d>   DW_AT_data_member_location: 92
 <2><d4e>: Abbrev Number: 0
 <1><d4f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <d50>   DW_AT_byte_size   : 4
    <d50>   DW_AT_type        : <0x405>
 <1><d54>: Abbrev Number: 39 (DW_TAG_pointer_type)
    <d55>   DW_AT_byte_size   : 4
 <1><d56>: Abbrev Number: 28 (DW_TAG_subroutine_type)
    <d57>   DW_AT_prototyped  : 1
    <d57>   DW_AT_sibling     : <0xd61>
 <2><d5b>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <d5c>   DW_AT_type        : <0xd61>
 <2><d60>: Abbrev Number: 0
 <1><d61>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <d62>   DW_AT_byte_size   : 4
    <d62>   DW_AT_type        : <0xc8c>
 <1><d66>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <d67>   DW_AT_byte_size   : 4
    <d67>   DW_AT_type        : <0xd56>
 <1><d6b>: Abbrev Number: 4 (DW_TAG_typedef)
    <d6c>   DW_AT_name        : (indirect string, offset: 0x88ee4): DMA_HandleTypeDef
    <d70>   DW_AT_decl_file   : 11
    <d71>   DW_AT_decl_line   : 168
    <d72>   DW_AT_decl_column : 2
    <d73>   DW_AT_type        : <0xc8c>
 <1><d77>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d78>   DW_AT_byte_size   : 48
    <d79>   DW_AT_decl_file   : 12
    <d7a>   DW_AT_decl_line   : 59
    <d7b>   DW_AT_decl_column : 9
    <d7b>   DW_AT_sibling     : <0xe1c>
 <2><d7f>: Abbrev Number: 1 (DW_TAG_member)
    <d80>   DW_AT_name        : (indirect string, offset: 0x8e166): ClockPrescaler
    <d84>   DW_AT_decl_file   : 12
    <d85>   DW_AT_decl_line   : 61
    <d86>   DW_AT_decl_column : 12
    <d87>   DW_AT_type        : <0x257>
    <d8b>   DW_AT_data_member_location: 0
 <2><d8c>: Abbrev Number: 1 (DW_TAG_member)
    <d8d>   DW_AT_name        : (indirect string, offset: 0xca87): Resolution
    <d91>   DW_AT_decl_file   : 12
    <d92>   DW_AT_decl_line   : 64
    <d93>   DW_AT_decl_column : 12
    <d94>   DW_AT_type        : <0x257>
    <d98>   DW_AT_data_member_location: 4
 <2><d99>: Abbrev Number: 1 (DW_TAG_member)
    <d9a>   DW_AT_name        : (indirect string, offset: 0x2257c): DataAlign
    <d9e>   DW_AT_decl_file   : 12
    <d9f>   DW_AT_decl_line   : 66
    <da0>   DW_AT_decl_column : 12
    <da1>   DW_AT_type        : <0x257>
    <da5>   DW_AT_data_member_location: 8
 <2><da6>: Abbrev Number: 1 (DW_TAG_member)
    <da7>   DW_AT_name        : (indirect string, offset: 0x5fd00): ScanConvMode
    <dab>   DW_AT_decl_file   : 12
    <dac>   DW_AT_decl_line   : 69
    <dad>   DW_AT_decl_column : 12
    <dae>   DW_AT_type        : <0x257>
    <db2>   DW_AT_data_member_location: 12
 <2><db3>: Abbrev Number: 1 (DW_TAG_member)
    <db4>   DW_AT_name        : (indirect string, offset: 0x6a1d8): EOCSelection
    <db8>   DW_AT_decl_file   : 12
    <db9>   DW_AT_decl_line   : 76
    <dba>   DW_AT_decl_column : 12
    <dbb>   DW_AT_type        : <0x257>
    <dbf>   DW_AT_data_member_location: 16
 <2><dc0>: Abbrev Number: 1 (DW_TAG_member)
    <dc1>   DW_AT_name        : (indirect string, offset: 0x4215f): ContinuousConvMode
    <dc5>   DW_AT_decl_file   : 12
    <dc6>   DW_AT_decl_line   : 83
    <dc7>   DW_AT_decl_column : 19
    <dc8>   DW_AT_type        : <0x97a>
    <dcc>   DW_AT_data_member_location: 20
 <2><dcd>: Abbrev Number: 1 (DW_TAG_member)
    <dce>   DW_AT_name        : (indirect string, offset: 0xa3693): NbrOfConversion
    <dd2>   DW_AT_decl_file   : 12
    <dd3>   DW_AT_decl_line   : 86
    <dd4>   DW_AT_decl_column : 12
    <dd5>   DW_AT_type        : <0x257>
    <dd9>   DW_AT_data_member_location: 24
 <2><dda>: Abbrev Number: 1 (DW_TAG_member)
    <ddb>   DW_AT_name        : (indirect string, offset: 0xa379e): DiscontinuousConvMode
    <ddf>   DW_AT_decl_file   : 12
    <de0>   DW_AT_decl_line   : 89
    <de1>   DW_AT_decl_column : 19
    <de2>   DW_AT_type        : <0x97a>
    <de6>   DW_AT_data_member_location: 28
 <2><de7>: Abbrev Number: 1 (DW_TAG_member)
    <de8>   DW_AT_name        : (indirect string, offset: 0x16c6c): NbrOfDiscConversion
    <dec>   DW_AT_decl_file   : 12
    <ded>   DW_AT_decl_line   : 93
    <dee>   DW_AT_decl_column : 12
    <def>   DW_AT_type        : <0x257>
    <df3>   DW_AT_data_member_location: 32
 <2><df4>: Abbrev Number: 1 (DW_TAG_member)
    <df5>   DW_AT_name        : (indirect string, offset: 0x73908): ExternalTrigConv
    <df9>   DW_AT_decl_file   : 12
    <dfa>   DW_AT_decl_line   : 96
    <dfb>   DW_AT_decl_column : 12
    <dfc>   DW_AT_type        : <0x257>
    <e00>   DW_AT_data_member_location: 36
 <2><e01>: Abbrev Number: 1 (DW_TAG_member)
    <e02>   DW_AT_name        : (indirect string, offset: 0x2b162): ExternalTrigConvEdge
    <e06>   DW_AT_decl_file   : 12
    <e07>   DW_AT_decl_line   : 100
    <e08>   DW_AT_decl_column : 12
    <e09>   DW_AT_type        : <0x257>
    <e0d>   DW_AT_data_member_location: 40
 <2><e0e>: Abbrev Number: 1 (DW_TAG_member)
    <e0f>   DW_AT_name        : (indirect string, offset: 0x3ed1f): DMAContinuousRequests
    <e13>   DW_AT_decl_file   : 12
    <e14>   DW_AT_decl_line   : 103
    <e15>   DW_AT_decl_column : 19
    <e16>   DW_AT_type        : <0x97a>
    <e1a>   DW_AT_data_member_location: 44
 <2><e1b>: Abbrev Number: 0
 <1><e1c>: Abbrev Number: 4 (DW_TAG_typedef)
    <e1d>   DW_AT_name        : (indirect string, offset: 0x24faf): ADC_InitTypeDef
    <e21>   DW_AT_decl_file   : 12
    <e22>   DW_AT_decl_line   : 108
    <e23>   DW_AT_decl_column : 3
    <e24>   DW_AT_type        : <0xd77>
 <1><e28>: Abbrev Number: 9 (DW_TAG_structure_type)
    <e29>   DW_AT_byte_size   : 16
    <e2a>   DW_AT_decl_file   : 12
    <e2b>   DW_AT_decl_line   : 117
    <e2c>   DW_AT_decl_column : 9
    <e2c>   DW_AT_sibling     : <0xe65>
 <2><e30>: Abbrev Number: 1 (DW_TAG_member)
    <e31>   DW_AT_name        : (indirect string, offset: 0xa1fa1): Channel
    <e35>   DW_AT_decl_file   : 12
    <e36>   DW_AT_decl_line   : 119
    <e37>   DW_AT_decl_column : 12
    <e38>   DW_AT_type        : <0x257>
    <e3c>   DW_AT_data_member_location: 0
 <2><e3d>: Abbrev Number: 1 (DW_TAG_member)
    <e3e>   DW_AT_name        : (indirect string, offset: 0xa36ab): Rank
    <e42>   DW_AT_decl_file   : 12
    <e43>   DW_AT_decl_line   : 121
    <e44>   DW_AT_decl_column : 12
    <e45>   DW_AT_type        : <0x257>
    <e49>   DW_AT_data_member_location: 4
 <2><e4a>: Abbrev Number: 1 (DW_TAG_member)
    <e4b>   DW_AT_name        : (indirect string, offset: 0xa3824): SamplingTime
    <e4f>   DW_AT_decl_file   : 12
    <e50>   DW_AT_decl_line   : 123
    <e51>   DW_AT_decl_column : 12
    <e52>   DW_AT_type        : <0x257>
    <e56>   DW_AT_data_member_location: 8
 <2><e57>: Abbrev Number: 1 (DW_TAG_member)
    <e58>   DW_AT_name        : (indirect string, offset: 0xa535a): Offset
    <e5c>   DW_AT_decl_file   : 12
    <e5d>   DW_AT_decl_line   : 132
    <e5e>   DW_AT_decl_column : 12
    <e5f>   DW_AT_type        : <0x257>
    <e63>   DW_AT_data_member_location: 12
 <2><e64>: Abbrev Number: 0
 <1><e65>: Abbrev Number: 4 (DW_TAG_typedef)
    <e66>   DW_AT_name        : (indirect string, offset: 0xa03aa): ADC_ChannelConfTypeDef
    <e6a>   DW_AT_decl_file   : 12
    <e6b>   DW_AT_decl_line   : 133
    <e6c>   DW_AT_decl_column : 3
    <e6d>   DW_AT_type        : <0xe28>
 <1><e71>: Abbrev Number: 9 (DW_TAG_structure_type)
    <e72>   DW_AT_byte_size   : 72
    <e73>   DW_AT_decl_file   : 12
    <e74>   DW_AT_decl_line   : 195
    <e75>   DW_AT_decl_column : 9
    <e75>   DW_AT_sibling     : <0xed5>
 <2><e79>: Abbrev Number: 1 (DW_TAG_member)
    <e7a>   DW_AT_name        : (indirect string, offset: 0x3d5fb): Instance
    <e7e>   DW_AT_decl_file   : 12
    <e7f>   DW_AT_decl_line   : 198
    <e80>   DW_AT_decl_column : 34
    <e81>   DW_AT_type        : <0xed5>
    <e85>   DW_AT_data_member_location: 0
 <2><e86>: Abbrev Number: 1 (DW_TAG_member)
    <e87>   DW_AT_name        : (indirect string, offset: 0x82fe0): Init
    <e8b>   DW_AT_decl_file   : 12
    <e8c>   DW_AT_decl_line   : 200
    <e8d>   DW_AT_decl_column : 33
    <e8e>   DW_AT_type        : <0xe1c>
    <e92>   DW_AT_data_member_location: 4
 <2><e93>: Abbrev Number: 1 (DW_TAG_member)
    <e94>   DW_AT_name        : (indirect string, offset: 0x28afc): NbrOfCurrentConversionRank
    <e98>   DW_AT_decl_file   : 12
    <e99>   DW_AT_decl_line   : 202
    <e9a>   DW_AT_decl_column : 33
    <e9b>   DW_AT_type        : <0x263>
    <e9f>   DW_AT_data_member_location: 52
 <2><ea0>: Abbrev Number: 1 (DW_TAG_member)
    <ea1>   DW_AT_name        : (indirect string, offset: 0x57db7): DMA_Handle
    <ea5>   DW_AT_decl_file   : 12
    <ea6>   DW_AT_decl_line   : 204
    <ea7>   DW_AT_decl_column : 34
    <ea8>   DW_AT_type        : <0xeda>
    <eac>   DW_AT_data_member_location: 56
 <2><ead>: Abbrev Number: 1 (DW_TAG_member)
    <eae>   DW_AT_name        : (indirect string, offset: 0x722ef): Lock
    <eb2>   DW_AT_decl_file   : 12
    <eb3>   DW_AT_decl_line   : 206
    <eb4>   DW_AT_decl_column : 33
    <eb5>   DW_AT_type        : <0x9db>
    <eb9>   DW_AT_data_member_location: 60
 <2><eba>: Abbrev Number: 1 (DW_TAG_member)
    <ebb>   DW_AT_name        : (indirect string, offset: 0x6bd2f): State
    <ebf>   DW_AT_decl_file   : 12
    <ec0>   DW_AT_decl_line   : 208
    <ec1>   DW_AT_decl_column : 33
    <ec2>   DW_AT_type        : <0x263>
    <ec6>   DW_AT_data_member_location: 64
 <2><ec7>: Abbrev Number: 1 (DW_TAG_member)
    <ec8>   DW_AT_name        : (indirect string, offset: 0x9d3fc): ErrorCode
    <ecc>   DW_AT_decl_file   : 12
    <ecd>   DW_AT_decl_line   : 210
    <ece>   DW_AT_decl_column : 33
    <ecf>   DW_AT_type        : <0x263>
    <ed3>   DW_AT_data_member_location: 68
 <2><ed4>: Abbrev Number: 0
 <1><ed5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ed6>   DW_AT_byte_size   : 4
    <ed6>   DW_AT_type        : <0x3a3>
 <1><eda>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <edb>   DW_AT_byte_size   : 4
    <edb>   DW_AT_type        : <0xd6b>
 <1><edf>: Abbrev Number: 4 (DW_TAG_typedef)
    <ee0>   DW_AT_name        : (indirect string, offset: 0x1f93b): ADC_HandleTypeDef
    <ee4>   DW_AT_decl_file   : 12
    <ee5>   DW_AT_decl_line   : 220
    <ee6>   DW_AT_decl_column : 3
    <ee7>   DW_AT_type        : <0xe71>
 <1><eeb>: Abbrev Number: 9 (DW_TAG_structure_type)
    <eec>   DW_AT_byte_size   : 32
    <eed>   DW_AT_decl_file   : 13
    <eee>   DW_AT_decl_line   : 47
    <eef>   DW_AT_decl_column : 9
    <eef>   DW_AT_sibling     : <0xf5c>
 <2><ef3>: Abbrev Number: 1 (DW_TAG_member)
    <ef4>   DW_AT_name        : (indirect string, offset: 0x97b71): ClockSpeed
    <ef8>   DW_AT_decl_file   : 13
    <ef9>   DW_AT_decl_line   : 49
    <efa>   DW_AT_decl_column : 12
    <efb>   DW_AT_type        : <0x257>
    <eff>   DW_AT_data_member_location: 0
 <2><f00>: Abbrev Number: 1 (DW_TAG_member)
    <f01>   DW_AT_name        : (indirect string, offset: 0x60621): DutyCycle
    <f05>   DW_AT_decl_file   : 13
    <f06>   DW_AT_decl_line   : 52
    <f07>   DW_AT_decl_column : 12
    <f08>   DW_AT_type        : <0x257>
    <f0c>   DW_AT_data_member_location: 4
 <2><f0d>: Abbrev Number: 1 (DW_TAG_member)
    <f0e>   DW_AT_name        : (indirect string, offset: 0x38ba4): OwnAddress1
    <f12>   DW_AT_decl_file   : 13
    <f13>   DW_AT_decl_line   : 55
    <f14>   DW_AT_decl_column : 12
    <f15>   DW_AT_type        : <0x257>
    <f19>   DW_AT_data_member_location: 8
 <2><f1a>: Abbrev Number: 1 (DW_TAG_member)
    <f1b>   DW_AT_name        : (indirect string, offset: 0x4301a): AddressingMode
    <f1f>   DW_AT_decl_file   : 13
    <f20>   DW_AT_decl_line   : 58
    <f21>   DW_AT_decl_column : 12
    <f22>   DW_AT_type        : <0x257>
    <f26>   DW_AT_data_member_location: 12
 <2><f27>: Abbrev Number: 1 (DW_TAG_member)
    <f28>   DW_AT_name        : (indirect string, offset: 0x732c8): DualAddressMode
    <f2c>   DW_AT_decl_file   : 13
    <f2d>   DW_AT_decl_line   : 61
    <f2e>   DW_AT_decl_column : 12
    <f2f>   DW_AT_type        : <0x257>
    <f33>   DW_AT_data_member_location: 16
 <2><f34>: Abbrev Number: 1 (DW_TAG_member)
    <f35>   DW_AT_name        : (indirect string, offset: 0x38bb0): OwnAddress2
    <f39>   DW_AT_decl_file   : 13
    <f3a>   DW_AT_decl_line   : 64
    <f3b>   DW_AT_decl_column : 12
    <f3c>   DW_AT_type        : <0x257>
    <f40>   DW_AT_data_member_location: 20
 <2><f41>: Abbrev Number: 1 (DW_TAG_member)
    <f42>   DW_AT_name        : (indirect string, offset: 0x19d1a): GeneralCallMode
    <f46>   DW_AT_decl_file   : 13
    <f47>   DW_AT_decl_line   : 67
    <f48>   DW_AT_decl_column : 12
    <f49>   DW_AT_type        : <0x257>
    <f4d>   DW_AT_data_member_location: 24
 <2><f4e>: Abbrev Number: 1 (DW_TAG_member)
    <f4f>   DW_AT_name        : (indirect string, offset: 0x30407): NoStretchMode
    <f53>   DW_AT_decl_file   : 13
    <f54>   DW_AT_decl_line   : 70
    <f55>   DW_AT_decl_column : 12
    <f56>   DW_AT_type        : <0x257>
    <f5a>   DW_AT_data_member_location: 28
 <2><f5b>: Abbrev Number: 0
 <1><f5c>: Abbrev Number: 4 (DW_TAG_typedef)
    <f5d>   DW_AT_name        : (indirect string, offset: 0x322d2): I2C_InitTypeDef
    <f61>   DW_AT_decl_file   : 13
    <f62>   DW_AT_decl_line   : 73
    <f63>   DW_AT_decl_column : 3
    <f64>   DW_AT_type        : <0xeeb>
 <1><f68>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <f69>   DW_AT_encoding    : 7	(unsigned)
    <f6a>   DW_AT_byte_size   : 1
    <f6b>   DW_AT_type        : <0x1de>
    <f6f>   DW_AT_decl_file   : 13
    <f70>   DW_AT_decl_line   : 107
    <f71>   DW_AT_decl_column : 1
    <f72>   DW_AT_sibling     : <0xfb9>
 <2><f76>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f77>   DW_AT_name        : (indirect string, offset: 0x7fd25): HAL_I2C_STATE_RESET
    <f7b>   DW_AT_const_value : 0
 <2><f7c>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f7d>   DW_AT_name        : (indirect string, offset: 0x33098): HAL_I2C_STATE_READY
    <f81>   DW_AT_const_value : 32
 <2><f82>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f83>   DW_AT_name        : (indirect string, offset: 0x2d8a2): HAL_I2C_STATE_BUSY
    <f87>   DW_AT_const_value : 36
 <2><f88>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f89>   DW_AT_name        : (indirect string, offset: 0x7f9a5): HAL_I2C_STATE_BUSY_TX
    <f8d>   DW_AT_const_value : 33
 <2><f8e>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f8f>   DW_AT_name        : (indirect string, offset: 0x37fd9): HAL_I2C_STATE_BUSY_RX
    <f93>   DW_AT_const_value : 34
 <2><f94>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f95>   DW_AT_name        : (indirect string, offset: 0x3e442): HAL_I2C_STATE_LISTEN
    <f99>   DW_AT_const_value : 40
 <2><f9a>: Abbrev Number: 2 (DW_TAG_enumerator)
    <f9b>   DW_AT_name        : (indirect string, offset: 0x25dd9): HAL_I2C_STATE_BUSY_TX_LISTEN
    <f9f>   DW_AT_const_value : 41
 <2><fa0>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fa1>   DW_AT_name        : (indirect string, offset: 0x6df0d): HAL_I2C_STATE_BUSY_RX_LISTEN
    <fa5>   DW_AT_const_value : 42
 <2><fa6>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fa7>   DW_AT_name        : (indirect string, offset: 0x2b9b3): HAL_I2C_STATE_ABORT
    <fab>   DW_AT_const_value : 96
 <2><fac>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fad>   DW_AT_name        : (indirect string, offset: 0x864ca): HAL_I2C_STATE_TIMEOUT
    <fb1>   DW_AT_const_value : 160
 <2><fb2>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fb3>   DW_AT_name        : (indirect string, offset: 0x91f2b): HAL_I2C_STATE_ERROR
    <fb7>   DW_AT_const_value : 224
 <2><fb8>: Abbrev Number: 0
 <1><fb9>: Abbrev Number: 4 (DW_TAG_typedef)
    <fba>   DW_AT_name        : (indirect string, offset: 0x1a707): HAL_I2C_StateTypeDef
    <fbe>   DW_AT_decl_file   : 13
    <fbf>   DW_AT_decl_line   : 122
    <fc0>   DW_AT_decl_column : 3
    <fc1>   DW_AT_type        : <0xf68>
 <1><fc5>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <fc6>   DW_AT_type        : <0xfb9>
 <1><fca>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <fcb>   DW_AT_encoding    : 7	(unsigned)
    <fcc>   DW_AT_byte_size   : 1
    <fcd>   DW_AT_type        : <0x1de>
    <fd1>   DW_AT_decl_file   : 13
    <fd2>   DW_AT_decl_line   : 147
    <fd3>   DW_AT_decl_column : 1
    <fd4>   DW_AT_sibling     : <0xff1>
 <2><fd8>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fd9>   DW_AT_name        : (indirect string, offset: 0x2944a): HAL_I2C_MODE_NONE
    <fdd>   DW_AT_const_value : 0
 <2><fde>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fdf>   DW_AT_name        : (indirect string, offset: 0x31b0): HAL_I2C_MODE_MASTER
    <fe3>   DW_AT_const_value : 16
 <2><fe4>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fe5>   DW_AT_name        : (indirect string, offset: 0x4f9a6): HAL_I2C_MODE_SLAVE
    <fe9>   DW_AT_const_value : 32
 <2><fea>: Abbrev Number: 2 (DW_TAG_enumerator)
    <feb>   DW_AT_name        : (indirect string, offset: 0x31d86): HAL_I2C_MODE_MEM
    <fef>   DW_AT_const_value : 64
 <2><ff0>: Abbrev Number: 0
 <1><ff1>: Abbrev Number: 4 (DW_TAG_typedef)
    <ff2>   DW_AT_name        : (indirect string, offset: 0x4d062): HAL_I2C_ModeTypeDef
    <ff6>   DW_AT_decl_file   : 13
    <ff7>   DW_AT_decl_line   : 153
    <ff8>   DW_AT_decl_column : 3
    <ff9>   DW_AT_type        : <0xfca>
 <1><ffd>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <ffe>   DW_AT_type        : <0xff1>
 <1><1002>: Abbrev Number: 9 (DW_TAG_structure_type)
    <1003>   DW_AT_byte_size   : 84
    <1004>   DW_AT_decl_file   : 13
    <1005>   DW_AT_decl_line   : 187
    <1006>   DW_AT_decl_column : 9
    <1006>   DW_AT_sibling     : <0x10e8>
 <2><100a>: Abbrev Number: 1 (DW_TAG_member)
    <100b>   DW_AT_name        : (indirect string, offset: 0x3d5fb): Instance
    <100f>   DW_AT_decl_file   : 13
    <1010>   DW_AT_decl_line   : 190
    <1011>   DW_AT_decl_column : 31
    <1012>   DW_AT_type        : <0x10e8>
    <1016>   DW_AT_data_member_location: 0
 <2><1017>: Abbrev Number: 1 (DW_TAG_member)
    <1018>   DW_AT_name        : (indirect string, offset: 0x82fe0): Init
    <101c>   DW_AT_decl_file   : 13
    <101d>   DW_AT_decl_line   : 192
    <101e>   DW_AT_decl_column : 30
    <101f>   DW_AT_type        : <0xf5c>
    <1023>   DW_AT_data_member_location: 4
 <2><1024>: Abbrev Number: 1 (DW_TAG_member)
    <1025>   DW_AT_name        : (indirect string, offset: 0xeacd): pBuffPtr
    <1029>   DW_AT_decl_file   : 13
    <102a>   DW_AT_decl_line   : 194
    <102b>   DW_AT_decl_column : 31
    <102c>   DW_AT_type        : <0x10ed>
    <1030>   DW_AT_data_member_location: 36
 <2><1031>: Abbrev Number: 1 (DW_TAG_member)
    <1032>   DW_AT_name        : (indirect string, offset: 0x4f453): XferSize
    <1036>   DW_AT_decl_file   : 13
    <1037>   DW_AT_decl_line   : 196
    <1038>   DW_AT_decl_column : 30
    <1039>   DW_AT_type        : <0x246>
    <103d>   DW_AT_data_member_location: 40
 <2><103e>: Abbrev Number: 1 (DW_TAG_member)
    <103f>   DW_AT_name        : (indirect string, offset: 0x5f998): XferCount
    <1043>   DW_AT_decl_file   : 13
    <1044>   DW_AT_decl_line   : 198
    <1045>   DW_AT_decl_column : 30
    <1046>   DW_AT_type        : <0x252>
    <104a>   DW_AT_data_member_location: 42
 <2><104b>: Abbrev Number: 1 (DW_TAG_member)
    <104c>   DW_AT_name        : (indirect string, offset: 0xa4215): XferOptions
    <1050>   DW_AT_decl_file   : 13
    <1051>   DW_AT_decl_line   : 200
    <1052>   DW_AT_decl_column : 30
    <1053>   DW_AT_type        : <0x263>
    <1057>   DW_AT_data_member_location: 44
 <2><1058>: Abbrev Number: 1 (DW_TAG_member)
    <1059>   DW_AT_name        : (indirect string, offset: 0x46054): PreviousState
    <105d>   DW_AT_decl_file   : 13
    <105e>   DW_AT_decl_line   : 202
    <105f>   DW_AT_decl_column : 30
    <1060>   DW_AT_type        : <0x263>
    <1064>   DW_AT_data_member_location: 48
 <2><1065>: Abbrev Number: 1 (DW_TAG_member)
    <1066>   DW_AT_name        : (indirect string, offset: 0x9c94c): hdmatx
    <106a>   DW_AT_decl_file   : 13
    <106b>   DW_AT_decl_line   : 205
    <106c>   DW_AT_decl_column : 31
    <106d>   DW_AT_type        : <0xeda>
    <1071>   DW_AT_data_member_location: 52
 <2><1072>: Abbrev Number: 1 (DW_TAG_member)
    <1073>   DW_AT_name        : (indirect string, offset: 0x9bebf): hdmarx
    <1077>   DW_AT_decl_file   : 13
    <1078>   DW_AT_decl_line   : 207
    <1079>   DW_AT_decl_column : 31
    <107a>   DW_AT_type        : <0xeda>
    <107e>   DW_AT_data_member_location: 56
 <2><107f>: Abbrev Number: 1 (DW_TAG_member)
    <1080>   DW_AT_name        : (indirect string, offset: 0x722ef): Lock
    <1084>   DW_AT_decl_file   : 13
    <1085>   DW_AT_decl_line   : 209
    <1086>   DW_AT_decl_column : 30
    <1087>   DW_AT_type        : <0x9db>
    <108b>   DW_AT_data_member_location: 60
 <2><108c>: Abbrev Number: 1 (DW_TAG_member)
    <108d>   DW_AT_name        : (indirect string, offset: 0x6bd2f): State
    <1091>   DW_AT_decl_file   : 13
    <1092>   DW_AT_decl_line   : 211
    <1093>   DW_AT_decl_column : 30
    <1094>   DW_AT_type        : <0xfc5>
    <1098>   DW_AT_data_member_location: 61
 <2><1099>: Abbrev Number: 1 (DW_TAG_member)
    <109a>   DW_AT_name        : (indirect string, offset: 0xa60b7): Mode
    <109e>   DW_AT_decl_file   : 13
    <109f>   DW_AT_decl_line   : 213
    <10a0>   DW_AT_decl_column : 30
    <10a1>   DW_AT_type        : <0xffd>
    <10a5>   DW_AT_data_member_location: 62
 <2><10a6>: Abbrev Number: 1 (DW_TAG_member)
    <10a7>   DW_AT_name        : (indirect string, offset: 0x9d3fc): ErrorCode
    <10ab>   DW_AT_decl_file   : 13
    <10ac>   DW_AT_decl_line   : 215
    <10ad>   DW_AT_decl_column : 30
    <10ae>   DW_AT_type        : <0x263>
    <10b2>   DW_AT_data_member_location: 64
 <2><10b3>: Abbrev Number: 1 (DW_TAG_member)
    <10b4>   DW_AT_name        : (indirect string, offset: 0x672de): Devaddress
    <10b8>   DW_AT_decl_file   : 13
    <10b9>   DW_AT_decl_line   : 217
    <10ba>   DW_AT_decl_column : 30
    <10bb>   DW_AT_type        : <0x263>
    <10bf>   DW_AT_data_member_location: 68
 <2><10c0>: Abbrev Number: 1 (DW_TAG_member)
    <10c1>   DW_AT_name        : (indirect string, offset: 0x91bdb): Memaddress
    <10c5>   DW_AT_decl_file   : 13
    <10c6>   DW_AT_decl_line   : 219
    <10c7>   DW_AT_decl_column : 30
    <10c8>   DW_AT_type        : <0x263>
    <10cc>   DW_AT_data_member_location: 72
 <2><10cd>: Abbrev Number: 1 (DW_TAG_member)
    <10ce>   DW_AT_name        : (indirect string, offset: 0x4b173): MemaddSize
    <10d2>   DW_AT_decl_file   : 13
    <10d3>   DW_AT_decl_line   : 221
    <10d4>   DW_AT_decl_column : 30
    <10d5>   DW_AT_type        : <0x263>
    <10d9>   DW_AT_data_member_location: 76
 <2><10da>: Abbrev Number: 1 (DW_TAG_member)
    <10db>   DW_AT_name        : (indirect string, offset: 0x6aed6): EventCount
    <10df>   DW_AT_decl_file   : 13
    <10e0>   DW_AT_decl_line   : 223
    <10e1>   DW_AT_decl_column : 30
    <10e2>   DW_AT_type        : <0x263>
    <10e6>   DW_AT_data_member_location: 80
 <2><10e7>: Abbrev Number: 0
 <1><10e8>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <10e9>   DW_AT_byte_size   : 4
    <10e9>   DW_AT_type        : <0x53d>
 <1><10ed>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <10ee>   DW_AT_byte_size   : 4
    <10ee>   DW_AT_type        : <0x235>
 <1><10f2>: Abbrev Number: 4 (DW_TAG_typedef)
    <10f3>   DW_AT_name        : (indirect string, offset: 0x35e34): I2C_HandleTypeDef
    <10f7>   DW_AT_decl_file   : 13
    <10f8>   DW_AT_decl_line   : 243
    <10f9>   DW_AT_decl_column : 3
    <10fa>   DW_AT_type        : <0x1002>
 <1><10fe>: Abbrev Number: 9 (DW_TAG_structure_type)
    <10ff>   DW_AT_byte_size   : 44
    <1100>   DW_AT_decl_file   : 14
    <1101>   DW_AT_decl_line   : 46
    <1102>   DW_AT_decl_column : 9
    <1102>   DW_AT_sibling     : <0x1196>
 <2><1106>: Abbrev Number: 1 (DW_TAG_member)
    <1107>   DW_AT_name        : (indirect string, offset: 0xa60b7): Mode
    <110b>   DW_AT_decl_file   : 14
    <110c>   DW_AT_decl_line   : 48
    <110d>   DW_AT_decl_column : 12
    <110e>   DW_AT_type        : <0x257>
    <1112>   DW_AT_data_member_location: 0
 <2><1113>: Abbrev Number: 1 (DW_TAG_member)
    <1114>   DW_AT_name        : (indirect string, offset: 0xa471b): Direction
    <1118>   DW_AT_decl_file   : 14
    <1119>   DW_AT_decl_line   : 51
    <111a>   DW_AT_decl_column : 12
    <111b>   DW_AT_type        : <0x257>
    <111f>   DW_AT_data_member_location: 4
 <2><1120>: Abbrev Number: 1 (DW_TAG_member)
    <1121>   DW_AT_name        : (indirect string, offset: 0xa7943): DataSize
    <1125>   DW_AT_decl_file   : 14
    <1126>   DW_AT_decl_line   : 54
    <1127>   DW_AT_decl_column : 12
    <1128>   DW_AT_type        : <0x257>
    <112c>   DW_AT_data_member_location: 8
 <2><112d>: Abbrev Number: 1 (DW_TAG_member)
    <112e>   DW_AT_name        : (indirect string, offset: 0x6739): CLKPolarity
    <1132>   DW_AT_decl_file   : 14
    <1133>   DW_AT_decl_line   : 57
    <1134>   DW_AT_decl_column : 12
    <1135>   DW_AT_type        : <0x257>
    <1139>   DW_AT_data_member_location: 12
 <2><113a>: Abbrev Number: 1 (DW_TAG_member)
    <113b>   DW_AT_name        : (indirect string, offset: 0x6b12d): CLKPhase
    <113f>   DW_AT_decl_file   : 14
    <1140>   DW_AT_decl_line   : 60
    <1141>   DW_AT_decl_column : 12
    <1142>   DW_AT_type        : <0x257>
    <1146>   DW_AT_data_member_location: 16
 <2><1147>: Abbrev Number: 13 (DW_TAG_member)
    <1148>   DW_AT_name        : NSS
    <114c>   DW_AT_decl_file   : 14
    <114d>   DW_AT_decl_line   : 63
    <114e>   DW_AT_decl_column : 12
    <114f>   DW_AT_type        : <0x257>
    <1153>   DW_AT_data_member_location: 20
 <2><1154>: Abbrev Number: 1 (DW_TAG_member)
    <1155>   DW_AT_name        : (indirect string, offset: 0x43a22): BaudRatePrescaler
    <1159>   DW_AT_decl_file   : 14
    <115a>   DW_AT_decl_line   : 67
    <115b>   DW_AT_decl_column : 12
    <115c>   DW_AT_type        : <0x257>
    <1160>   DW_AT_data_member_location: 24
 <2><1161>: Abbrev Number: 1 (DW_TAG_member)
    <1162>   DW_AT_name        : (indirect string, offset: 0x6749e): FirstBit
    <1166>   DW_AT_decl_file   : 14
    <1167>   DW_AT_decl_line   : 73
    <1168>   DW_AT_decl_column : 12
    <1169>   DW_AT_type        : <0x257>
    <116d>   DW_AT_data_member_location: 28
 <2><116e>: Abbrev Number: 1 (DW_TAG_member)
    <116f>   DW_AT_name        : (indirect string, offset: 0x5c589): TIMode
    <1173>   DW_AT_decl_file   : 14
    <1174>   DW_AT_decl_line   : 76
    <1175>   DW_AT_decl_column : 12
    <1176>   DW_AT_type        : <0x257>
    <117a>   DW_AT_data_member_location: 32
 <2><117b>: Abbrev Number: 1 (DW_TAG_member)
    <117c>   DW_AT_name        : (indirect string, offset: 0x72856): CRCCalculation
    <1180>   DW_AT_decl_file   : 14
    <1181>   DW_AT_decl_line   : 79
    <1182>   DW_AT_decl_column : 12
    <1183>   DW_AT_type        : <0x257>
    <1187>   DW_AT_data_member_location: 36
 <2><1188>: Abbrev Number: 1 (DW_TAG_member)
    <1189>   DW_AT_name        : (indirect string, offset: 0x563d6): CRCPolynomial
    <118d>   DW_AT_decl_file   : 14
    <118e>   DW_AT_decl_line   : 82
    <118f>   DW_AT_decl_column : 12
    <1190>   DW_AT_type        : <0x257>
    <1194>   DW_AT_data_member_location: 40
 <2><1195>: Abbrev Number: 0
 <1><1196>: Abbrev Number: 4 (DW_TAG_typedef)
    <1197>   DW_AT_name        : (indirect string, offset: 0x1da9d): SPI_InitTypeDef
    <119b>   DW_AT_decl_file   : 14
    <119c>   DW_AT_decl_line   : 84
    <119d>   DW_AT_decl_column : 3
    <119e>   DW_AT_type        : <0x10fe>
 <1><11a2>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <11a3>   DW_AT_encoding    : 7	(unsigned)
    <11a4>   DW_AT_byte_size   : 1
    <11a5>   DW_AT_type        : <0x1de>
    <11a9>   DW_AT_decl_file   : 14
    <11aa>   DW_AT_decl_line   : 90
    <11ab>   DW_AT_decl_column : 1
    <11ac>   DW_AT_sibling     : <0x11e1>
 <2><11b0>: Abbrev Number: 2 (DW_TAG_enumerator)
    <11b1>   DW_AT_name        : (indirect string, offset: 0x68fe7): HAL_SPI_STATE_RESET
    <11b5>   DW_AT_const_value : 0
 <2><11b6>: Abbrev Number: 2 (DW_TAG_enumerator)
    <11b7>   DW_AT_name        : (indirect string, offset: 0x1ea0e): HAL_SPI_STATE_READY
    <11bb>   DW_AT_const_value : 1
 <2><11bc>: Abbrev Number: 2 (DW_TAG_enumerator)
    <11bd>   DW_AT_name        : (indirect string, offset: 0x87d10): HAL_SPI_STATE_BUSY
    <11c1>   DW_AT_const_value : 2
 <2><11c2>: Abbrev Number: 2 (DW_TAG_enumerator)
    <11c3>   DW_AT_name        : (indirect string, offset: 0x56f83): HAL_SPI_STATE_BUSY_TX
    <11c7>   DW_AT_const_value : 3
 <2><11c8>: Abbrev Number: 2 (DW_TAG_enumerator)
    <11c9>   DW_AT_name        : (indirect string, offset: 0x5617b): HAL_SPI_STATE_BUSY_RX
    <11cd>   DW_AT_const_value : 4
 <2><11ce>: Abbrev Number: 2 (DW_TAG_enumerator)
    <11cf>   DW_AT_name        : (indirect string, offset: 0x41208): HAL_SPI_STATE_BUSY_TX_RX
    <11d3>   DW_AT_const_value : 5
 <2><11d4>: Abbrev Number: 2 (DW_TAG_enumerator)
    <11d5>   DW_AT_name        : (indirect string, offset: 0x7c802): HAL_SPI_STATE_ERROR
    <11d9>   DW_AT_const_value : 6
 <2><11da>: Abbrev Number: 2 (DW_TAG_enumerator)
    <11db>   DW_AT_name        : (indirect string, offset: 0x1717f): HAL_SPI_STATE_ABORT
    <11df>   DW_AT_const_value : 7
 <2><11e0>: Abbrev Number: 0
 <1><11e1>: Abbrev Number: 4 (DW_TAG_typedef)
    <11e2>   DW_AT_name        : (indirect string, offset: 0x917ee): HAL_SPI_StateTypeDef
    <11e6>   DW_AT_decl_file   : 14
    <11e7>   DW_AT_decl_line   : 99
    <11e8>   DW_AT_decl_column : 3
    <11e9>   DW_AT_type        : <0x11a2>
 <1><11ed>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <11ee>   DW_AT_type        : <0x11e1>
 <1><11f2>: Abbrev Number: 27 (DW_TAG_structure_type)
    <11f3>   DW_AT_name        : (indirect string, offset: 0x8f43e): __SPI_HandleTypeDef
    <11f7>   DW_AT_byte_size   : 88
